[{"event_key":"1","active":"Y","name":"Fedora and Red Hat Enterprise Linux Desktop","event_start":"2015-02-07 09:00:00","event_end":"2015-02-07 09:40:00","event_type":"Desktop","description":"I will go through the current work we are doing around the Desktop inside Red Hat and talk about our overall strategy and goals with investing in the desktop.","seats":"0","goers":"15","invite_only":"N","venue":"D0206","id":"5af24639486894848cb3706d509c13dc","venue_id":"253276","speakers":"Christian F.K. Schaller"},{"event_key":"10","active":"Y","name":"Life of a Fedora Cloud image","event_start":"2015-02-08 11:30:00","event_end":"2015-02-08 12:10:00","event_type":"Fedora","description":"This talk explains the life cycle of the Fedora cloud images. <br \/><br \/>Talk outline:<br \/><br \/>1. Introduction to Fedora Cloud SIG.<br \/>2. Tools we use to create the Cloud images and details about different subprojects.<br \/>3. Build-system for the Cloud images and how one can replicate the system in a personal machine.<br \/>4. About the testing of the images.<br \/>5. How one can start helping out in the Cloud SIG.<br \/>6. What next for Fedora Cloud.","seats":"0","goers":"4","invite_only":"N","venue":"D105","id":"eeed63d53da6d2ae637fba19da43cc9f","venue_id":"253275","speakers":"Kushal Das"},{"event_key":"100","active":"Y","name":"Tales from the trenches, more portability woes","event_start":"2015-02-07 15:00:00","event_end":"2015-02-07 15:40:00","event_type":"Hardware","description":"More tales of bugs discovered while bringing up Fedora on AArch64 and PowerPC64 LE. Features hilarious anecdotes about mis-programmed software making non-portable assumptions and X86-centric decisions. Emphasis placed on toolchain and kernel issues.","seats":"0","goers":"6","invite_only":"N","venue":"E104","id":"4c5a6934ddb5efe93a830d2e3af92c4c","venue_id":"253279","speakers":"Kyle McMartin"},{"event_key":"101","active":"Y","name":"Manage your systems with OpenLMI","event_start":"2015-02-07 15:50:00","event_end":"2015-02-07 16:30:00","event_type":"System management","description":"OpenLMI offers a comprehensive way to manage remotely Linux operating systems. The aim of the talk to show the audience practical examples of solving the usual system administration tasks using OpenLMI.","seats":"0","goers":"5","invite_only":"N","venue":"D105","id":"5e233f3b9ec7822f27106ebb8147d0c0","venue_id":"253275","speakers":"Tomáš Smetana"},{"event_key":"102","active":"Y","name":"Full stack JavaScript","event_start":"2015-02-07 15:50:00","event_end":"2015-02-07 16:30:00","event_type":"OpenShift","description":"Grant Shipley, lead Evangelist for OpenShift, will demonstrate how to develop iPhone and Android apps with MongoDB backends for the cloud. Let's skip having to learn three different languages and jumpstart the development process using what you already know. We will start with developing a native mobile application using only javascript. Next, we'll deploy our app to the cloud using node.js and explore a few tips and tricks for managing the MongoDB backend.","seats":"0","goers":"2","invite_only":"N","venue":"D0206","id":"1e31cd40d5015cb43e0fb62c4fb532fe","venue_id":"253276","speakers":"Grant Shipley"},{"event_key":"103","active":"Y","name":"Automated testing of graphical applications using OpenCV and Tesseract","event_start":"2015-02-07 15:50:00","event_end":"2015-02-07 16:30:00","event_type":"Software Quality","description":"In this talk we present brand new GUI testing framework aiming for robustness and ease of use. Similar to Sikuli and OpenQA, the tool can automatically perform actions against any GUI using advanced image processing and character recognition, specifically crafted to allow automatic installation testing of Fedora releases.","seats":"0","goers":"10","invite_only":"N","venue":"E112","id":"03edf765bf5a916ce8e4509f1a29bd42","venue_id":"253278","speakers":"Richard Marko"},{"event_key":"104","active":"Y","name":"Using Lambda Expressions to query a datastore","event_start":"2015-02-07 15:50:00","event_end":"2015-02-07 16:30:00","event_type":"Development","description":"What about taking advantage of the type-safety and expressiveness of<br \/> Java 8 Lambda Expressions to write queries that would be executed on a<br \/> datastore ? Oh wait, that's not so simple...<br \/> During this talk, we will see the challenges behind using such<br \/> expressions (hint: this includes reading bytecode!), and we'll see how<br \/> this can be integrated with the MongoDB java driver to submit queries in<br \/> The native BSON format on the datastore.","seats":"0","goers":"6","invite_only":"N","venue":"D0207","id":"be892830ef860e43f22c6cfbdc00b439","venue_id":"253277","speakers":"Xavier Coulon"},{"event_key":"105","active":"Y","name":"Raspberry Pi and GPIO","event_start":"2015-02-07 15:50:00","event_end":"2015-02-07 16:30:00","event_type":"Hardware","description":"Everyone knows Raspberry Pi. Almost everyone knows how to use strange pins on corner of board. I will show you basic of GPIO on Raspberry Pi using Python. You will learn how to turn Raspberry Pi to Internet of Things device and how to connect it to cloud.","seats":"0","goers":"10","invite_only":"N","venue":"E104","id":"d184161637aea090d7300453b8714f22","venue_id":"253279","speakers":"Štěpán Bechynský"},{"event_key":"106","active":"Y","name":"Using Fedora as a base for the IoT revolution","event_start":"2015-02-07 16:40:00","event_end":"2015-02-07 17:20:00","event_type":"Hardware, Fedora","description":"There's a lot of new technologies and standards out there that are driving the IoT (Internet of Things) revolution including 802.15.4 WPAN, 6LOWPAN, Thread group, MQTT, CoAP. A lot of those standards have open source reference implementations. There's a lot of existing IoT devices that run Linux on ARM. What is the state of these in Fedora? How well do they work? What extra work needs to be done to enable Fedora to excel as a development platform for the Internet of Things revolution. I'll cover kernel and hardware support, network stack support, gateway requirements as well as a number of messaging and middleware components that are designed for enabling of IoT devices, gateways as well as IoT server components that might be useful in a complete IoT platform.","seats":"0","goers":"7","invite_only":"N","venue":"D105","id":"cf4bc3438a0768e4bbcd753abbc83ec0","venue_id":"253275","speakers":"Peter Robinson"},{"event_key":"107","active":"Y","name":"Using Natural Language Processing To Make A Security Assistant","event_start":"2015-02-07 16:40:00","event_end":"2015-02-07 17:20:00","event_type":"Security","description":"Natural Language Processing (NLP) is an artificial intelligence user interface methodology where users can ask questions as if they were having a conversation with another person. During this presentation, a Computer Security Assistant will be demonstrated that can assess, secure, and monitor threats in a computer system just by having a conversation with it. This talk will go over Artificial Intelligence Markup Language (AIML) and how it functions to be the user interface to a smart assistant. By making AIML the user interface driver, it can also be shown that this security assistant can be converted to any other kind of assistant simply be changing out the AIML files. Hopefully this will inspire other developers to look into this technology.","seats":"0","goers":"2","invite_only":"N","venue":"D0206","id":"7709515660ec0650678af5f8adb872cf","venue_id":"253276","speakers":"Steve Grubb"},{"event_key":"108","active":"Y","name":"Testing TLS","event_start":"2015-02-07 16:40:00","event_end":"2015-02-07 17:20:00","event_type":"Software Quality","description":"Why testing TLS is hard. Why general fuzzers can't be used for testing TLS implementations. Why typical testing can't catch bugs like Heartbleed or goto fail. I'll also present an open source tool aimed at testing TLS implementations.","seats":"0","goers":"7","invite_only":"N","venue":"E112","id":"2570a476ae1530b01197e5e8337d8d5c","venue_id":"253278","speakers":"Hubert Kario"},{"event_key":"109","active":"Y","name":"icedtea-web goes offlline","event_start":"2015-02-07 16:40:00","event_end":"2015-02-07 17:20:00","event_type":"Development","description":"\"Icedtea web is open-source javaws and java browser plugin.<br \/> The future is not inclined for javaws and java-plugin at all... Chromium is cutting npapi down, what will come next? icedtea-web is trying to allow to run legacy applets out of browser and to run both applets and javaws offline.<br \/> Lest see how and if it can be useful.\"","seats":"0","goers":"2","invite_only":"N","venue":"D0207","id":"b8961e3e748f8e0c87c335fa255bfba5","venue_id":"253277","speakers":"Jiri Vanek"},{"event_key":"11","active":"Y","name":"Discuss Environment and Stacks in Fedora","event_start":"2015-02-08 12:30:00","event_end":"2015-02-08 13:10:00","event_type":"Fedora","description":"Great opportunity to get involved in defining Fedora future and to meet some of the members of Environment and Stacks working group to consult various topics with other Fedora friends. Topics may relate to dynamic languages, other kinds of stacks, testing, continuous integration, other ideas listed at http:\/\/fedoraproject.org\/wiki\/Env_and_Stacks\/Tasklist or whatever you wish. Come and tell us your story, issues, requests or ideas.","seats":"0","goers":"3","invite_only":"N","venue":"D105","id":"ee6a795b2f3562b4849ff02cd21f5fd9","venue_id":"253275","speakers":"Honza Horak"},{"event_key":"110","active":"Y","name":"Building walking robots with Arduino and Python","event_start":"2015-02-07 16:40:00","event_end":"2015-02-07 17:20:00","event_type":"Hardware","description":"\"Building and programming walking robots is easier to start than it may seem, and lots of fun. You won't build another Boston Dynamics Big Dog or MIT Cheetah, but you can easily build a simple bipedal Bob robot, or make a stuffed toy sheep walk around on four legs. I'm going to show several robots that I have build, and give some hints for building your own.<br \/> <br \/> Project page: http:\/\/sheep.art.pl\/Robots<br \/> Presentation: https:\/\/bitbucket.org\/thesheep\/slides-robots\/downloads\/robots.zip\"","seats":"0","goers":"6","invite_only":"N","venue":"E104","id":"45db4c0360d5066a1c1528bd885a0d8b","venue_id":"253279","speakers":"Radomir Dopieralski"},{"event_key":"111","active":"Y","name":"Lightning talks","event_start":"2015-02-07 17:30:00","event_end":"2015-02-07 19:00:00","event_type":"Lightning talks","description":"Schedule of lightning talks will be announced 1 hour before start of the session<br \/><br \/>Please look here for details:<br \/><a href=\"http:\/\/goo.gl\/jaUpV9\" target=\"_blank\">http:\/\/goo.gl\/jaUpV9<\/a>","seats":"0","goers":"3","invite_only":"N","venue":"D105","id":"7aad208dd19c4d412674920461c4b6d6","venue_id":"253275"},{"event_key":"112","active":"Y","name":"Lightning talks","event_start":"2015-02-07 17:30:00","event_end":"2015-02-07 19:00:00","event_type":"Lightning talks","description":"Schedule of lightning talks will be announced 1 hour before start of the session<br \/><br \/>Please look here for details:<br \/><a href=\"http:\/\/goo.gl\/jaUpV9\" target=\"_blank\">http:\/\/goo.gl\/jaUpV9<\/a>","seats":"0","goers":"2","invite_only":"N","venue":"D0206","id":"3144c5c4f43dfdbf95f6f6fdcb87f0ec","venue_id":"253276"},{"event_key":"113","active":"Y","name":"Quality Lightning talks","event_start":"2015-02-07 17:30:00","event_end":"2015-02-07 19:00:00","event_type":"Software Quality","description":"Chapters from Toolchain testing: SystemTap - Martin Cermak, Eclipse as a part of Developer Toolset - Milos Prchlik, Testing glibc! - Arjun Shankar [QA]","seats":"0","goers":"4","invite_only":"N","venue":"E112","id":"27b34b52b4d2813bf71be612619af8fd","venue_id":"253278","speakers":"Martin Cermak, Milos Prchlik, Arjun Shankar"},{"event_key":"114","active":"Y","name":"Lightning talks","event_start":"2015-02-07 17:30:00","event_end":"2015-02-07 19:00:00","event_type":"Lightning talks","description":"Schedule of lightning talks will be announced 1 hour before start of the session<br \/><br \/>Please look here for details:<br \/><a href=\"http:\/\/goo.gl\/jaUpV9\" target=\"_blank\">http:\/\/goo.gl\/jaUpV9<\/a>","seats":"0","goers":"4","invite_only":"N","venue":"D0207","id":"25cbe583cc74afef924a31701dcff7ea","venue_id":"253277"},{"event_key":"115","active":"Y","name":"Running a SIG in CentOS","event_start":"2015-02-08 09:00:00","event_end":"2015-02-08 09:40:00","event_type":"CentOS","description":"Special interest groups in CentOS is a way to build a specialized variant of CentOS to solve specific set of issues. SIGs have the freedom to add more cutting edge software or rebuild existing packages depending upon the requirement. This provides an excellent opportunity for the community to get best of both worlds i.e. stability of CentOS and newer technology from open source projects. This also creates a new way to consume technologies within CentOS ecosystem. In this session I will explain the process required to start a SIG along with little bit history and background. This session should give enough information to users so that they can get started with SIG.<br \/> <br \/> Link1: http:\/\/wiki.centos.org\/SpecialInterestGroup\/Storage<br \/> Link2: http:\/\/wiki.centos.org\/SpecialInterestGroup\/Storage\/Proposal","seats":"0","goers":"2","invite_only":"N","venue":"D0206","id":"e24ab6b877a2e0fb0e23b016d665739d","venue_id":"253276","speakers":"Lalatendu Mohanty"},{"event_key":"116","active":"Y","name":"System\/Networking performance analytics with perf","event_start":"2015-02-08 09:00:00","event_end":"2015-02-08 09:40:00","event_type":"Networking & SDN","description":"\" perf has become the defacto standard for linux performance analysis. Often the most basic commands are just enough to pinpoint bottlenecks and get a feeling what is going on. But perf is much more powerful...<br \/> <br \/> In this talk we will explore what other features perf provides: Besides simply checking where the CPU spends most of its cycles, one can easily add custom tracepoints and capture arguments or return values from functions. We will do so on examples in the networking stack. This will be useful to isolate bugs or even validate patches.<br \/> <br \/> In an outlook the talk will introduce the audience what performance counters are available on today's CPUs but not easily accessible in perf. A short introduction will be given on how the register and masks are to be interpreted from the CPU manuals and how they can be used from perf. As examples we will analyse the MOESI protocol and memory bus traffic between different NUMA nodes.\"","seats":"0","goers":"8","invite_only":"N","venue":"E112","id":"6c8998851e844de79d74a9a242d1f836","venue_id":"253278","speakers":"Hannes Frederic Sowa"},{"event_key":"117","active":"Y","name":"Testing Best Practices in Open Source World","event_start":"2015-02-08 09:00:00","event_end":"2015-02-08 09:40:00","event_type":"Software Quality","description":"\"1. Why Fedora QA is important<br \/> 2. Yeah! you can do so many things - (Ways to contribute as Fedora QA - Release Validation Testing, Bodhi Testing, Create Test Cases)<br \/> 3. Oh it's Buggy, time to rasie it - (All about Triaging and managing bugs)<br \/> 4. Come, join the party @ test day - (Introduction to Test Days)<br \/> 5. Play with tools - (Testing tools like AutoQA, python-bugzilla, Bugzilla)<br \/> 6. Need some help? - (IRC channels, mailing lists, useful links)\"","seats":"0","goers":"9","invite_only":"N","venue":"D0207","id":"606791b9cf39b2086346051880c1c432","venue_id":"253277","speakers":"Amita Sharma"},{"event_key":"118","active":"Y","name":"CentOS for Fedora","event_start":"2015-02-08 09:50:00","event_end":"2015-02-08 10:30:00","event_type":"CentOS","description":"TBD","seats":"0","goers":"5","invite_only":"N","venue":"D0206","id":"bda7c361d0c8cdfafdf9660e5a10bcc9","venue_id":"253276","speakers":"Karanbir Singh"},{"event_key":"119","active":"Y","name":"Experimenting with Bridge, Open vSwitch and DPDK.","event_start":"2015-02-08 09:50:00","event_end":"2015-02-08 10:30:00","event_type":"Networking & SDN","description":"There is an on going effort to speed up packet processing in Linux. Open vSwitch, Linux bridge and other devices can benefit from that. However, there is an userspace alternative called DPDK (Intel's Data Plane Development Kit) promising impressive numbers. This talk will go over some scenarios showing OVS, OVS integrated with DPDK and Linux bridge performance numbers and findings.","seats":"0","goers":"5","invite_only":"N","venue":"E112","id":"eefd215af640f8e51e5a9084ef9726b3","venue_id":"253278","speakers":"Flavio Leitner"},{"event_key":"12","active":"Y","name":"Bodhi2, MirrorManager2, progit, FAS3, anitya, the-new-coolness... What's going on in Fedora infra?","event_start":"2015-02-08 10:40:00","event_end":"2015-02-08 11:20:00","event_type":"Fedora","description":"The Fedora Infra folks have been working on a number of projects over the last<br \/>year, some you have probably heard about, other likely not.<br \/>In this talk, I would like to present you what we have been doing, what is in<br \/>progress and what we have in mind for the coming year.<br \/>This is of course not only a list of things worked, planned or in progress but<br \/>also an invitation for anyone in the room to come, find a project they like<br \/>and join us in making it real or better.<br \/>From mirroring, to account system via package update and rebuild, I'm sure there<br \/>is a project to spike everyone's interest :)","seats":"0","goers":"8","invite_only":"N","venue":"D0206","id":"4a1374339563f9be89ff0a9ea9717472","venue_id":"253276","speakers":"Pierre-Yves Chibon"},{"event_key":"120","active":"Y","name":"Integrating Network Access and End Point Assessment with Trusted Network Connect (TNC)","event_start":"2015-02-08 10:40:00","event_end":"2015-02-08 11:20:00","event_type":"Networking & SDN","description":"\"Traditionally network access control (NAC) has lacked endpoint assessment in its decision making. This lack of assessment can leave an enterprise's network vulnerable to malicious attacks. Trusted Computing Group (TCG) and IETF have defined an open architecture called Trusted network connect (TNC) to fill this gap. TNC, as part of its architectural components, includes integrity measurement collectors (IMCs) at network endpoints and integrity measurement verifiers (IMVs) at enterprise's network to evaluate and verify the endpoints against the enterprise policies before allowing network access. <br \/> <br \/> This talk will cover: <br \/> 1) What is end point assessment and why it is needed?<br \/> 2) Why existing NAC technologies are missing end point assessment? <br \/> 3) TNC architecture and how it can help with end point assessment?<br \/> 4) What open source tools can be used to deploy TNC?\"","seats":"0","goers":"1","invite_only":"N","venue":"E112","id":"67f122d53299d6f1f976715ff97a8c56","venue_id":"253278","speakers":"Avesh Agarwal"},{"event_key":"121","active":"Y","name":"Automation in Fedora with Taskotron","event_start":"2015-02-08 09:50:00","event_end":"2015-02-08 10:30:00","event_type":"Fedora, Software Quality","description":"Taskotron recently replaced AutoQA as the default automation solution for Fedora QA but what is Taskotron? This talk will include reasons why we replaced a long-running, stable system with something brand new, what this new system is capable of and where we're planning to go with it. Most importantly, the talk will go over implications for Fedora contributors and what they will be able to do with Taskotron.<br \/> <br \/> Home Page: http:\/\/fedoraproject.org\/wiki\/Taskotron<br \/> Production Instance: https:\/\/taskotron.fedoraproject.org\/","seats":"0","goers":"10","invite_only":"N","venue":"D0207","id":"8c3bf93c8d49ed232021efc95f808b28","venue_id":"253277","speakers":"Tim Flink"},{"event_key":"122","active":"Y","name":"openconnect VPN","event_start":"2015-02-08 11:30:00","event_end":"2015-02-08 12:10:00","event_type":"Networking & SDN","description":"\"Openconnect is a relatively new VPN solution. It started as a clone of<br \/> CISCO's anyconnect VPN server, but it has now surpassed that role and<br \/> provides a reliable VPN solution with a very conservative security<br \/> architecture. This talk will address the question on the need for a new VPN<br \/> solution given the plethora of open source VPN solutions, the distinctive<br \/> features and capabilities of openconnect and an insight on the current<br \/> development status.<br \/> <br \/> http:\/\/www.infradead.org\/openconnect\/\"","seats":"0","goers":"3","invite_only":"N","venue":"E112","id":"3a918eb151c2b57a650c2560cfa66f3f","venue_id":"253278","speakers":"Nikos Mavrogiannopoulos"},{"event_key":"123","active":"Y","name":"rebase-helper - tool for fast rebases","event_start":"2015-02-08 11:30:00","event_end":"2015-02-08 12:10:00","event_type":"Development","description":"\"Package maintainers have to do a lot of manual tasks when new upstream version of a package is released. We identified that a lot of these tasks can be fully (or at least partially) automated to assist the maintainer. The rebase-helper is the tool to help package maintainers in various distributions with automating most of the tasks related with the package rebase. We intend to integrate the tool with Fedora infrastructure and Upstream Release Monitoring in the future, to help with assessing the difficulty of package rebase.<br \/> <br \/> https:\/\/github.com\/phracek\/rebase-helper<br \/> <br \/> Note: If possible, we would like to have the presentation on Sunday.<br \/> \"","seats":"0","goers":"5","invite_only":"N","venue":"D0207","id":"eaa33675a50f433dd90b63734d7d0cfe","venue_id":"253277","speakers":"Tomas Hozza, Petr Hracek"},{"event_key":"124","active":"Y","name":"SCE wide system assessment for upgrading Fedora","event_start":"2015-02-08 12:30:00","event_end":"2015-02-08 13:10:00","event_type":"Fedora","description":"\"OpenSCAP and Preupgrade Assistant assists users to upgrade Fedora from the old major release (like F21) to newer major release (like F22).<br \/> Basically Preupgrade Assistant calls OpenSCAP SCE engine.<br \/> Preupgrade Assistant delivers a bunch of check scripts which assess the upgraded system and check scripts inform user whether there are problems with upgrade and helps user to upgrade system or not to the latest version.<br \/> The alone upgrade is done by fedup tool.<br \/> This presentation has a aim to show users how SCE (part of openscap) can be used for wide system assessments.\"","seats":"0","goers":"1","invite_only":"N","venue":"D0206","id":"7e0230179464d871831b73471107d5ff","venue_id":"253276","speakers":"Petr Hracek"},{"event_key":"125","active":"Y","name":"Ceph FS development update","event_start":"2015-02-08 12:30:00","event_end":"2015-02-08 13:10:00","event_type":"Storage","description":"\"Ceph provides a resilient and scalable storage model (RADOS) using clusters of commodity hardware. Along with the RADOS block device (RBD), and the RADOS object gateway (RGW), Ceph also provides a POSIX filesystem interface (Ceph FS). While RBD and RGW have been in use for production workloads for some time, efforts to make Ceph FS ready for production are now underway.<br \/> <br \/> This presentation will introduce Ceph FS, explain its architecture, and provide an update on the latest development and testing work being done improve stability and manageability of the filesystem.<br \/> <br \/> http:\/\/ceph.com\/\"","seats":"0","goers":"10","invite_only":"N","venue":"E112","id":"12937d31432c3d03e256e27711c83c66","venue_id":"253278","speakers":"John Spray"},{"event_key":"126","active":"Y","name":"Open Build Service, good, bad and ugly","event_start":"2015-02-08 12:30:00","event_end":"2015-02-08 13:10:00","event_type":"Development, CentOS","description":"Open Build Service is an open source project to build packages and even whole distributions. It is mainly used by openSUSE, but also by Tinzen and others. Talk will start with generic overview of what it can do, what are the strong sides, mention few weak sides and also some of the ugly hacks that we use in our (not related to openSUSE) project. Also just for the fun of it, we tried to recompile whole CentOS on OBS to see how far would it go with minimum effort, so results of this simple experiment will be part of the presentation.","seats":"0","goers":"8","invite_only":"N","venue":"D0207","id":"b26a16ce737913a1773acca5a01f2028","venue_id":"253277","speakers":"Michal Hrusecky"},{"event_key":"127","active":"Y","name":"Fedora Council Joint Session","event_start":"2015-02-08 13:20:00","event_end":"2015-02-08 14:00:00","event_type":"Fedora","description":"A panel talk with Fedora Council members to close out the Fedora day at DevConf.cz. Brief comments from each member, and then Q&A from the audience.","seats":"0","goers":"4","invite_only":"N","venue":"D105","id":"2a177c40aea437df693a6f34202b1b61","venue_id":"253275","speakers":"Fedora Council Members"},{"event_key":"128","active":"Y","name":"Security Threats at Conferences","event_start":"2015-02-08 13:20:00","event_end":"2015-02-08 14:00:00","event_type":"Security","description":"\"In this talk I will raise awareness for security threats against developers and <br \/> contributors during conferences and show mitigation techniques and best<br \/> practices to avoid them. A lot of attacks that happen less likely if someone<br \/> uses the Internet from a secure station at home become dangerous, if for <br \/> example WiFi networks at conferences are used. But there are a lot of<br \/> possibilities that allow to reduce the risk. Using the Fedora Project as an<br \/> example I will show what can be done in the infrastructure and by the <br \/> contributors to minimize the risk.<br \/> \"","seats":"0","goers":"11","invite_only":"N","venue":"D0206","id":"da5d41d4f784d25fefaf01038383bae9","venue_id":"253276","speakers":"Till Maas"},{"event_key":"129","active":"Y","name":"Efficient data maintenance in GlusterFS using Databases","event_start":"2015-02-08 13:20:00","event_end":"2015-02-08 14:00:00","event_type":"Storage","description":"\"A major challenge for any distributed file system like GlusterFS, is conducting data maintenance without seriously affecting I\/O response time. Solutions like a namespace crawl are inherently inefficient and may not provide correct information for any single point in time. Using a small, well <br \/> integrated database provides a major improvement over a namespace crawl, with minimal impact to system performance. The talk will focus on the results of a study to integrate a database with GlusterFS. Also the talk will include a demo.\"","seats":"0","goers":"3","invite_only":"N","venue":"E112","id":"e26e8c3f20bf8bf4c0c99c84ddaa4ef2","venue_id":"253278","speakers":"Joseph Elwin Fernandes"},{"event_key":"13","active":"Y","name":"Fedora Release Engineering Today","event_start":"2015-02-08 11:30:00","event_end":"2015-02-08 12:10:00","event_type":"Fedora","description":"In the last year there has been a lot of change in Release Engineering in Fedora, this talk will cover what we have worked on and what is coming next. We will outline a long term plan to make composes a seamless and transparent process, with plenty of options for help from everyone.","seats":"0","goers":"11","invite_only":"N","venue":"D0206","id":"e4616553e5404774a584032870635372","venue_id":"253276","speakers":"Dennis Gilmore"},{"event_key":"130","active":"Y","name":"lvm2 cache - will it blend ?","event_start":"2015-02-08 13:20:00","event_end":"2015-02-08 14:00:00","event_type":"Kernel, Storage","description":"Talk should focus on latest new feature in lvm2, how the user can use thin provisioning and caching together. How to reach better performance.","seats":"0","goers":"8","invite_only":"N","venue":"D0207","id":"82de8a8ee950f56fda3f58ee0fc43192","venue_id":"253277","speakers":"Zdenek Kabelac"},{"event_key":"131","active":"Y","name":"Is code in your project sane enough?","event_start":"2015-02-06 10:40:00","event_end":"2015-02-06 12:10:00","event_type":"Development, Workshop","description":"This demo session will show how we can easily check the sanity of code in our project. There is a tool named csmock, which takes an SRPM (or upstream tarball) and produces a list of possible defects in its code. Besides plug-ins for C\/C++ analyzers (GCC, Clang, Cppcheck), csmock now comes with experimental plug-ins for static analysis of python and shell scripts. We will also discuss how we can efficiently process the results of these tools and how to integrate them into our workflow.","seats":"0","goers":"10","invite_only":"N","venue":"Workshops – E105","id":"96dde3e6368aa36d852bc9f8aeb9a47c","venue_id":"254456","speakers":"Kamil Dudka"},{"event_key":"132","active":"Y","name":"Productive Java EE and HTML5 development with Eclipse (lab)","event_start":"2015-02-06 12:30:00","event_end":"2015-02-06 15:40:00","event_type":"Development, Middleware, Workshop","description":"During this session, we'll show how developers can be productive when building Java EE 7 + HTML5 applications in Eclipse. We will see how the tooling in Eclipse helps us scaffolding from an existing database using JPA, then exposing the entities via JAX-RS and integrated Forge tooling. Some advanced features of JAX-RS 2.0 such as filters and support for bean validation that are recently added will also be shown. Finally the content will be shown in the browser using HTML5 + AngularJS. If time (and network) allows, the application will even be deployed on a PaaS,<br \/> all without leaving the IDE. During this talk, you should expect<br \/> (almost) no slides, mostly coding and talking.","seats":"0","goers":"4","invite_only":"N","venue":"Workshops – A112","id":"314684ded68d0901666274ceba2111fb","venue_id":"254457","speakers":"Xavier Coulon, Marian Labuda"},{"event_key":"133","active":"Y","name":"OpenSCAD: Code your 3D models not only for 3D printing","event_start":"2015-02-06 10:40:00","event_end":"2015-02-06 12:10:00","event_type":"3D Printing, Workshop","description":"\"3D printing is a popular topic among geeks. One of the general problem we face is: Where to get a 3D model to print? Most of us are good coders, but lousy designers. Let's face it. Trying to produce some content in Blender drives me crazy and it usually ends up as crap. That's where OpenSCAD comes in handy. Quote from the OpenSCAD website [1]:<br \/> <br \/> \"\"OpenSCAD is not an interactive modeller. Instead it is something like a 3D-compiler that reads in a script file that describes the object and renders the 3D model from this script file. This gives you (the designer) full control over the modelling process and enables you to easily change any step in the modelling process or make designs that are defined by configurable parameters.\"\"<br \/> <br \/> In this workshop I'll teach you how to use OpenSCAD and how to create useful parametric 3D models designed mostly for 3D printing.<br \/> <br \/> [1] http:\/\/www.openscad.org\/\"","seats":"0","goers":"4","invite_only":"N","venue":"Workshops – A113","id":"c3831205fdb03fa159d589dea7d3e54e","venue_id":"254458","speakers":"Miro Hrončok"},{"event_key":"134","active":"Y","name":"DevAssistant Workshop – modern tool for developers","event_start":"2015-02-06 12:30:00","event_end":"2015-02-06 14:00:00","event_type":"Development, Workshop","description":"DevAssistant, the universal tool for kickstarting your development, has received a ton of new features in the latest couple of releases. Come see for yourself, and try it out on your own. You can now write assistant scripts in your preferred language (currently as long as it's Python, more are coming), our GitHub module supports two factor authentication, and there's a cool central repository where you can find all the assistant scripts.<br \/> <br \/> Web: https:\/\/www.devassistant.org","seats":"0","goers":"9","invite_only":"N","venue":"Workshops – E105","id":"e35211e0b0948b1eaf2a642fa89b711a","venue_id":"254456","speakers":"Tomas Radej"},{"event_key":"135","active":"Y","name":"Reliable code construction using cmockery2","event_start":"2015-02-06 10:40:00","event_end":"2015-02-06 12:10:00","event_type":"Software Quality, Workshop","description":"\"Developers use unit tests during development to maintain a high level of quality in their applications. Most of these developers create unit tests for applications written in languages like C++, Python, Ruby, Java, and Go. While developers writing applications in C language are likely not aware of this development model. The lab will concentrate on the benefits of programming-by-contract, unit test, and mocking methodologies using cmockery2, an extremely powerful and easy to use unit test framework for C language.<br \/> <br \/> Project: https:\/\/github.com\/lpabon\/cmockery2\"","seats":"0","goers":"4","invite_only":"N","venue":"Workshops – A112","id":"627eda251f27823dfdc96b0570c75dc0","venue_id":"254457","speakers":"Luis Pabon"},{"event_key":"136","active":"Y","name":"How to start with Go","event_start":"2015-02-06 12:30:00","event_end":"2015-02-06 14:00:00","event_type":"Development, Workshop","description":"\"Go is a general purpose programming language with advanced features and a clean syntax. Because of its wide availability on a variety of platforms, its robust well-documented common library, and its focus on good software engineering principles. This session will be about how you can start be productive with Go, how you can setup the language itself, how to use its tools, how to configure your favorite editor and more.<br \/> \"","seats":"0","goers":"10","invite_only":"N","venue":"Workshops – A113","id":"881ec1f2a607df5c61825bc13c0cfa7a","venue_id":"254458","speakers":"Michal Fojtik"},{"event_key":"137","active":"Y","name":"New RPM dependency Model","event_start":"2015-02-06 14:10:00","event_end":"2015-02-06 15:40:00","event_type":"Development, Workshop","description":"\"After a brief talk on the current state of weak and rich dependencies in RPM and their support in Fedora I want to collect possible use cases and discuss how these new dependencies can be used in Fedora and future RHEL versions. Ideally we would be able to come up with proposals for new packaging policies that can discussed and further refined publicly after the workshop.<br \/> <br \/> I am especially interested to hear from representatives of special interest groups that feel that the classic dependencies do not fulfill all their needs or hope the new dependency model may help their cause.\"","seats":"0","goers":"18","invite_only":"N","venue":"Workshops – E105","id":"11e9e2f0e59d450c05b4c56d07d8cfe7","venue_id":"254456","speakers":"Florian Festi"},{"event_key":"138","active":"Y","name":"Forging Versatile Development Tools","event_start":"2015-02-07 10:40:00","event_end":"2015-02-07 12:10:00","event_type":"Development, Middleware, Workshop","description":"In this hands-on lab, attendees will create a real usable add-on for JBoss Forge. The purpose of this add-on is to give users support for adding auditing capabilities to JPA entities with Hibernate Envers. The learned techniques are of course applicable to any of your favorite frameworks for which you want to build a better user experience. The lab also illustrates how the created functionality is available in your favorite IDE as well as in the form of CLI commands.","seats":"0","goers":"2","invite_only":"N","venue":"Workshops – A112","id":"5e46e0afa4d2b55027a6e7978b960cac","venue_id":"254457","speakers":"Koen Aers"},{"event_key":"139","active":"Y","name":"Cockpit Hackfest","event_start":"2015-02-06 14:10:00","event_end":"2015-02-06 17:20:00","event_type":"System management, Hackfest","description":"\"Cockpit is the modern Server UI for Linux. It's built to be very light, thin, secure, interactive and well integrated with the server and its services.<br \/> <br \/> Besides being a discoverable and polished UI out of the box, Cockpit has a powerful architecture that allows writing you to write server user interfaces for your projects. We'll demo how easy it is to prototype a user interface and interact with your server tool or service.<br \/> <br \/> When you come away from this talk you'll have a better idea of how Cockpit is put together: how it communicates with your server, authenticates users, connects out to multiple servers, is embeddable in other projects, and what makes it different from server control panels and configuration management software.<br \/> <br \/> http:\/\/cockpit-project.org\/\"","seats":"0","goers":"4","invite_only":"N","venue":"Workshops – A113","id":"411f41e00979698340f876b8a8119ef6","venue_id":"254458","speakers":"Stef Walter"},{"event_key":"14","active":"Y","name":"Google, ownCloud and your Fedora Workstation","event_start":"2015-02-08 10:40:00","event_end":"2015-02-08 11:20:00","event_type":"Desktop, Fedora","description":"Fedora Workstation brings various online services closer to the desktop. This talk will focus on Google and ownCloud - two popular service providers that are well integrated in Workstation.","seats":"0","goers":"8","invite_only":"N","venue":"D0207","id":"9f5af89e5baeaabcab438cd21441cb06","venue_id":"253277","speakers":"Debarshi Ray"},{"event_key":"140","active":"Y","name":"DNSSEC deployment from server and client side","event_start":"2015-02-06 15:50:00","event_end":"2015-02-06 17:20:00","event_type":"Networking, Workshop","description":"\"DNSSEC has been here for some time. But what it means to deploy it on the server? What is needed to keep your domain secured? There are a lot of manual and semi-automated tasks administrators need to do. This is where FreeIPA steps in and makes the deployment and maintenance of DNSSEC signed zone easy as few clicks in Web UI. Once you deployed DNSSEC on the server side, there is still some work to have your clients secured, too. Especially when using public hot-spots and networks, you should use secured DNS to eliminate man-in-the-middle attacks.<br \/> <br \/> In the lab we will briefly explain how DNSSEC works. Afterwards we will deploy a signed zone using only BIND and also BIND + FreeIPA combination. We will show how FreeIPA can ease your pain with DNSSEC deployment. In the end we will try out the DNSSEC from client side using dnssec-trigger and unbound server, to keep you secured at all times.<br \/> <br \/> Note: We will need at least 2 hours (2,5 maybe)\"","seats":"0","goers":"7","invite_only":"N","venue":"Workshops – E105","id":"dbedaa97a9632244231edd2fc4194179","venue_id":"254456","speakers":"Tomas Hozza, Petr Spacek"},{"event_key":"141","active":"Y","name":"How do I implement centralized authentication?","event_start":"2015-02-07 09:00:00","event_end":"2015-02-07 09:40:00","event_type":"Security, Workshop","description":"\"So you are running a big open source project with a wiki, source and release management systems, build system, and probably much more, and you want to avoid having people maintain different passwords for each and every one of the services?<br \/> In this talk, I will discuss different approaches to get around this, and their pros\/cons, based on real-world implementations.\"","seats":"0","goers":"14","invite_only":"N","venue":"Workshops – E105","id":"a62b42ab3dab44cc19d7e997c742422e","venue_id":"254456","speakers":"Patrick Uiterwijk"},{"event_key":"142","active":"Y","name":"Pushing Puppet (to it's limit)","event_start":"2015-02-07 09:50:00","event_end":"2015-02-07 11:20:00","event_type":"System management, Workshop","description":"\"A showcase of some fun (and useful) Puppet hacks that I've done, which<br \/> try to \"\"Push Puppet\"\" to its limit. Interspersed with live demos. Each<br \/> hack demonstrates a useful technique that was necessary to write a real<br \/> module. Each example\/demo links logically to the previous one. Many of<br \/> these techniques were developed to fill a need when writing advanced<br \/> Puppet modules, in particular, for the decentralized, highly available<br \/> Puppet-Gluster module. Hacks used for Puppet-IPA and other modules will<br \/> be show-cased too.\"","seats":"0","goers":"13","invite_only":"N","venue":"Workshops – E105","id":"841586357d411c70ada3f128778a325e","venue_id":"254456","speakers":"James Shubin (purpleidea)"},{"event_key":"143","active":"Y","name":"A Gentle Path Into Building Java EE Applications","event_start":"2015-02-07 09:00:00","event_end":"2015-02-07 10:30:00","event_type":"Development, Middleware, Workshop","description":"In this hands-on lab, attendees will create a Java EE application that uses most of the Java EE specifications (JPA, Bean Validation, CDI, JSF, JAX-RS...) and test it (JUnit and Arquillian). From a white sheet, JBoss Forge will help you to quick start it and add extra features to, finally, end-up with a fully functional application.","seats":"0","goers":"4","invite_only":"N","venue":"Workshops – A112","id":"2854167daebf71cbc947d2312397a21e","venue_id":"254457","speakers":"Koen Aers"},{"event_key":"144","active":"Y","name":"The guts of a modern NIC driver and bonding internals","event_start":"2015-02-07 09:50:00","event_end":"2015-02-07 11:20:00","event_type":"Networking, Workshop","description":"\"On this workshop we will navigate through how NIC drivers works and, after that, we will focus on how bonding internals work to clarify some pitfalls, like on why mode=5 doesn't work with virtualization.<br \/> \"","seats":"0","goers":"2","invite_only":"N","venue":"Workshops – A113","id":"2f0c197fc2e990f83240fae5e34bf25d","venue_id":"254458","speakers":"Marcelo Ricardo Leitner"},{"event_key":"145","active":"Y","name":"Virtualization on Secondary Architectures","event_start":"2015-02-07 11:30:00","event_end":"2015-02-07 13:10:00","event_type":"Virtualization, Workshop","description":"Everything about virtualization on secondary arches (s390, ppc, aarch64, ...) such as testing KVM on s390, hacking on virt-manager to add support for installing s390x\/ppc\/... guests, work on Kimchi (web based virt mgmt) package review and functionality, gnome-boxes and many more.","seats":"0","goers":"10","invite_only":"N","venue":"Workshops – E105","id":"bdf6b8eefe4ad42aab0fbcb50bb6e49b","venue_id":"254456","speakers":"Dan Horak"},{"event_key":"146","active":"Y","name":"Who's Afraid of Writing Docs?","event_start":"2015-02-07 15:00:00","event_end":"2015-02-07 16:30:00","event_type":"Documentation, Workshop","description":"This workshop is intended to be a follow up to a Fedora documentation hackfest held at Fudcon 2014 in Prague. It is targeting both the technical writers and developers who want to write documentation for their project. We will discuss various approaches to managing documentation, and will work on designing and implementing features for DevAssistant to help writers and developers get started with a new documentation project.\"","seats":"0","goers":"6","invite_only":"N","venue":"Workshops – A113","id":"b4c1717093204ff0612a7cc9d1f41fcb","venue_id":"254458","speakers":"Bara Ancincova, Petr Kovar"},{"event_key":"147","active":"Y","name":"Optimizing NP-complete problems with OptaPlanner","event_start":"2015-02-07 15:50:00","event_end":"2015-02-07 17:20:00","event_type":"Development, Middleware, Workshop","description":"OptaPlanner is a lightweight, embeddable planning engine written in Java that optimizes business resource usage. The workshop provides brief introduction to OptaPlanner followed by guided experimenting with this tool. Attendees will have a chance to get acquainted with using OptaPlanner on several examples (cloud balancing, etc.). No previous knowledge of OptaPlanner is required (although is welcome, of course). However, some programming skills in Java are expected.","seats":"0","goers":"2","invite_only":"N","venue":"Workshops – A112","id":"cddc7c6dc283d9782e429453e14e8ea8","venue_id":"254457","speakers":"Radovan Synek, Lukáš Petrovický, Jiří Vahala"},{"event_key":"148","active":"Y","name":"Kubernetes: launching your first application","event_start":"2015-02-07 13:20:00","event_end":"2015-02-07 14:50:00","event_type":"Containers, Workshop","description":"In this workshop I'll walk developers through starting their own kubernetes 'cluster'. Discuss infrastructure requirements for getting a scalable cluster. And will walk them through managing docker containers on their Kubernetes cluster. We will exercise all of the basic Kubernetes primitives and attendees should be able to leave the class connecting their own applications using the features provided by Kubernetes.<br \/> <br \/> https:\/\/github.com\/GoogleCloudPlatform\/kubernetes","seats":"0","goers":"11","invite_only":"N","venue":"Workshops – E105","id":"c46b5171e5764a1005e178cb29a9b524","venue_id":"254456","speakers":"Eric Paris"},{"event_key":"149","active":"Y","name":"Software Collections in tough reality","event_start":"2015-02-07 13:20:00","event_end":"2015-02-07 14:50:00","event_type":"CentOS, Development, Workshop","description":"This session is about Software Collections as introduced by http:\/\/softwarecollections.org. This technology allows you to install more versions of one package on one machine. Instead of introducing the basic concepts, participants will see some real world issues and more complicated use cases. You will learn how to deliver a new daemon without influencing the rest of the system, how to extend existing collections or what to expect from the new version of Software Collections technology.","seats":"0","goers":"10","invite_only":"N","venue":"Workshops – A113","id":"fb1ee70c7c6da122046952bc87f113f0","venue_id":"254458","speakers":"Honza Horak"},{"event_key":"15","active":"Y","name":"Future of Red Hat – Keynote","event_start":"2015-02-06 09:00:00","event_end":"2015-02-06 09:40:00","event_type":"Keynote","description":"The Future of Red Hat","seats":"0","goers":"40","invite_only":"N","venue":"D105","id":"b7c8d1266750745a95ea9d13b7ff284a","venue_id":"253275","speakers":"Tim Burke, Mark Little"},{"event_key":"150","active":"Y","name":"Avocado Workshop","event_start":"2015-02-07 15:00:00","event_end":"2015-02-07 16:30:00","event_type":"Software Quality, Workshop","description":"\"Avocado is next-generation testing framework inspired by Autotest, Virt-test, web browsers, GNU\/Linux and Git.<br \/> <br \/> In this workshop you'll see how to start using it, what are the current features and a bit about tests\/framework development. Right now I can't promise anything as the project is under _heavy_ development, but couple of the coolest things I see (not working) right now are native support for GDB, virt tools, test multiplexing, git-like test database and xunit\/json (Jenkins) output support.<br \/> <br \/> https:\/\/github.com\/avocado-framework\/avocado\"","seats":"0","goers":"4","invite_only":"N","venue":"Workshops – E105","id":"257f53721fe6c39c4536558a4a03a8f3","venue_id":"254456","speakers":"Lukáš Doktor"},{"event_key":"151","active":"Y","name":"Effective Beaker","event_start":"2015-02-07 11:30:00","event_end":"2015-02-07 13:10:00","event_type":"Software Quality, Workshop","description":"\"Do you run automated tests for your software, or do you wish you could? Do you need to test on multiple Linux distros or multiple hardware platforms (including those pesky non-x86 architectures you won't find in the cloud)? Or maybe your tests need exclusive access to a physical machine or VM?<br \/> <br \/> Beaker is an integration testing system where every job has exclusive access to one or more freshly provisioned machines. Its unique features include fully customizable installations at the start of the job, detection of kernel panics and installation failures, and support for coordinating tests across multiple hosts in a single job. Beaker is an open source project originating out of Red Hat's unique needs for operating system-level and kernel-level integration testing.<br \/> <br \/> If you're already an experienced user of Beaker, come along and share your tips and experiences with other Beaker users, and maybe you will learn about some Beaker features you never knew about","seats":"0","goers":"4","invite_only":"N","venue":"Workshops – A113","id":"4ae9fd1722ee0aad17966d9f4744be61","venue_id":"254458","speakers":"Dan Callaghan"},{"event_key":"152","active":"Y","name":"Hacking Jenkins","event_start":"2015-02-07 12:30:00","event_end":"2015-02-07 14:00:00","event_type":"Software Quality, Workshop","description":"\"Do you want to know how to get the most out of your Jenkins? Do you feel limited by its UI? <br \/> <br \/> You've come to the right place. During this workshop, you'll get our hands dirty and dive into the advanced features of Jenkins. You'll touch things like the remote access API as well as the script console and discover how you can manipulate your instance at runtime through the power of system scripting.<br \/> <br \/> Previous familiarity with the basic syntax of Java or Groovy and elementary Jenkins concepts is encouraged, though not necessary.<br \/> \"","seats":"0","goers":"9","invite_only":"N","venue":"Workshops – A112","id":"113b37b26455e6e43c3043e70ea00943","venue_id":"254457","speakers":"Miroslav Cupak"},{"event_key":"153","active":"Y","name":"Hacking Docker through OpenShft","event_start":"2015-02-07 16:40:00","event_end":"2015-02-07 19:00:00","event_type":"OpenShift, Workshop","description":"How to work with new OpenShift v3 and Docker","seats":"0","goers":"12","invite_only":"N","venue":"Workshops – E105","id":"0d54eb2e2d3b52ac3910ff5d7cc0c968","venue_id":"254456","speakers":"Marek Jelen, Vojtech Vitek, Michal Fojtik"},{"event_key":"154","active":"Y","name":"Super Privileged Containers (SPC)","event_start":"2015-02-08 09:00:00","event_end":"2015-02-08 10:30:00","event_type":"Containers, Workshop","description":"\"This session will cover building containers that need to manage the host OS.<br \/> <br \/> For example containers that talk to dbus or systemd. Containers that load kernel modules or containers that actually modify host procesdes or content.<br \/> <br \/> The goal of the lab would be to help users take existing packages and move them into a container environment and discuss how we can get them to work as a SPC.<br \/> \"","seats":"0","goers":"6","invite_only":"N","venue":"Workshops – E105","id":"d0603aeaef4c017655f0282fb102359d","venue_id":"254456","speakers":"Dan Walsh"},{"event_key":"155","active":"Y","name":"DNF API hackfest","event_start":"2015-02-08 10:40:00","event_end":"2015-02-08 12:10:00","event_type":"Development, Workshop","description":"\"Advisory center for developers relying on DNF. This session is especially for the ones whose application is currently using yum\/yum-utils and need to change the backend to DNF. DNF team can provide the technical help for individuals. All active attendants should be familiar with DNF Documentation [1] in advance.<br \/> <br \/> [1] http:\/\/dnf.readthedocs.org\/en\/latest\/\"","seats":"0","goers":"2","invite_only":"N","venue":"Workshops – E105","id":"097fd56280ac1d4feaf4724408f4e9bc","venue_id":"254456","speakers":"Jan Šilhan"},{"event_key":"156","active":"Y","name":"Torch - Android ORM library in action","event_start":"2015-02-07 14:10:00","event_end":"2015-02-07 15:40:00","event_type":"Development, Workshop","description":"Data persistence on Android can be tricky. Writing your own layer around Android's SQLite helper is just too much code that can be easily replaced by an ORM library. Torch differentiates from other ORM libraries by its focus on user-friendliness and performance. Learn more about and try yourself what it can bring to your development in this workshop.","seats":"0","goers":"2","invite_only":"N","venue":"Workshops – A112","id":"811df59a33862f0fd2f83ac51faf2ed4","venue_id":"254457","speakers":"Tadeáš Kříž"},{"event_key":"157","active":"Y","name":"Get your hands dirty with jBPM","event_start":"2015-02-06 15:50:00","event_end":"2015-02-06 17:20:00","event_type":"Middleware, Workshop","description":"This is continuation of the presentation of jBPM (jBPM - BPM swiss knife) that introduces to jBPM while this is mainly focused on making use of that knowledge in real cases. On this workshop users will be able to see in action jBPM from both perspectives:<br \/> \r\n<ul>\r\n<li>as a services when jBPM is used as BPM platform<\/li>\r\n<li>as embedded when jBPM is used as a framework in custom applications<\/li>\r\n<\/ul>\r\nThis workshop is intended to give a quick start with jBPM and help users to decide which approach is most suitable for their needs.","seats":"0","goers":"2","invite_only":"N","venue":"Workshops – A112","id":"e1090fa7109b2acddfb99cd03ddfda9f","venue_id":"254457","speakers":"Jiří Sviták, Radovan Synek, Maciej Swiderski"},{"event_key":"158","active":"Y","name":"Fighting bigger dogs than poodle (Why should I care about SuiteB?)","event_start":"2015-02-07 16:40:00","event_end":"2015-02-07 18:10:00","event_type":"Software Quality, Workshop","description":"Goal: make people aware of new security mechanisms and point out how to test them in their applications  <br \/><br \/>As recent Poodle attack targetting SSLv3 showed, many servers still rely on 18-year old protocol when there are better and modern alternatives for quie a long time. We would like to encourage developers to use newer protocols and cipher suites by demonstrating testing techniques, tools and best practices they can use when implementing modern security functions in their software, and introduce them to the SuiteB standard.","seats":"0","goers":"1","invite_only":"N","venue":"Workshops – A113","id":"e1435905d9e490e76bd1d3ca7bec0fd2","venue_id":"254458","speakers":"Stanislav Zidek"},{"event_key":"159","active":"Y","name":"Bootstrapping Fedora from zero","event_start":"2015-02-07 17:30:00","event_end":"2015-02-07 19:00:00","event_type":"Development, Fedora, Hardware, Workshop","description":"General discussion about the  best way of building Fedora from scratch to&nbsp; make it available for  future architectures without unnecessary amount&nbsp; of effort. And there  are also other reasons for easier full or partial bootstrap - self  hosting, creating a downstream distribution, introducing new glibc with  incompatible ABI, Perl version bumps and many more.","seats":"0","goers":"7","invite_only":"N","venue":"Workshops – A112","id":"bc305973fe23d9e723a777c9c4f24b57","venue_id":"254457","speakers":"Jaromir Capik, Dan Horak"},{"event_key":"16","active":"Y","name":"Future of Red Hat – Keynote (Broadcast)","event_start":"2015-02-06 09:00:00","event_end":"2015-02-06 09:40:00","event_type":"Keynote","description":"The Future of Red Hat","seats":"0","goers":"0","invite_only":"N","venue":"D0206","id":"c82a0bab66217f01e2180721b311a98f","venue_id":"253276","speakers":"Tim Burke, Mark Little"},{"event_key":"17","active":"Y","name":"Future of Red Hat – Keynote (Broadcast)","event_start":"2015-02-06 09:00:00","event_end":"2015-02-06 09:40:00","event_type":"Keynote","description":"The Future of Red Hat","seats":"0","goers":"0","invite_only":"N","venue":"D0207","id":"46b8d863147c1073575a7e31fa15c0b7","venue_id":"253277","speakers":"Tim Burke, Mark Little"},{"event_key":"18","active":"Y","name":"What is kubernetes?","event_start":"2015-02-06 09:50:00","event_end":"2015-02-06 10:30:00","event_type":"Containers","description":"Kubernetes is a new docker container orchestration project being led by Google and Red Hat. For many years Google has run their datacenter, clustering, and orchestration capabilitie with the equivalent of what we all now call containers. As the docker container ecosystem grew Google realized that they could bring their knowledge managing containers at the largest scales, Red Hat could bring their knowledge of datacenter operations across many organizations, and working together in the open source community we could create a better container management solution than anyone alone.<br \/> <br \/> This talk will cover what Kubernetes is, what it hopes to one day accomplish, and what choices it forces on application authors. It will cover the patterns which Kubernetes simplifies and cover some concepts that are just not possible when using Kubernetes.<br \/> <br \/> https:\/\/github.com\/GoogleCloudPlatform\/kubernetes","seats":"0","goers":"25","invite_only":"N","venue":"D105","id":"c507f4ff02e5f9fc34f7c09d37119cf8","venue_id":"253275","speakers":"Eric Paris"},{"event_key":"19","active":"Y","name":"Delivering OpenSource Projects using Agile & DevOps thinking","event_start":"2015-02-06 09:50:00","event_end":"2015-02-06 10:30:00","event_type":"Development","description":"Interested in learning how Red Hat is using Agile and DevOps thinking to help deliver popular open source projects such as Docker, Kubernetes and Project Atomic? Red Hat Agile Coach, Jen Krieger, will walk you through the good, bad and the ugly of working with a highly motivated team.<br \/> <br \/> Topics such as:<br \/> - So many agile management tools, so little time. A peek into the tool chain that keeps these teams organized and delivering.<br \/> - Tips and tricks to keep your teams motivated, focused and working towards a common goal<br \/> - Tips on writing epics and stories and why they aren't \"\"requirements\"\"","seats":"0","goers":"13","invite_only":"N","venue":"D0206","id":"389488fb8521ea0771338313276f91ff","venue_id":"253276","speakers":"Jen Krieger"},{"event_key":"2","active":"Y","name":"Fleet Commander","event_start":"2015-02-07 09:50:00","event_end":"2015-02-07 10:30:00","event_type":"Desktop","description":"Fleet Commander is a new project that attempts to provide the capacity for system administrators to manage the configuration of large deployments by applying configuration profiles to certain groups of users\/machines.<br \/><br \/>It's current focus is to enable the capability for the core desktop apps (GNOME, Firefox, LibreOffice) and to explore the use cases that are important as well as figuring out how to present this functionality in a UI that makes sense for the administrator.","seats":"0","goers":"10","invite_only":"N","venue":"D0206","id":"7b238cceedbd483219a2eaeb58595470","venue_id":"253276","speakers":"Alberto Ruiz"},{"event_key":"20","active":"Y","name":"Foreman & Katello: automating the infrastructure thing","event_start":"2015-02-06 09:50:00","event_end":"2015-02-06 10:30:00","event_type":"System management","description":"Ok, so you've got your favorite virtualization platform up and running in your infrastructure. Perhaps you've even connected it up to the cloud. And wait… what's in this room with a sign on the door saying \"\"Beware of The Leopard\"\"? Bare-metal machines? Aaah, so the VMs are not that virtual after all. Luckily, we have the Docker now that will solve all our problems… or will it? [Mention the Docker in your talk: ✓]<br \/> <br \/> Let's leave unicorns at home for a while and look at various needs you have (or will probably have sooner or later) in your infrastructure and how you can employ Foreman (http:\/\/www.theforeman.org) and Katello (http:\/\/www.katello.org) to help you with them.<br \/> <br \/> I'm looking forward to you joining this debugging session called “live demo”.","seats":"0","goers":"13","invite_only":"N","venue":"E112","id":"eb3253fd40a126d7c26d8dfd61fd5370","venue_id":"253278","speakers":"Ivan Nečas"},{"event_key":"21","active":"Y","name":"Architecting Large Enterprise Java Projects","event_start":"2015-02-06 09:50:00","event_end":"2015-02-06 10:30:00","event_type":"Middleware","description":"In the past I've been building component oriented applications with what I had at hand. Mostly driven by the features available in the Java EE standard to be \"portable\" and easy to use. Looking back this has been a perfect fit for many customers and applications. With an increasing demand for highly integrated applications which use already available services and processes from all over the place (departmental, central or even cloud services) this approach starts to feel more and more outdated. And this feel does not come from a technology perspective but from all the requirements around it. Having this in mind this post is the starting point of a series of how-to's and short tutorials which aim to showcase some more diverse ways of building (Java EE) applications that fit better into today's requirements and landscapes.","seats":"0","goers":"7","invite_only":"N","venue":"D0207","id":"26fea54867c7fa7d5b23f1dce7ea5cf9","venue_id":"253277","speakers":"Markus Eisele"},{"event_key":"22","active":"Y","name":"Hardware switches - the opensource approach","event_start":"2015-02-06 09:50:00","event_end":"2015-02-06 10:30:00","event_type":"Networking & SDN","description":"Imagine buying off the shelf switch hardware, install Fedora (or any other distribution) and configure it using standard linux tools. This is not possible at the moment primarily because of lack of unified and consistent platforms and driver interfaces. We are working to change that.  <br \/><br \/>The current state of support for switch chips in Linux is not good. Each vendor provides userspace binary sdk blob that only works with their chips. Each of this blobs has proprietary APIs. To get switch chips properly supported there's need to introduce a new infrastructure directly into Linux kernel and to work with vendors to adopt it.<br \/><br \/>This talk presents the current effort to unify and uphold the Linux networking model across the spectrum of devices which is necessary to make Linux the cornerstone of industrial grade networking. The scope of this talk covers state of art with current implementation of standard commodity switches such as top of rack switches, small home gateway device as well as SR-IOV NIC embedded switches.  <br \/><br \/>A device model and driver infrastructure will be presented for accelerating the Linux bridge, Linux router, accelerated host virtual switches and flow level offloads when supported by the hardware underneath.","seats":"0","goers":"6","invite_only":"N","venue":"E104","id":"add142379f151b0b82a42bf4c5306a7b","venue_id":"253279","speakers":"Jiří Pírko"},{"event_key":"23","active":"Y","name":"Docker Security","event_start":"2015-02-06 10:40:00","event_end":"2015-02-06 11:20:00","event_type":"Containers","description":"This talk will cover and demonstrate all of the features that have been added to docker to actually attempt to \"Contain the containers\".<br \/> <br \/> Will dive into Mounting File Systems, SELinux, Capabilities, SECcomp, Namespaces and other features.","seats":"0","goers":"22","invite_only":"N","venue":"D105","id":"ba19713eb309130a0c32e03a73ed3d3c","venue_id":"253275","speakers":"Dan Walsh"},{"event_key":"24","active":"Y","name":"Federated Identity Providers: the Ipsilon project","event_start":"2015-02-06 10:40:00","event_end":"2015-02-06 11:20:00","event_type":"Development","description":"The presentation will introduce the concept of Identity Federation, when it is<br \/> used, when it is appropriate and what protocols are used for Federation.<br \/> <br \/> Protocols like SAML, OpenId 1.0, OpenId Connect, Persona, etc.. will be briefly<br \/> introduced and explained at a high level.<br \/> <br \/> In the context of Identity Providers I will introduce the Ipsilon project, how<br \/> it works, where it comes from and the merger with FedOAuth, the current tool<br \/> used for Federation in the Fedora Infrastructure.<br \/> <br \/> The presentation will end up with the first use case for Ipsilon as a tool in<br \/> Fedora Infrastructure, how it is deployed there and what feature are used","seats":"0","goers":"10","invite_only":"N","venue":"D0206","id":"3139738e624a3ebf53dd7380d12faf3f","venue_id":"253276","speakers":"Simo Sorce"},{"event_key":"25","active":"Y","name":"OpenStack Baremetal (Ironic) Status Update","event_start":"2015-02-06 10:40:00","event_end":"2015-02-06 11:20:00","event_type":"OpenStack","description":"OpenStack Baremetal service (codenamed Ironic) has graduated this year and will be part of integrated Kilo release. A lot of work was done in J cycle, even more planning in K. This talk will cover current state of Ironic, recently-introduced and planned features and also challenges appearing while Ironic start to cover more use cases, like metal-to-tenant (providing baremetal cloud to customers). This talk will also touch hardware introspection feature that has yet to find it's path into mainline OpenStack and currently available from RDO.","seats":"0","goers":"14","invite_only":"N","venue":"E112","id":"6dd7dcd8ed436d8d07d49a0a4634e39a","venue_id":"253278","speakers":"Dmitry Tantsur"},{"event_key":"26","active":"Y","name":"Productive Java EE and HTML5 development with Eclipse","event_start":"2015-02-06 10:40:00","event_end":"2015-02-06 11:20:00","event_type":"Development, Middleware","description":"During this session, we'll show how developers can be productive when&nbsp;building Java EE 7 + HTML5 applications in Eclipse. We will see how the&nbsp;tooling in Eclipse helps us scaffolding from an existing database using&nbsp;JPA, then exposing the entities via JAX-RS and integrated Forge tooling.<br \/>Some advanced features of JAX-RS 2.0 such as filters and support for&nbsp;bean validation that are recently added will also be shown.<br \/>Finally the&nbsp;content will be shown in the browser using HTML5 + AngularJS.<br \/>If time&nbsp;(and network) allows, the application will even be deployed on a PaaS,&nbsp;all without leaving the IDE. During this talk, you should expect&nbsp;(almost) no slides, mostly coding and talking.\"","seats":"0","goers":"6","invite_only":"N","venue":"D0207","id":"5df5fe44c4ef731141c949676ea1332b","venue_id":"253277","speakers":"Xavier Coulon, Marian Labuda"},{"event_key":"27","active":"Y","name":"NetworkManager 1.0 In-Depth: Enterprise, Cloud, Desktop, and Toaster","event_start":"2015-02-06 10:40:00","event_end":"2015-02-06 11:20:00","event_type":"Networking & SDN","description":"10 years in the making, NetworkManager 1.0 has finally arrived! To celebrate, we streamlined client applications and scripting, made routing more flexible and configurable, added fast, lightweight DHCP and configure-and-quit functionality, updated documentation and manpages, and much more. We'll dive in and show you what makes NetworkManager 1.0 the most flexible, cooperative, and configurable version yet! <br \/> <br \/> https:\/\/wiki.gnome.org\/Projects\/NetworkManager","seats":"0","goers":"10","invite_only":"N","venue":"E104","id":"51fa6cdc053b4824cb9cdeca9b855949","venue_id":"253279","speakers":"Dan Williams"},{"event_key":"28","active":"Y","name":"Fedora Atomic","event_start":"2015-02-06 11:30:00","event_end":"2015-02-06 12:10:00","event_type":"Containers","description":"This talk will look at all of the changes that are happening as part of the Fedora Atomic Host (an implementation of Project Atomic): https:\/\/fedoraproject.org\/wiki\/Changes\/AtomicHost<br \/> <br \/> We'll look at Docker (notably storage), rpm-ostree, clustering via Kubernetes and networking via Flannel, and include some demos.<br \/> <br \/> Extra time will be reserved for questions to keep the talk interactive.","seats":"0","goers":"17","invite_only":"N","venue":"D105","id":"b1d18f3bc434f43a5b549223374ffa54","venue_id":"253275","speakers":"Colin Walters"},{"event_key":"29","active":"Y","name":"Using OS-level identity, authentication, and access control for Web applications","event_start":"2015-02-06 11:30:00","event_end":"2015-02-06 12:10:00","event_type":"Development","description":"Authentication and access control are well-supported on the operating system level by projects like FreeIPA and sssd, including integration with Active Directory. Users can then authenticate once, and access machines within their organization without being prompted for password again.<br \/> <br \/> But how about web applications?<br \/> <br \/> In this talk we will look at Apache modules that allow the single-sign on with central access control and identity services to be used for web application as well, building on top of the same bits that are already proven to work well on the OS-level, rather than reimplementing all the parts again. Multiple web projects and products have already been enhanced to take advantage of this setup so demo is more than likely.<br \/> <br \/> http:\/\/www.freeipa.org\/page\/Web_App_Authentication","seats":"0","goers":"13","invite_only":"N","venue":"D0206","id":"e3aa2fb86b4d00ab98c308fb43c6b37f","venue_id":"253276","speakers":"Jan Pazdziora"},{"event_key":"3","active":"Y","name":"GTK+ for Developers","event_start":"2015-02-07 10:40:00","event_end":"2015-02-07 11:20:00","event_type":"Desktop","description":"Over the past year, GTK+ has grown a new debugging tool, GtkInspector. My talk will present this tool in depth, with some live demos. I also intend to cover new widgets in GTK+ and glade, as well as some more advanced topics, like using templates and resources to structure your code and custom css to tweak the appearance of your application.<br \/><br \/>https:\/\/wiki.gnome.org\/Projects\/GTK+\/Inspector","seats":"0","goers":"7","invite_only":"N","venue":"D0206","id":"e4bddfb730de563793dbe20d34e67f4e","venue_id":"253276","speakers":"Matthias Clasen"},{"event_key":"30","active":"Y","name":"Openstack High Availibility","event_start":"2015-02-06 11:30:00","event_end":"2015-02-06 12:10:00","event_type":"OpenStack","description":"Best practices for deploying OSP for HA, the current architecture and what has changed from previous incarnations","seats":"0","goers":"14","invite_only":"N","venue":"E112","id":"bc0b9fa60b93f036ef6740e5731473e2","venue_id":"253278","speakers":"Andrew Beekhof"},{"event_key":"31","active":"Y","name":"Transactions Returning to NoSQL","event_start":"2015-02-06 11:30:00","event_end":"2015-02-06 12:10:00","event_type":"Databases, Middleware","description":"Over the last few years, we have seen the rise of NoSQL and big data. The CAP theorem is often cited as a reason for many of the architectural decisions used in the development of NoSQL, and one consequence is that most implementations do not support transactions. This lack of transactions offers benefits for some applications, but it has certain downsides, particularly in terms of fault tolerance and integrating with existing Java EE applications. As a result, the last year or so has seen many NoSQL implementations adopt transactions in one way or another. This session examines this trend back to adopting transactions, why it is happening, and what it means for the future.","seats":"0","goers":"11","invite_only":"N","venue":"D0207","id":"6d4b7eab64ee00772f9a414ea537ddb0","venue_id":"253277","speakers":"Mark Little"},{"event_key":"32","active":"Y","name":"Data Plane Acceleration - Receiving Packets at the Speed of Light","event_start":"2015-02-06 11:30:00","event_end":"2015-02-06 12:10:00","event_type":"Networking & SDN","description":"As network speeds continue to increase from 10Gb\/s, to 40Gb\/s, and very soon to 100Gb\/s the rate at which packets can arrive increases, and as a result the amount of time to process packets decreases to as little as 6.7ns per packet at 100Gb\/s. When something as simple as a memory barrier can cause stalls of 7ns or more strategies must be devised to mitigate such issues so that we can process as many packets per core as possible. This talk will go over some of the mitigation strategies being employed to reduce these costs and bring the kernel networking stack down to receive processing times sufficient to allow for wire rate networking at minimal packet sizes.","seats":"0","goers":"5","invite_only":"N","venue":"E104","id":"384f263b094c3d2f2dc050bea6b09112","venue_id":"253279","speakers":"Alexander Duyck"},{"event_key":"33","active":"Y","name":"Performance Tuning of Docker and RHEL Atomic","event_start":"2015-02-06 12:30:00","event_end":"2015-02-06 13:10:00","event_type":"Containers","description":"Red Hat Enterprise Linux Atomic is a purpose-built operating system for hosting Docker-based Linux Containers.<br \/> <br \/> Red Hat's Performance Engineering Group is responsible for scale and performance of the RHEL Atomic \/ Docker \/ Kubernetes stack, and will share lessons learned with the audience through the use of sophisticated, hands-on demos. Code\/scripts will be available via git.<br \/> <br \/> - Overview of Docker and RHEL Atomic and approach to Performance Analysis<br \/> <br \/> - Latest Performance Features in Docker and RHEL Atomic, tips and tricks on how to best configure and tune your system for maximum performance.<br \/> <br \/> - Latest performance and scale test results<br \/> <br \/> - How we've implemented a DevOps approach to Performance Analysis","seats":"0","goers":"13","invite_only":"N","venue":"D105","id":"0d0d6fe8420d39e9bf0068deecef9821","venue_id":"253275","speakers":"Jeremy Eder"},{"event_key":"34","active":"Y","name":"JSONB - storing and querying JSON data in PostgreSQL","event_start":"2015-02-06 12:30:00","event_end":"2015-02-06 13:10:00","event_type":"Databases","description":"One of the most frequently mentioned improvements in PostgreSQL is JSONB - a data type supporting efficient storing and querying JSON data within a relational database. Why would you want to do that, and what unexpected powers does that give you? I'll show you what JSONB is all about, how to use it and how it competes with some document-oriented databases.","seats":"0","goers":"9","invite_only":"N","venue":"D0206","id":"b53c4d975175576408dde0aeb2e00a11","venue_id":"253276","speakers":"Tomáš Vondra"},{"event_key":"35","active":"Y","name":"Data Processing in the OpenStack world","event_start":"2015-02-06 12:30:00","event_end":"2015-02-06 13:10:00","event_type":"OpenStack","description":"While the core OpenStack components provide good tools to manage the infrastructure, handling more complex scenarios, like for example the set of machines required by Data Processing toolkits (Hadoop) requires a bit of manual intervention.<br \/> Sahara, a recently-integrated component of the OpenStack project, can manage such kind of resources by leveraging the existing OpenStack components (Nova for instances, Glance for images, Swift for data storaga, Heat for orchestration, etc). Initially targeted to support Hadoop distributions, thank to its modular plugin-based architecture Sahara gained support for other processing model, like Spark and Storm.<br \/> <br \/> The goal of the presentation is to introduce the concepts behind Sahara, its integration with the rest of OpenStack ecosystem and a brief demo of its functionalities.<br \/> <br \/> Main website: http:\/\/docs.openstack.org\/developer\/sahara\/","seats":"0","goers":"8","invite_only":"N","venue":"E112","id":"2397d6ccb1f61cff5c85d1c7d1c94268","venue_id":"253278","speakers":"Luigi Toscano"},{"event_key":"36","active":"Y","name":"Replicated LevelDB store in JBoss Fuse","event_start":"2015-02-06 12:30:00","event_end":"2015-02-06 13:10:00","event_type":"Middleware","description":"Brief introduction to replicated LevelDB. It's advantages over other master slave messaging configuration and short demonstration of configuration JBoss Fuse with replicated LevelDB store.","seats":"0","goers":"5","invite_only":"N","venue":"D0207","id":"60c43dc66dd35c4a3836139bd3519a21","venue_id":"253277","speakers":"Jakub Knetl"},{"event_key":"37","active":"Y","name":"Cleaning up the mess of cloud networking","event_start":"2015-02-06 12:30:00","event_end":"2015-02-06 13:10:00","event_type":"Networking & SDN","description":"The network configuration requirements of computers powering cloud infrastructure are very different to the traditional way of how the network is set up. The existing Linux kernel features are often not enough for this task and projects like OpenStack use the existing features to their very limits, sometimes even over them. New projects have been started to deal with this; a most prominent example is Open vSwitch. However, despite the quick pace of development, there is still lack of needed features on the kernel part. This leads to creative usage of combinations of the currently offered kernel features, leading to very complex undebuggable configurations. If you log in to such machine, you find tens of virtual interfaces and name spaces with strange non-obvious relationships between them.<br \/> <br \/> The talk will present a few possible ways to get out of this. A new tool, plotnetcfg, that allows easier overview of the network relationship will be shown. The workarounds that are deployed by cloud platforms (as seen in the wild) will be explained and corresponding missing features in the kernel will be identified. How to implement them is in many cases an open problem; some possible solutions will be discussed. Interestingly, Open vSwitch may not be an answer for everything.","seats":"0","goers":"17","invite_only":"N","venue":"E104","id":"ba05e68c11bc4f03150d8e27f1d61b81","venue_id":"253279","speakers":"Jiri Benc"},{"event_key":"38","active":"Y","name":"Provision and manage Docker containers with Foreman","event_start":"2015-02-06 13:20:00","event_end":"2015-02-06 14:00:00","event_type":"Containers","description":"\" Deploying containers, images with Docker is becoming a big trend. However, large installations of containerized applications are still few and far between, and solutions are either proprietary or they force you to use their own cloud.<br \/> <br \/> We believe Foreman can fill this space by providing a central space to provision and manage your containers and your network, as we already do with your data center. This provides a great framework for mixed environments where physical machines, vms, and containers are all used in conjunction.<br \/> <br \/> Monitoring, deploying, and everything else is possible to do through the web UI or an API, and it's open source, so if you miss any feature, feel free to add it!<br \/> \"","seats":"0","goers":"23","invite_only":"N","venue":"D105","id":"1db3ddd182129d3f0294a71141a69128","venue_id":"253275","speakers":"Daniel Lobato Garcia"},{"event_key":"39","active":"Y","name":"SQL is not dead alias news in relational databases","event_start":"2015-02-06 13:20:00","event_end":"2015-02-06 14:00:00","event_type":"Databases","description":"Even between all the NoSQL databases and hype technologies, SQL has its strong place and even evolves quite rapidly. Let's look what news the last versions of PostgreSQL and MySQL\/MariaDB brought to us. You can expect quick overview of hottest features and some practical examples.","seats":"0","goers":"12","invite_only":"N","venue":"D0206","id":"7ce14b8d345834b64adfad0766ecdf77","venue_id":"253276","speakers":"Honza Horak"},{"event_key":"4","active":"Y","name":"Gnome SDK - a better way to ship apps","event_start":"2015-02-07 11:30:00","event_end":"2015-02-07 12:10:00","event_type":"Desktop","description":"Wouldn't it be nice if you could install your app on any distro? In a secure, sandboxed way that allows you to keep running older apps mixed with apps that require newer libraries, and on newer distribution versions.<br \/><br \/>This is the goal of the Gnome SDK. It constists of a platform work to make sandboxed applications possible, a stable runtime that apps are deployed against, and a SDK that makes it easy to develop apps against that runtime.<br \/><br \/>Come and learn about the future of application deployment in gnome.","seats":"0","goers":"9","invite_only":"N","venue":"D0206","id":"b9d57e4a2fee8c8deedaa66aea83322c","venue_id":"253276","speakers":"Alexander Larsson"},{"event_key":"40","active":"Y","name":"Unikernels","event_start":"2015-02-06 13:20:00","event_end":"2015-02-06 14:00:00","event_type":"Kernel","description":"Unikernels are software appliances transformed into standalone kernels with all core (\"\"kernel\"\") services like scheduler, network stack, file systems etc. provided as libraries and linked directly into the application. The resulting binary is then run directly in a VM or bare-metal.<br \/> <br \/> In this talk we'll inspect the three pioneers in the field, note their differences and explore what lies just on the brink of tomorrow:<br \/> <br \/> http:\/\/www.openmirage.org\/<br \/> http:\/\/osv.io\/<br \/> http:\/\/rumpkernel.org\/","seats":"0","goers":"10","invite_only":"N","venue":"E112","id":"fabdb2f7cbbb21d5c249c2357438af87","venue_id":"253278","speakers":"Pavel Odvody"},{"event_key":"41","active":"Y","name":"jBPM - BPM swiss knife","event_start":"2015-02-06 13:20:00","event_end":"2015-02-06 14:00:00","event_type":"Middleware","description":"During the presentation jBPM will be introduced from the Process Engine &amp; framework perspective.The main goal of the session is to share with the community of developers how they can improve their systems implementations and integrations by using a high level, business oriented methodology that will help to improve the performance of the company. jBPM will help to keep the infrastructural code organized and decoupled from the business knowledge. During the presentation the new APIs and new modules in jBPM version 6 will be introduced for the audience to have a clear spectrum of the tools provided.","seats":"0","goers":"5","invite_only":"N","venue":"D0207","id":"6256751e57278eb678930e344b97e349","venue_id":"253277","speakers":"Maciej Swiderski"},{"event_key":"42","active":"Y","name":"Data Center TCP","event_start":"2015-02-06 13:20:00","event_end":"2015-02-06 14:00:00","event_type":"Networking & SDN","description":"This talk presents the recently added TCP congestion control algorithm to the Linux kernel, namely Data Center TCP (DCTCP), and gives a general overview of problems it solves inside data centers as well as its inner workings.","seats":"0","goers":"8","invite_only":"N","venue":"E104","id":"85fb1e83cdd66789dec42398e4108c89","venue_id":"253279","speakers":"Florian Westphal"},{"event_key":"43","active":"Y","name":"A proposal for a container-based, highly-portable development environment","event_start":"2015-02-06 14:10:00","event_end":"2015-02-06 14:50:00","event_type":"Containers","description":"\"Most developers struggle with \"\"maintaining\"\" their development environment. For me that includes:<br \/> * ensuring my \"\"communications\"\" are not interrupted by the addition of new software<br \/> * backup of critical information<br \/> * support for easy portability from one computer to another (or through an OS upgrade)<br \/> * transparent movement from offline to online access<br \/> * rollback support for changes to the environment<br \/> * forking of the environment for new\/different languages and projects I am definitely one of those people and have found various techniques over the years to attempt to solve these problems but none of them quite do it. Unfortunately, I think the needs of developers are somewhat unique and most tools and techniques are targeted at \"\"general users\"\" or \"\"servers\"\" whereas developers are somewhere between the two.<br \/> <br \/> As a result, I have been working with a few others on a proposal and some early software to try to meet these needs. We have been wrapping the proposal around containers because of their \"\"out of the box\"\" universality, portability, snapshotting, and forking.<br \/> <br \/> I would like to present where we are, what we plan, and invite feedback. \"","seats":"0","goers":"14","invite_only":"N","venue":"D105","id":"15fa1beff9ecd6d2cadaf46a66ef653c","venue_id":"253275","speakers":"Langdon White"},{"event_key":"44","active":"Y","name":"shellshock!","event_start":"2015-02-06 14:10:00","event_end":"2015-02-06 14:50:00","event_type":"Security","description":"\"In September 2014, internet was rocked by a widespread security flaw called shellshock. It seemed to affect everything from web servers serving CGI, to dhcpclient etc, and even some satellite television settop boxes.<br \/> <br \/> The presenter was responsible for ensuring Red Hat \/ Fedora and its customers\/users were protected against this. Red Hat not only pioneered the patch which was used, but also provided guidance to other distros\/upstream.<br \/> <br \/> This presentation is a brief look at how these kind of security issues affect open source, provide a brief time line of what happened and why and how developers can often help ease out the pain :)<br \/> <br \/> https:\/\/securityblog.redhat.com\/2014\/09\/24\/bash-specially-crafted-environment-variables-code-injection-attack\/<br \/> https:\/\/securityblog.redhat.com\/2014\/09\/26\/frequently-asked-questions-about-the-shellshock-bash-flaws\/\"","seats":"0","goers":"13","invite_only":"N","venue":"D0206","id":"e29628546214f500de51ce671034df99","venue_id":"253276","speakers":"Huzaifa Sidhpurwala"},{"event_key":"45","active":"Y","name":"GlusterFS - Architecture & Roadmap","event_start":"2015-02-06 14:10:00","event_end":"2015-02-06 14:50:00","event_type":"Storage","description":"GlusterFS is a distributed scale-out filesystem that runs on commodity hardware. In this session, Vijay Bellur will provide an architectural overview of GlusterFS and discuss how its file, object & block interfaces can be used to build a scale-out storage solution for modern datacenter needs. Details on new features , use cases and interesting challenges with GlusterFS will be provided. As part of this session, Vijay will also discuss integration of GlusterFS with other open source ecosystems like OpenStack, oVirt, Apache Hadoop and provide future directions of the GlusterFS project.","seats":"0","goers":"14","invite_only":"N","venue":"E112","id":"381aeda5b8fcea962c73d04f41613a1c","venue_id":"253278"},{"event_key":"46","active":"Y","name":"JBoss Windup – Don't be afraid of migrations","event_start":"2015-02-06 14:10:00","event_end":"2015-02-06 14:50:00","event_type":"Middleware","description":"\"Windup is a tool to simplify Java application migrations. The tool analyzes application artifacts (such as Java code, JSPs and XML) and produces an HTML report highlighting areas that require changes.<br \/> <br \/> Windup is, simply said, an executor of the rules that are registered. The project is packed with the main bundle of rules, however you can easily register your own, newly created rules. In the presentation we will discover how the windup works underneath and how you can easily provide your own rules.\"","seats":"0","goers":"4","invite_only":"N","venue":"D0207","id":"29c702df2cb15304ae51f26889f519ea","venue_id":"253277","speakers":"Matej Briškár"},{"event_key":"47","active":"Y","name":"Virtualization: KVM: Has ARM done it better?","event_start":"2015-02-06 14:10:00","event_end":"2015-02-06 14:50:00","event_type":"Virtualization","description":"This talk is a twofer (a two for one deal). We'll describe how KVM works, but not just one way, two! While stepping through the process of booting a simple guest, we'll look at what's going on in both the implementation of KVM for AArch64 (ARM's 64-bit architecture) and in the implementation for x86_64\/VMX (Intel's 64-bit architecture). As the two KVM implementations are the products of their respective architecture's virtualization extension designs, we'll gain some insights into what design decisions appear to be \"\"better\"\", at least from a developer's point of view.","seats":"0","goers":"14","invite_only":"N","venue":"E104","id":"1456f7e902a60a02ea20856fc8b55764","venue_id":"253279","speakers":"Drew Jones"},{"event_key":"48","active":"Y","name":"DevAssistant, Docker and You","event_start":"2015-02-06 15:00:00","event_end":"2015-02-06 15:40:00","event_type":"Containers","description":"Come and learn about DevAssistant (http:\/\/devassistant.org\/), how it utilizes Docker and how you can create, build and run a full development environments in two lines of shell.","seats":"0","goers":"16","invite_only":"N","venue":"D105","id":"df4edfd079eeb88b0de00c407625a3a0","venue_id":"253275","speakers":"Slavek Kabrda"},{"event_key":"49","active":"Y","name":"How to write SELinux policy for your project painlessly","event_start":"2015-02-06 15:00:00","event_end":"2015-02-06 15:40:00","event_type":"Security","description":"\"Lessons learned from writing SELinux policy for Foreman and Katello projects. Who should write it at first? Where to start? How to form rules? Where to get help? Should I test in permissive or enforcing? And what about deployment? After this talk, you won't make the same mistakes as I did. Beginner for beginners series.<br \/> <br \/> http:\/\/theforeman.org<br \/> <br \/> Can do lightning talk when necessary.\"","seats":"0","goers":"15","invite_only":"N","venue":"D0206","id":"fd625c540ce6806c933769cf8767898f","venue_id":"253276","speakers":"Lukáš Zapletal"},{"event_key":"5","active":"Y","name":"Replacing Xorg input-drivers with libinput","event_start":"2015-02-07 12:30:00","event_end":"2015-02-07 13:10:00","event_type":"Desktop","description":"For Wayland compositors new unified userspace input handling code has been developed in the form of libinput. libinput fixes a number of shortcomings of the traditional Xorg input drivers, esp. where it comes to touchpad support.<br \/><br \/>This presentation will discuss the plans to move Xorg to use libinput too through an input driver called xf86-input-libinput, as well as the status of this move. xf86-input-libinput is scheduled to be the default Xorg input driver for Fedora 22.","seats":"0","goers":"4","invite_only":"N","venue":"D0206","id":"38117438154bfdaecfb694aef4e03519","venue_id":"253276","speakers":"Hans de Goede"},{"event_key":"50","active":"Y","name":"Performance of various file systems","event_start":"2015-02-06 15:00:00","event_end":"2015-02-06 15:40:00","event_type":"Kernel","description":"Do you know which file system is faster? How they work, why sometimes use xfs. Are there cases when you need to ask which FS to use? Do you know how to measure the performance of your file system. I will give you the answers in my talk...","seats":"0","goers":"19","invite_only":"N","venue":"E112","id":"0bf718aac21321526d9ce97d8ebc6904","venue_id":"253278","speakers":"Matus Kocka"},{"event_key":"51","active":"Y","name":"Messaging in the belly of the Docker whale","event_start":"2015-02-06 15:00:00","event_end":"2015-02-06 15:40:00","event_type":"Containers, Middleware","description":"\"Do you enjoy a lightweight messaging with the Apache ActiveMQ? Do you find Apache Camel message routing amusing? Of course, we all do! Do you hate deployment of the messaging solution? Do you hate it with a passion? Of course, we all do...<br \/> <br \/> Is there something we can do to make messaging deployment more fun? Does it have to be so difficult, error prone and annoying?<br \/> <br \/> If you can't sleep at night because you are asking yourself those questions over and over again, this talk is for you. I will tell you what the big blue whale called Docker can do for you, so you can sleep tight again.\"","seats":"0","goers":"11","invite_only":"N","venue":"D0207","id":"504445ef2f2005beb26ca77dea571446","venue_id":"253277","speakers":"Henryk Konsek"},{"event_key":"52","active":"Y","name":"Improvements in Nested Virtualization","event_start":"2015-02-06 15:00:00","event_end":"2015-02-06 15:40:00","event_type":"Virtualization","description":"\"Nested Virtualization is an interesting feature to allow guest hypervisors to run their own guests utilizing hardware provided virtualization extensions. Much of the work for Intel processors is based on the Turtles research project at IBM. <br \/> <br \/> This talk is intended as an introduction to the feature and how it works in its current form. We will briefly discuss various performance improving features that have been introduced such as nested EPT, Shadow VMCS and APIC Virtualization for Intel Processors. We will also discuss some work-in-progress features that could enhance functionality and improve performance.<br \/> <br \/> This discussion is expected to help users gain a better understanding of the topic so as to ease troubleshooting, experiment with new and interesting use-cases and get a better understanding of currently available processor features to make Nested Virtualization better.\"","seats":"0","goers":"6","invite_only":"N","venue":"E104","id":"11fc3fe2ca96d126efc28ff560f96bb0","venue_id":"253279","speakers":"Bandan Das"},{"event_key":"53","active":"Y","name":"golang - the Good, the Bad and the Ugly","event_start":"2015-02-06 15:50:00","event_end":"2015-02-06 16:30:00","event_type":"Containers","description":"With projects like Openshift V3, Google Kubernetes and Docker written in the go programming language, lets go over some of what that entails. What is it like to work with day-after-day? Lessons learned, Benefits and drawbacks, challenges and rewards, fundamentals to advanced, dev and ops.<br \/> <br \/> http:\/\/golang.org\/","seats":"0","goers":"11","invite_only":"N","venue":"D105","id":"b34040d75e77e85ba40c1dbc7eb2dcb7","venue_id":"253275","speakers":"Vincent Batts"},{"event_key":"54","active":"Y","name":"Compliance Center","event_start":"2015-02-06 15:50:00","event_end":"2015-02-06 16:30:00","event_type":"Security","description":"Announcing new project called SCAPtimony. SCAPtimony is SCAP database and compliance server consolidating compliance data from your infrastructure. SCAPtimony is build on top of OpenSCAP project and plays well with Foreman and Puppet.","seats":"0","goers":"3","invite_only":"N","venue":"D0206","id":"e2bfad8a63a10656fcf15fb040531405","venue_id":"253276","speakers":"Šimon Lukašík"},{"event_key":"55","active":"Y","name":"Ubiquitous System Analysis with Performance Co-Pilot","event_start":"2015-02-06 15:50:00","event_end":"2015-02-06 16:30:00","event_type":"Kernel","description":"Performance Co-Pilot is a highly adaptable and established toolkit for those<br \/> interested in examining the details of system performance. Designed from<br \/> the ground up to compliment existing system monitoring, PCP is gentle in<br \/> its approach as your statistics gathering mechanism. Likewise, PCP developers<br \/> understand; what's most important for the sysadmin\/end-user to monitor, may<br \/> not be known, or even available to the upstream community. Hence, the following<br \/> mantra is central to the PCP architecture: 'If it is important for monitoring system<br \/> performance, and you can measure it, you can easily integrate it into the PCP<br \/> framework'. This presentation will go over the basics of the toolkit, recent<br \/> developments, how the developments fit within PCP's overall architecture, as<br \/> well as some examples.<br \/> <br \/> Performance Co-Pilot: http:\/\/www.pcp.io\/<br \/>","seats":"0","goers":"5","invite_only":"N","venue":"E112","id":"3c6eb3a6754144b4343d900f93bd3388","venue_id":"253278","speakers":"Lukas Berk"},{"event_key":"56","active":"Y","name":"Escape from Version Hell","event_start":"2015-02-06 15:50:00","event_end":"2015-02-06 16:30:00","event_type":"Development","description":"\"So you created this fantastic development tool for CoolFrameWork version 1.3.5. But as could be expected the CoolFrameWork developers recently came up with 2.0 and they broke quite a lot of API&hellip; To make matters worse, some users of your tool are dying to see support for the latest and greatest version while others still swear by old and stable. <br \/> How can you avoid code duplication and other insanity to meet both goals? In this session I will show you how it was done in JBoss Tools for Hibernate and JPA. \"","seats":"0","goers":"8","invite_only":"N","venue":"D0207","id":"122102e26c6f4eb0c4d1da4ef570ca7e","venue_id":"253277","speakers":"Koen Aers"},{"event_key":"57","active":"Y","name":"Admin API in libvirt","event_start":"2015-02-06 15:50:00","event_end":"2015-02-06 16:30:00","event_type":"Virtualization","description":"Libvirt, a management API, abstraction library, daemon and management tool, has an API with functions for working with virtual machines and their host related to virtualization. However, new API might be on the rise that has nothing to do with the virtualization technology itself. This presentation will take you to a journey to magic intestines of libvirt, describe what needs to be changed for the Admin API to be able to work properly and how it might help those who work with libvirt or any management application up in the virtualization stack.","seats":"0","goers":"10","invite_only":"N","venue":"E104","id":"7dcb7172a7d2c18fe70033d456143a3e","venue_id":"253279","speakers":"Martin Kletzander"},{"event_key":"58","active":"Y","name":"oVirt Overview - Open-Source Product For Virtualization Management","event_start":"2015-02-06 16:40:00","event_end":"2015-02-06 17:20:00","event_type":"System management","description":"The oVirt Project is an open virtualization project providing a feature-rich server and desktop virtualization management platform with advanced capabilities for hosts and guests, including high availability, live migration, storage management, system scheduler, and more. oVirt provides an integration point for several open source virtualization technologies, including kvm, libvirt, spice and oVirt node.","seats":"0","goers":"11","invite_only":"N","venue":"D105","id":"2ffdccc544bf5cbd47f8e10add06c5d4","venue_id":"253275","speakers":"Yaniv Bronheim"},{"event_key":"59","active":"Y","name":"Smart Card Primer","event_start":"2015-02-06 16:40:00","event_end":"2015-02-06 17:20:00","event_type":"Development","description":"Smart Card support has been available in RHEL and Fedora for over a decade now, but it's still often a mystery to users and Developers. In this talk I'll lay out what are the various pieces that make up a smart card deployment, explain several of the various supporting standards, and look at where some of the smart card support is leading to in the future.","seats":"0","goers":"4","invite_only":"N","venue":"D0206","id":"00e45c1993597cd7f9eb70df43e7cdbf","venue_id":"253276","speakers":"Robert Relyea"},{"event_key":"6","active":"Y","name":"The (r)evolution of input devices","event_start":"2015-02-07 13:20:00","event_end":"2015-02-07 14:00:00","event_type":"Desktop","description":"Most notably during the last years, there has been a increase in the complexity of human-computer interaction. Nowadays the growingly common multitouch touchpads and touchscreens are pushing the expectations on the desktop and applications.<br \/><br \/>To this challenge, the GNOME desktop is not only biting the bullet, but also aiming to handle other specialized devices such as drawing tablets out of the box. This talk will cover the current state, as well as the remaining items, future plans, wayland details...","seats":"0","goers":"5","invite_only":"N","venue":"D0206","id":"4c17c49f6e96259b8e43265885d88563","venue_id":"253276","speakers":"Carlos Garnacho"},{"event_key":"60","active":"Y","name":"News from perf land: probe, trace and scripting","event_start":"2015-02-06 16:40:00","event_end":"2015-02-06 17:20:00","event_type":"Kernel","description":"The Linux 'perf' tools continuously grows in scope as an observability toolchest, with more and more features being added.<br \/> <br \/> In this talk the 'probe' and 'trace' tools will be showcased: the first allows adding dynamic probes in arbitrary points in the kernel and in userspace libraries and programs, collecting global and local variables, as well as callchains, that can then be used in conjunction with the other perf tools: record, top, trace, script, etc.<br \/> <br \/> The later, trace, started as a super strace, one that allows stracing not just threads, but other targets such as the whole system, sets of CPUs, etc, in addition to threads. It also has a much lower overhead as it doesn't use the ptrace syscall. Support for tracing page faults and other events, as well as provide callchains leading to a syscall and other traced events are being planned and may even be ready by devconf'15 time!<br \/> <br \/> An example of integration among perf tools, using 'probe' to allow capturing syscall arguments for pretty printing in 'trace', will be described, showcasing 'wannabe tracepoints', dynamic probes that may end up becoming real tracepoints.<br \/> <br \/>How to use perf support in scripting languages. Explaning how perf   interfaces scripting languages and showing practical examples of   existing scripts and how to write your own.<br \/><br \/>","seats":"0","goers":"3","invite_only":"N","venue":"E112","id":"d10a0f8c2e32391fb313e7c2d2b4b41d","venue_id":"253278","speakers":"Jiri Olsa, Arnaldo Carvalho de Melo"},{"event_key":"61","active":"Y","name":"Integrating Middleware in the Clouds with Fabric8","event_start":"2015-02-06 16:40:00","event_end":"2015-02-06 17:20:00","event_type":"Containers, Middleware","description":"\"Fabric8 version 2 is a new integration and management platform based on Kubernetes. We will show you how to utilize Fabric8 to build, deploy and manage Java micro-services as Docker containers in Kubernetes-managed clouds; or as pure Java processes using Jube.<br \/> <br \/> http:\/\/fabric8.io\/\"","seats":"0","goers":"10","invite_only":"N","venue":"D0207","id":"0f2290e9a87fb307bba3cba8753cbcfb","venue_id":"253277","speakers":"Marek Schmidt"},{"event_key":"62","active":"Y","name":"Live Migration of QEMU\/KVM Virtual Machines","event_start":"2015-02-06 16:40:00","event_end":"2015-02-06 17:20:00","event_type":"Virtualization","description":"\"Live migrating vitual machines is an interesting ongoing area for virtualization: guests keep getting bigger (more vcpus, more vram), and demands on the uptime for guests keep getting stricter (so no long pauses between a VM migrating from one host to another).<br \/> <br \/> This session will go through the simple design from the early days of QEMU\/KVM live migration, how it has been tweaked to where it is now, and where we're going in the future. It will discuss how live migration actually works, the constraints within which it all has to work, and how the design keeps needing new thought to cover the latest requirements.<br \/> <br \/> The discussion will cover known unknowns, i.e TODO items, for interested people to step up.\"","seats":"0","goers":"17","invite_only":"N","venue":"E104","id":"a3b5b6b06e90ff59e88a57a30ce833d3","venue_id":"253279","speakers":"Amit Shah"},{"event_key":"63","active":"Y","name":"Lightning talks","event_start":"2015-02-06 17:30:00","event_end":"2015-02-06 19:00:00","event_type":"Lightning talks","description":"Schedule of lightning talks will be announced 1 hour before start of the session<br \/><br \/>Please look here for details:<br \/><a href=\"http:\/\/goo.gl\/jaUpV9\" target=\"_blank\">http:\/\/goo.gl\/jaUpV9<\/a>","seats":"0","goers":"2","invite_only":"N","venue":"D105","id":"97a2ed4f36696f1a0750d00e861f9060","venue_id":"253275"},{"event_key":"64","active":"Y","name":"Lightning talks","event_start":"2015-02-06 17:30:00","event_end":"2015-02-06 19:00:00","event_type":"Lightning talks","description":"Schedule of lightning talks will be announced 1 hour before start of the session<br \/><br \/>Please look here for details:<br \/><a href=\"http:\/\/goo.gl\/jaUpV9\" target=\"_blank\">http:\/\/goo.gl\/jaUpV9<\/a>","seats":"0","goers":"3","invite_only":"N","venue":"D0206","id":"aec703393f297df430161f1547ab1faa","venue_id":"253276"},{"event_key":"65","active":"Y","name":"Lightning talks","event_start":"2015-02-06 17:30:00","event_end":"2015-02-06 19:00:00","event_type":"Lightning talks","description":"Schedule of lightning talks will be announced 1 hour before start of the session.<br \/><br \/>Please look here for details:<br \/><a href=\"http:\/\/goo.gl\/jaUpV9\" target=\"_blank\">http:\/\/goo.gl\/jaUpV9<\/a>","seats":"0","goers":"5","invite_only":"N","venue":"E112","id":"6aeed38a7aa250c6b1c1e4ffcd212aa2","venue_id":"253278"},{"event_key":"66","active":"Y","name":"Community and Java EE","event_start":"2015-02-06 17:30:00","event_end":"2015-02-06 19:00:00","event_type":"Middleware","description":"\"Did you ever find the time to look into what the industry-standard Java EE really means? The reality is that few people really know how Java and Java EE are governed and how these ideas effect their own professional lives in the long and short term.<br \/> This session will aim to introduce the audience to open standards like Java and Java EE and how they are governed. It also discusses what being an open standard really means as well as why and how you should contribute to them yourself.\"","seats":"0","goers":"5","invite_only":"N","venue":"D0207","id":"ee437a1616b68e9488ccddc9d3c23822","venue_id":"253277","speakers":"Markus Eisele"},{"event_key":"67","active":"Y","name":"Vagrant for your Fedora","event_start":"2015-02-07 09:00:00","event_end":"2015-02-07 09:40:00","event_type":"Development","description":"Learn how to start with lightweight, reproducible, and portable development environments with Vagrant, and about the status of Vagrant packaging for Fedora and derivatives.","seats":"0","goers":"9","invite_only":"N","venue":"D105","id":"5c0aa2c270382b064ab71dd1ba370788","venue_id":"253275","speakers":"Josef Stříbný, Tomáš Hrčka"},{"event_key":"68","active":"Y","name":"Choose a testing stack that works for you (Selenium, Capybara, Watir, Cucumber)","event_start":"2015-02-07 09:00:00","event_end":"2015-02-07 09:40:00","event_type":"Software Quality","description":"Each project is unique in its own way. It becomes difficult at times to follow any set rules when choosing tools\/technology for testing; Instead we tend to keep few key points in mind while making such a choice. In this talk I will cover some of these key points you can consider before you decide your testing curve. It requires you have a clear understanding of your goal wrt testing. Brief overview of the testing pyramid will help you slice your tests. I shall help you in finding out the tools\/technologies you can choose to test backend, frontend, API, et al. I will be covering some of the key comparisons in tools like Selenium, Capybara, Watir from my personal experiences. Also, how BDD\/BDT(using Cucumber) gives you an edge will be covered. Integrating your tests with any CI system is easy with minimal configurations. Don't you think you should test the right things the right way.<br \/>","seats":"0","goers":"13","invite_only":"N","venue":"E112","id":"5fe2d33f74f882861d4ece8e3eb66e8a","venue_id":"253278","speakers":"Anisha Narang"},{"event_key":"69","active":"Y","name":"Modern method for performance testing applied","event_start":"2015-02-07 09:00:00","event_end":"2015-02-07 09:40:00","event_type":"Software Quality","description":"\"In this presentation we would like to build some backgrounds by briefly touching the basic topics regarding application performance testing.<br \/> * Why performance matters?<br \/> * What are some critical aspects of performance testing?<br \/> * What should a modern performance testing tool do for you?<br \/> Next we will set the requirements from a real world use case and implement a performance test in a user friendly way in a live demo.<br \/> You will also see some unique algorithms, smooth DSL integration using Groovy, and extensibility of PerfCake.<br \/> <br \/> www.perfcake.org\"","seats":"0","goers":"15","invite_only":"N","venue":"D0207","id":"4bb224df8883373528ea4b2b33940e6d","venue_id":"253277","speakers":"Pavel Macik, Martin Vecera"},{"event_key":"7","active":"Y","name":"Fedora: State of the Project","event_start":"2015-02-08 09:00:00","event_end":"2015-02-08 09:40:00","event_type":"Fedora","description":"An overview of the current state of the Fedora project from the Fedora Project Leader. Covers Fedora.next, the just-released Fedora 21, and plans for Fedora 22 and beyond.","seats":"0","goers":"11","invite_only":"N","venue":"D105","id":"e2a833fdaa6926fdeca6992acc16ed35","venue_id":"253275","speakers":"Matthew Miller"},{"event_key":"70","active":"Y","name":"Integrating oVirt and Foreman to Empower your Data-Center","event_start":"2015-02-07 09:00:00","event_end":"2015-02-07 09:40:00","event_type":"Virtualization","description":"\"In this session Yaniv will give introduction about the oVirt and Foreman projects. The session will focus about advanced and enhanced integration between those products in order to ease deployment of Host to an Hypervisors and provision VMs in a Virtualized environment.<br \/> <br \/> Yaniv will describe how oVirt leverages Foreman functionality to provision bare-metal hosts or add existing ones as oVirt hypervisors. How we plan to extend that in order to provisioning VMs, configure existing hypervisors with repositories and advanced abilities and a lot more.<br \/> <br \/> The talk aims anyone who interested in managing a Virtualized Data-Center using high-end open source technologies. Attendees can expect to get an introduction to oVirt and Foreman, and how they can use the two in order to build and deploy their Data-Center easily, while empowering the hardware they use.\"","seats":"0","goers":"7","invite_only":"N","venue":"E104","id":"899845974167aa70d1141a2e461f5bc9","venue_id":"253279","speakers":"Yaniv Bronheim"},{"event_key":"71","active":"Y","name":"Security Development Lifecycle in Open Source","event_start":"2015-02-07 09:50:00","event_end":"2015-02-07 10:30:00","event_type":"Development, Security","description":"\"Original Security Development Lifecycle (SDL) has been developed in closed-source environment for software companies. Open Source development challenges many assumptions of SDL which is, as such, unsuitable in many usecases.<br \/> <br \/> This presentation will talk about security in Open Source development throughout whole lifecycle, focusing on:<br \/> * security training materials and their availability to Open Source developers<br \/> * specifics of auditing and effectiveness of various forms and approaches (formal audit, hackathons, fuzzing, security testing)<br \/> * vulnerability research and development of mitigations and countermeasures<br \/> <br \/> http:\/\/docs.fedoraproject.org\/en-US\/Fedora_Security_Team\/1\/html\/Defensive_Coding\/index.html<br \/> http:\/\/docs.fedoraproject.org\/en-US\/Fedora_Security_Team\/1\/html\/Secure_Ruby_Development_Guide\/index.html<br \/> https:\/\/securityblog.redhat.com\/tag\/cwe\/\"","seats":"0","goers":"6","invite_only":"N","venue":"D105","id":"8d7d01d748057d32f795726184973041","venue_id":"253275","speakers":"Ján Rusnačko"},{"event_key":"72","active":"Y","name":"The Best Test Data is Random Test Data (introduction to property based testing)","event_start":"2015-02-07 09:50:00","event_end":"2015-02-07 10:30:00","event_type":"Software Quality","description":"\"An introduction to property-based testing, explaining its purpose<br \/> and benefits, and demonstrating its use.<br \/> <br \/> Testing accounts for a large portion of the cost of software<br \/> development. Tools to automate testing allow for more thorough<br \/> testing in less time. Property-based testing provides ways to<br \/> define expected properties of functions under test and mechanisms to<br \/> automatically check whether those properties hold in a large number<br \/> of cases - or whether a property can be falsified.<br \/> <br \/> Concepts will be demonstrated primarily in Haskell, using the <br \/> QuickCheck library. Property-based testing is available in most<br \/> languages, so options for Python and Java will also be examined.<br \/> The talk will conclude with a discussion of the limitations of<br \/> property-based testing, and alternative approaches.<br \/> <br \/> Project URL: http:\/\/www.cse.chalmers.se\/~rjmh\/QuickCheck\/\"","seats":"0","goers":"11","invite_only":"N","venue":"E112","id":"8e1e80cb73bb0deb0b98d536495d4efa","venue_id":"253278","speakers":"Fraser Tweedale"},{"event_key":"73","active":"Y","name":"Automation of complex test scenarios via Arquillian Spacelift","event_start":"2015-02-07 09:50:00","event_end":"2015-02-07 10:30:00","event_type":"Software Quality","description":"\"Using an application is easy. Testing it should be easy as well. However, testing scenario has external dependencies that differ on various platforms, take long time to setup and often test scenario itself does not provide enough flexibility and re-usability.<br \/> <br \/> In this session, you will learn from our failures. You&rsquo;ll see how Arquillian Spacelift helps you to bring tools you need for the test execution and lets you to define complex test scenarios that can be easily executed in CI and reproduced locally with zero setup required on a local machine and why we consider this approach superior to our previous attempts. You will also have a chance to see a live demo for mobile application test. And you would be able to reproduce the test on your machine!<br \/> <br \/> Do not spend time with configuration any more, skip right to writing test scenarios that run from both CI and local machines out of the box.\"","seats":"0","goers":"11","invite_only":"N","venue":"D0207","id":"27a3959d68ea5d22b45b1577013a955c","venue_id":"253277","speakers":"Karel Piwko"},{"event_key":"74","active":"Y","name":"The new oVirt Extension API - Taking AAA (Authentication Authorization Accounting) to the next level","event_start":"2015-02-07 09:50:00","event_end":"2015-02-07 10:30:00","event_type":"Virtualization","description":"\"Abstract:<br \/> Prior to oVirt 3.5, authentication and authorization was implemented as<br \/> monolithic module, logic and schema was hard-coded, Kerberos was used for<br \/> authentication to LDAP server. It was very hard to support and it didn't contain<br \/> requested features like SSO or proper multi-domain setup.<br \/> <br \/> In this session we will take a look at new extension API introduced in oVirt 3.5.<br \/> This API is designed to be stable (easy to extend without breaking backward<br \/> compatibility), simple (it's invoke based) and yet flexible (it allows extension<br \/> to extension communication and allows to write extensions in other languages<br \/> than Java like Javascript or JPython).<br \/> <br \/> We will also take a look at the AAA (authentication, authorization, accounting)<br \/> extensions which leverages this API. Those extensions included in oVirt 3.5<br \/> allow to use generic LDAP or database for authentication and authorization or<br \/> allow SSO for UI and API part of oVirt.<br \/> <br \/> <br \/> Project: http:\/\/www.ovirt.org\"","seats":"0","goers":"7","invite_only":"N","venue":"E104","id":"2220cb283ef2fdfabce443f849eae656","venue_id":"253279","speakers":"Martin Peřina"},{"event_key":"75","active":"Y","name":"ABRT server - the resting place of crashed processes' soul","event_start":"2015-02-07 10:40:00","event_end":"2015-02-07 11:20:00","event_type":"Development","description":"- Overview of the ABRT (Automated Bug Reporting Tool) project's server side<br \/> - Collection of statistics about crashes in Fedora and CentOS<br \/> - How can ABRT server help you fix bugs and prioritize your work?<br \/> <br \/> https:\/\/github.com\/abrt\/<br \/> https:\/\/retrace.fedoraproject.org\/faf2\/summary\/","seats":"0","goers":"3","invite_only":"N","venue":"D105","id":"a3cf8d7058babddb9b63e5633e89e900","venue_id":"253275","speakers":"Marek Bryša"},{"event_key":"76","active":"Y","name":"CI Provisioner - slave and test resources in Openstack, Beaker, Foreman, and Docker through one mechanism","event_start":"2015-02-07 10:40:00","event_end":"2015-02-07 11:20:00","event_type":"Software Quality","description":"\"There are many plugins in Jenkins to provision both Jenkins slaves or test resources, but with the CI Provisioner we can provision slave and test resources in Openstack, Beaker, Foreman, and Docker through one mechanism.<br \/> <br \/> The CI Provisioner uses JSON format to define project defaults for tenant credentials and JSON format to define topologies in different infrastructures.<br \/> <br \/> Jenkins slaves can be deployed in Openstack and Docker.<br \/> <br \/> Test resources can be deployed in Openstack, Beaker, Foreman, and Docker.\"","seats":"0","goers":"11","invite_only":"N","venue":"E112","id":"23dcd9087a6782a5e140f139cb867054","venue_id":"253278","speakers":"Ari LiVigni"},{"event_key":"77","active":"Y","name":"Mobile testing challenges and solutions","event_start":"2015-02-07 10:40:00","event_end":"2015-02-07 11:20:00","event_type":"Software Quality","description":"Mobile world does support testing, but it brings many obstacles along the way. Let's look at some of them in detail and discuss possible solutions. This talk will also cover mobile testing tools we developed in Mobile QE at Red Hat like Arquillian Osmium and Arquillian Droidium.","seats":"0","goers":"5","invite_only":"N","venue":"D0207","id":"56502de9c5b562db3e335e61a5482f5b","venue_id":"253277","speakers":"Tadeáš Kříž"},{"event_key":"78","active":"Y","name":"Automatically deploying GlusterFS with Puppet-Gluster+Vagrant","event_start":"2015-02-07 10:40:00","event_end":"2015-02-07 11:20:00","event_type":"Development","description":"A showcase of the Puppet-Gluster module. This module is particularly<br \/> interesting because it functions in a decentralized environment, while<br \/> remaining highly available. It uses Puppet to deploy and manage a<br \/> GlusterFS cluster. New work presented integrates all of the<br \/> functionality with Vagrant (using vagrant-libvirt) running on a Fedora<br \/> 20 machine. This makes it easy for a new user or a seasoned pro to<br \/> [re-]deploy GlusterFS in under 30 min. Features a live demo or two.","seats":"0","goers":"12","invite_only":"N","venue":"E104","id":"bb36bcd5e0d97cdab69d014b77c3edad","venue_id":"253279","speakers":"James Shubin (purpleidea)"},{"event_key":"79","active":"Y","name":"Step by Step - Reusing old features to build new ones","event_start":"2015-02-07 11:30:00","event_end":"2015-02-07 12:10:00","event_type":"Development","description":"\"Designing monolithic infrastructures is a common mistake in large projects. However, more often than not, these infrastructures are too generic, make false assumptions or are simply delivered too late for feature developers to use, becoming \"\"white elephants\"\".<br \/> <br \/> This presentation is a case study of the work done by my team to deliver Live Merging of Snapshots oVirt from the initial steps in oVirt 3.1.0 to the full delivery in 3.5.0, and how good design can be feature-driven, building infra-structures step by step, while gaining small wins during the process.\"","seats":"0","goers":"1","invite_only":"N","venue":"D105","id":"90dbc617a82dd0d5c1cd811456b8689f","venue_id":"253275","speakers":"Allon Mureinik"},{"event_key":"8","active":"Y","name":"Fedora Workstation Roadmap","event_start":"2015-02-08 09:50:00","event_end":"2015-02-08 10:30:00","event_type":"Fedora","description":"The attending members of the Fedora Workstation Working Group will participate in a panel discussion of progress and plans toward future iterations of the Workstation. We'll connect the dots between GNOME, Freedesktop.org, and other upstream work and integration in the Workstation. There will be plenty of time for Q&A from the audience as well.","seats":"0","goers":"8","invite_only":"N","venue":"D105","id":"46395bae740bc7bbd62b0d3d01a02a68","venue_id":"253275","moderators":"Paul W. Frields"},{"event_key":"80","active":"Y","name":"QA Short talks","event_start":"2015-02-07 11:30:00","event_end":"2015-02-07 12:10:00","event_type":"Software Quality","description":"RPMgrill - rpm sanity testing - Miro Vadkerti, Testing of Fedora with fedora-gooey-karma - Brano Blaskovic, Beakerlib Docs generator - Jiri Kulda","seats":"0","goers":"1","invite_only":"N","venue":"E112","id":"783b3064f6076128e27c3b71f5d20ceb","venue_id":"253278","speakers":"Miro Vadkerti, Brano Blaskovic, Jiri Kulda"},{"event_key":"81","active":"Y","name":"40 great Jenkins plugins in 40 minutes","event_start":"2015-02-07 11:30:00","event_end":"2015-02-07 12:10:00","event_type":"Software Quality","description":"\"Continuous integration (CI) has become a necessary part of software development process, with Jenkins being the most used CI server in the industry. The power of Jenkins lies largely in its plugins, and with over 1000 of them being out there, it can be hard to find the right ones.<br \/> <br \/> During this talk, we'll take on the daunting task of introducing 40 plugins which we consider extremely useful, well-written and production-ready. Come and find out what runs on one of the largest Jenkins installations in the world, how you can increase your productivity and make the most of your CI.\"","seats":"0","goers":"22","invite_only":"N","venue":"D0207","id":"be3e4efb5ea8eab4e05275a25a88f884","venue_id":"253277","speakers":"Miroslav Cupak"},{"event_key":"82","active":"Y","name":"The SoS Report","event_start":"2015-02-07 11:30:00","event_end":"2015-02-07 12:10:00","event_type":"Development","description":"The SoS project has been helping engineers debug and resolve problems remotely for nearly a decade. This talk will look at the history of SoS and related tools, current and future development and the state of the project today including how the team is adapting to today's trends in containers, virtualisation and cloud computing.","seats":"0","goers":"4","invite_only":"N","venue":"E104","id":"861dc3f3e32ff7f7aad553b57e4af886","venue_id":"253279","speakers":"Bryn M. Reeves"},{"event_key":"83","active":"Y","name":"Get On The Bus!","event_start":"2015-02-07 12:30:00","event_end":"2015-02-07 13:10:00","event_type":"Development","description":"kdbus and systemd's sd-bus API are two major, recent additions to the D-Bus ecosystem. This talk will discuss what this means for Linux developers. It will explain why D-Bus is the one IPC system you should be using, regardless whether you work on system-level software or higher up in the stack.<br \/> <br \/> We'll discuss the reasons to use the bus, why not to cook your own IPC, the choices to make, and finally will focus on a few selected code examples.<br \/> <br \/> This talks is intended in particular for everybody who is wondering what this D-Bus thing is all about and which IPC to pick or whether to roll your own for your project.<br \/>","seats":"0","goers":"8","invite_only":"N","venue":"D105","id":"4671d6efda9a373f1aad4491af0f037d","venue_id":"253275","speakers":"Lennart Poettering"},{"event_key":"84","active":"Y","name":"Avocado - Next Generation Test Framework","event_start":"2015-02-07 12:30:00","event_end":"2015-02-07 13:10:00","event_type":"Software Quality","description":"\"Avocado (https:\/\/github.com\/avocado-framework\/avocado) is a test framework developed after the experience we had with the autotest project (http:\/\/autotest.github.io\/). It intends to improve on the good ideas autotest pioneered (such as a rich python test API for regression, performance and stress testing), with a more standard design and more focus on usability for both developers and QE.<br \/> <br \/> This workshop will go over the rationale for developing avocado, and demo of the current features.\"","seats":"0","goers":"5","invite_only":"N","venue":"E112","id":"d0730917856bcb6312a94a109e12f600","venue_id":"253278","speakers":"Lucas Meneghel Rodrigues"},{"event_key":"85","active":"Y","name":"Evolving APIs in Java","event_start":"2015-02-07 12:30:00","event_end":"2015-02-07 13:10:00","event_type":"Development","description":"\"It is a little surprising how often Java libraries tend to break API compatibility between even minor or micro versions.<br \/> <br \/> In this presentation I'd like to go through some of the lesser known problems when evolving an API of a library. This will be based on the amazing work of Jens Dietrich and his Java Puzzlers (https:\/\/sites.google.com\/site\/jensdietrich\/ and http:\/\/www.slideshare.net\/JensDietrich\/presentation-30367644).<br \/> <br \/> I will also introduce a new tool for build-time API change tracking that I recently released, called Revapi (http:\/\/revapi.org).\"","seats":"0","goers":"8","invite_only":"N","venue":"D0207","id":"a52d3394c7bf18164b702eb6477f1561","venue_id":"253277","speakers":"Lukas Krejci"},{"event_key":"86","active":"Y","name":"Discover Python 3!","event_start":"2015-02-07 12:30:00","event_end":"2015-02-07 13:10:00","event_type":"Development","description":"Discover Python 3 with all its advantages, learn why and how Fedora will make it the default Python implementation and how you can benefit from switching to it. Notes on porting included!","seats":"0","goers":"12","invite_only":"N","venue":"E104","id":"02d422ace14cdfbab0066e6f56bd8baf","venue_id":"253279","speakers":"Slavek Kabrda"},{"event_key":"87","active":"Y","name":"Cockpit: Modern Server User Interface","event_start":"2015-02-07 13:20:00","event_end":"2015-02-07 14:00:00","event_type":"System management","description":"Cockpit is the modern Server UI for Linux. It's built to be very light, thin, secure, interactive and well integrated with the server and its services.<br \/> <br \/> Besides being a discoverable and polished UI out of the box, Cockpit has a powerful architecture that allows writing you to write server user interfaces for your projects. We'll demo how easy it is to prototype a user interface and interact with your server tool or service.<br \/> <br \/> When you come away from this talk you'll have a better idea of how Cockpit is put together: how it communicates with your server, authenticates users, connects out to multiple servers, is embeddable in other projects, and what makes it different from server control panels and configuration management software.<br \/> <br \/> http:\/\/cockpit-project.org\/","seats":"0","goers":"9","invite_only":"N","venue":"D105","id":"bf1d227c75f7af99bf8d81b487ef955d","venue_id":"253275","speakers":"Stef Walter"},{"event_key":"88","active":"Y","name":"Improving the CI workflows with Docker","event_start":"2015-02-07 13:20:00","event_end":"2015-02-07 14:00:00","event_type":"Software Quality","description":"The talk will cover various tips how to improve your CI (and eventually CD) workflows with Docker. Jenkins CI and its Docker plugins will be used for practical demonstration of some proposed approaches.","seats":"0","goers":"12","invite_only":"N","venue":"E112","id":"bd34d6654b918f842ea5a1ee09743a04","venue_id":"253278","speakers":"Vojtěch Juránek"},{"event_key":"89","active":"Y","name":"Ceylon","event_start":"2015-02-07 13:20:00","event_end":"2015-02-07 14:00:00","event_type":"Development","description":"Ceylon is a new, modern and elegant programming language for the JVM and the JavaScript VM, but it&rsquo;s more than that: it is a full platform with modularity, an SDK, tools, and IDEs. This session will uncover the most cool and interesting languages features.","seats":"0","goers":"4","invite_only":"N","venue":"D0207","id":"034bcc5c5043b2804f558b98128d5341","venue_id":"253277","speakers":"Tomas Hradec"},{"event_key":"9","active":"Y","name":"Fedora Server - Getting back to our roots","event_start":"2015-02-08 10:40:00","event_end":"2015-02-08 11:20:00","event_type":"Fedora","description":"Fedora 21 Server was recently released into the wild. Come join us and learn a bit about what Fedora Server has to offer and where we see it going in the future.","seats":"0","goers":"7","invite_only":"N","venue":"D105","id":"6f95d831b27126e1f3ebb259d885bbda","venue_id":"253275","speakers":"Stephen Gallagher"},{"event_key":"90","active":"Y","name":"Discovering distributed task queue in its simplest form using Retask","event_start":"2015-02-07 13:20:00","event_end":"2015-02-07 14:00:00","event_type":"Development","description":"Description:<br \/> <br \/> Ever thought of having a distributed task queue ready to be used and yet very simple ?<br \/> Retask is a distributed task queue system written in Python. It has one of the simplest API ever written for a distributed task queue. It supports both Python 2.x and 3.x.<br \/> <br \/> The talk will demonstrate:<br \/> <br \/> Using queues can be easy!<br \/> API (5 tiny methods, I promise)<br \/> Asynchronous & synchronous communication between workers and producers.<br \/> Real life use cases in Fedora Infrastructure and inside Red Hat.<br \/> <br \/> Talk outline<br \/> Introduction to Retask<br \/> Retask is not a message queue. It is not AMQP or zmq.<br \/> Retask is for creating Task\/Job queues (All above is for the basic introduction of the library and reason I started writing it).<br \/> <br \/> Having that simplest queue (First example demoed.)<br \/> <br \/> Asynchronous result passing example, showing non-blocking calls from Retask. (We will have 1 producer and two workers, workers will return some result data in async non blocking calls) <br \/> <br \/> Synchronous result passing example, showing blocking calls from Retask. (Using blocking calls, we will try the same example shown above.)<br \/> <br \/> Use cases inside Fedora Infrastructure: Async Caching in Fedora Packages App & Darkserver project.<br \/> <br \/> Use cases inside Red Hat<br \/> <br \/> <br \/> Performance tips<br \/> \"","seats":"0","goers":"1","invite_only":"N","venue":"E104","id":"99cd5ce8b002b63c0409cc93a47343bb","venue_id":"253279","speakers":"Kushal Das"},{"event_key":"91","active":"Y","name":"How 'Open' Is OpenPOWER?","event_start":"2015-02-07 14:10:00","event_end":"2015-02-07 14:50:00","event_type":"Development, Hardware","description":"This session will detail the current hardware and software plans around the OpenPOWER Foundation -- a fast growing collaboration between IBM, Google, Nvidia, Mellanox, Tyan, and others. If you've got interest in Linux on Power and want to have deeper insight into how IBM intends to grow our ecosystem, do not miss this talk.","seats":"0","goers":"5","invite_only":"N","venue":"D105","id":"478e86bd76f869352164b848c7b9211f","venue_id":"253275","speakers":"Jeffrey J. Scheel"},{"event_key":"92","active":"Y","name":"OpenShift v3","event_start":"2015-02-07 14:10:00","event_end":"2015-02-07 14:50:00","event_type":"OpenShift","description":"News regarding OpenShift and it's brand new version. What has changed in OpenShift architecture? How can you implement better and more sofisticated applications?","seats":"0","goers":"10","invite_only":"N","venue":"D0206","id":"30d4664916ba699be0003c16768119d0","venue_id":"253276","speakers":"Marek Jelen, Michal Fojtik, Marek Mahut"},{"event_key":"93","active":"Y","name":"Fabric - one tool to rule them all","event_start":"2015-02-07 14:10:00","event_end":"2015-02-07 14:50:00","event_type":"Software Quality","description":"At some point in your job as devops lead, you'll come to a conclusion there are some tasks that has to be automated (enough is enough!). You'll start looking for the right tool to do it, and you'll have lots of options out there, we chose fabric, and we're doing some cool stuff with it! In this short talk we'll show you how to use fabric from simple tasks such as updating multiple hosts using yum, to provisioning a system to any operating system you'll need or even monitoring Jenkins master status for offline slaves or job load, while utilizing nagios along the way.","seats":"0","goers":"8","invite_only":"N","venue":"E112","id":"a2c382c39cc4c4c155e8baebf20ccc9c","venue_id":"253278","speakers":"Eyal Edri"},{"event_key":"94","active":"Y","name":"Scheduling your clouds with Optaplanner: How we (almost) beat academia","event_start":"2015-02-07 14:10:00","event_end":"2015-02-07 14:50:00","event_type":"Development, Middleware","description":"\"In the summer of 2014, we put Optaplanner to the test and tried to win an academic competition in scheduling for clouds. After a fair fight, we finished in second place, beating some full-time researchers. Interested in seeing how we managed that? Come see for yourself!<br \/> <br \/> Optaplanner project: http:\/\/www.optaplanner.org\/<br \/> The challenge: http:\/\/iconchallenge.insight-centre.org\/<br \/> \"","seats":"0","goers":"5","invite_only":"N","venue":"D0207","id":"2761df85e9bb189d4f55e260ee51998f","venue_id":"253277","speakers":"Lukáš Petrovický"},{"event_key":"95","active":"Y","name":"firewalld - present and future","event_start":"2015-02-07 14:10:00","event_end":"2015-02-07 14:50:00","event_type":"Security","description":"\"Overview of known firewalld features like zones, services, rich rules and the direct interface. Description of latest firewalld features like puppet support, runtime to permanent migration, extended D-Bus interface, firewalld recode and libfirewall. Presentation of future plans.<br \/> <br \/> URL: http:\/\/firewalld.org\/\"","seats":"0","goers":"12","invite_only":"N","venue":"E104","id":"d619e9aaed7a29e996a69e1648a25691","venue_id":"253279","speakers":"Thomas Woerner"},{"event_key":"96","active":"Y","name":"Using ansible for community managed infrastructure","event_start":"2015-02-07 15:00:00","event_end":"2015-02-07 15:40:00","event_type":"System management","description":"Starting a new community project is sometime a easy task, like creating a git repository on some popular services and be done with it. And sometime, the limitation of the simple approach are immediately visible and you need your own infrastructure to make sure your project grow in the right direction. This talk will be about using ansible to manage your own infrastructure, but with a twist, ie doing it in the open in a true community way. We will see the various pitfalls to avoid ( and lessons learned the hard way ), the example of potential deployment architectures and discuss various ways to ease the onboardong of new community members in the project.","seats":"0","goers":"13","invite_only":"N","venue":"D105","id":"e6e5fb1dc338fdaf8a3b132446990b20","venue_id":"253275","speakers":"Michael Scherer"},{"event_key":"97","active":"Y","name":"OpenShift v3: Docker, Kubernetes & the power of Cross Community Collaboration","event_start":"2015-02-07 15:00:00","event_end":"2015-02-07 15:40:00","event_type":"OpenShift","description":"\"Linux Containers have quickly emerged as key open source application packaging and delivery technologies, combining lightweight application isolation with the flexibility of an image-based deployment method. In this session, we'll cover how OpenShift engineering has re-architected OpenShift V3 and collaborated with both the Docker & Google Kubernetes projects to build out the next generation of PaaS today.<br \/> <br \/> This session will highlight the features and benefits of OpenShift V3's use Linux Containers including: <br \/> 1) Application portability, allowing for the flexible deployment of the application container across multiple AWS regions, instances or availability zones; <br \/> 2) Minimal footprint and boot time, reducing the overhead of deploying new application containers; 3) Simplified maintenance, reducing the effort and risk of patching applications and their dependencies; and, <br \/> 4) Lowered development costs, as enterprises need only develop, test and certify applications against a single container runtime.<br \/> <br \/> In this session, you will learn how OpenShift V3 <br \/> (1) uses Docker to easily deploy pre-built applications; <br \/> (2) uses Kubernetes to manage container clusters; and,<br \/> (3) how Red Hat's OpenShift PaaS orchestrates source code deployment and centralizes management to leverage these technologies for the benefit of developers and administrators alike.\"","seats":"0","goers":"10","invite_only":"N","venue":"D0206","id":"8566ed7b1395f1e7b103509850cf7521","venue_id":"253276","speakers":"Diane Mueller-Klingspor"},{"event_key":"98","active":"Y","name":"Autokdump - automated root cause analysis for kernel crashes","event_start":"2015-02-07 15:00:00","event_end":"2015-02-07 15:40:00","event_type":"Software Quality, Kernel","description":"\"Autokdump is a minimal daemon to capture kernel-based crash dumping (kdump) memory image and apply intelligence guiding root cause analysis.<br \/> https:\/\/fedorahosted.org\/autokdump\/\"","seats":"0","goers":"7","invite_only":"N","venue":"E112","id":"7e296932a453bb3f03a89de2b59c99aa","venue_id":"253278","speakers":"CAI Qian"},{"event_key":"99","active":"Y","name":"Write Yourself an Annotation Processor","event_start":"2015-02-07 15:00:00","event_end":"2015-02-07 15:40:00","event_type":"Development","description":"Annotation processors were standardized in Java 6, but it wasn't until recently that they began gaining some popularity. In this talk, I will argue that they are a pretty nice form of compile-time metaprogramming, a facility which a lot of languages are sorely lacking. I will explain why it makes sense to write an annotation processor, show some real-world examples, both small and big, and then implement a simple yet useful annotation processor from scratch.","seats":"0","goers":"4","invite_only":"N","venue":"D0207","id":"e839fc14feddee3283cef2f530c1cfd2","venue_id":"253277","speakers":"Ladislav Thon"}]