{"sessions":[{"type":"Talk","event_start":1391760000,"event_start_rfc":"Fri, 07 Feb 2014 09:00:00 +0100","event_end":1391762400,"event_end_rfc":"Fri, 07 Feb 2014 09:40:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"Defining future of Red Hat! ","speakers":["Tim Burke"],"description":"Keynote will be broadcasted to all conference room","tags":[],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391760000,"event_start_rfc":"Fri, 07 Feb 2014 09:00:00 +0100","event_end":1391762400,"event_end_rfc":"Fri, 07 Feb 2014 09:40:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"Defining future of Red Hat! ","speakers":["Tim Burke"],"description":"Keynote will be broadcasted to all conference room","tags":[],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391760000,"event_start_rfc":"Fri, 07 Feb 2014 09:00:00 +0100","event_end":1391762400,"event_end_rfc":"Fri, 07 Feb 2014 09:40:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Defining future of Red Hat! ","speakers":["Tim Burke"],"description":"Keynote will be broadcasted to all conference room","tags":[],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391763000,"event_start_rfc":"Fri, 07 Feb 2014 09:50:00 +0100","event_end":1391765400,"event_end_rfc":"Fri, 07 Feb 2014 10:30:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"Linux Kernel Network Stack Walkthrough","speakers":["Thomas Graf"],"description":"This presentation features a walk through the Linux kernel networking stack covering the essentials and recent developments a developer needs to know. Our starting point is the network card driver as it feeds a packet into the stack. We will follow the packet as it traverses through various subsystems such as packet filtering, routing, protocol stacks, and the socket layer. We will pause here and there to look into concepts such as segmentation offloading, TCP small queues, and low latency polling. We will cover APIs exposed by the kernel that go beyond use of write()\/read() on sockets and will look into how they are implemented on the kernel side.","tags":["Networking"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391763000,"event_start_rfc":"Fri, 07 Feb 2014 09:50:00 +0100","event_end":1391765400,"event_end_rfc":"Fri, 07 Feb 2014 10:30:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"AeroGear","speakers":["Tadeas Kriz"],"description":"These days the market is heavily shifting towards mobile and in order to success, you have to provide the best possible experience for the users. However, if you're willing to support more than just one platform, you'll have a lot of duplicate code. And that's where AeroGear comes in. It is a set of libraries, made to simplify and unify the development across different mobile platforms, and to relief the pain of writing all the common code over and over again.This talk will cover the features AeroGear provides for multiple platforms, show its easy usage and full-featured demo application based on it.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391763000,"event_start_rfc":"Fri, 07 Feb 2014 09:50:00 +0100","event_end":1391765400,"event_end_rfc":"Fri, 07 Feb 2014 10:30:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Wake me up! A tale of (not) a startup.","speakers":["Langdon White"],"description":"Imaginary Acme Co. has been producing the illustrious &ldquo;Wake Me Up&rdquo; app -- which alerts you when you get close to your stop on the T (in case you fell asleep from those long startup-y hours). Get the inside scoop on their startup journey!Following the &ldquo;lean methodology,&rdquo; the intrepid heroes set out to build their Minimum Viable Product(!), only to discover, that:1) Production apps need to run on production quality servers2) Developers and deployment environments don't always agree on the definition of &ldquo;stability&rdquo;3) Maintenance of applications is hardJoin us for a session about using Red Hat Software Collections to enable both stability and agility in your production applications. The &ldquo;Wake Me Up&rdquo; app exists, is written in Python, and is open source and available to attendees (with a number of bonus bugs and usability issues :) ).&nbsp;","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391763000,"event_start_rfc":"Fri, 07 Feb 2014 09:50:00 +0100","event_end":1391768400,"event_end_rfc":"Fri, 07 Feb 2014 11:20:00 +0100","room":"Workshop room L1 - B410","room_short":"L1","room_color":"#729fcf","topic":"Writing an internal DSL language in Scala","speakers":["Jiri Kremser"],"description":"Have you ever wanted to write your own programming language? Why not to  start with much simpler task - writing some domain specific language.  Since the Scala programming language is a great fit for creating  internal DSL, we will utilize its functional nature and implicit  conversions, and together we will create a fluent API in form of a DSL.  Scala noob? No worries! No previous Scala experience is needed, all  the techniques will be explained during the workshop. It&rsquo;ll be piece of  cake if you know any modern programming language.&nbsp;","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391763000,"event_start_rfc":"Fri, 07 Feb 2014 09:50:00 +0100","event_end":1391765400,"event_end_rfc":"Fri, 07 Feb 2014 10:30:00 +0100","room":"Workshop room L2 - C525","room_short":"L2","room_color":"#ef2929","topic":"Allwinner A10\/A20 support for the upstream kernel","speakers":["Hans de Goede"],"description":"Talk about adding support for the populair low cost Allwinner A10 and A20 SOCs to the upstream kernel. The last few months all the bits for support for these SOCs has been falling in to place. This talk will discuss what has been achieved, hurdles encountered during the process, lessons learned and what remains to be done.","tags":["Kernel"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391763000,"event_start_rfc":"Fri, 07 Feb 2014 09:50:00 +0100","event_end":1391768400,"event_end_rfc":"Fri, 07 Feb 2014 11:20:00 +0100","room":"Workshop room L3 - C511","room_short":"L3","room_color":"#ad7fa8","topic":"Eclipse Platform Unleashed","speakers":["Severin Gehwolf"],"description":"Eclipse is most commonly known as Java IDE. However, it is a lot more than that. It can be used as a platform for Rich Client Applications as well as functionally extended via its plug-in architecture. Almost everything in Eclipse is implemented as an Eclipse plug-in in one way or another. These components provide a myriad of specialized functionality and Extension Points allowing the gifted developer to implement almost anything they've set their mind to.In this hands-on lab some of the cool new features of Eclipse Kepler are demonstrated. Have you ever considered using Eclipse CDT + Linux Tools for C\/C++ development? CDT + Linux Tools bring profiling and memory corruption detection support directly into your IDE. Are you a Java developer using Eclipse? How efficient are you browsing the code base you are working on day-to-day? Learn how to use Eclipse's core features in order to increase your productivity as a Java developer. Did you know that E4, the new face of Eclipse, allows you to make your Eclipse based application look the way you want it to look? Gone are the days where you could spot Eclipse based applications right away. With E4 and CSS you can achieve this by simply shipping your own CSS file along with your application.This session also gives an introduction to developing an Eclipse Plug-in. In order to get the most out of this session, helpful tools for developing Eclipse plug-ins are introduced along the way.Language: EnglishAudience: Java\/C\/C++ developers &amp;&amp; anyone interested in Eclipse Plug-in development","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391766000,"event_start_rfc":"Fri, 07 Feb 2014 10:40:00 +0100","event_end":1391768400,"event_end_rfc":"Fri, 07 Feb 2014 11:20:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"NetworkManager for the Enterprise","speakers":["Daniel Williams"],"description":"Why not run NetworkManager on all your systems?  We've made huge leaps in complex networking configuration and functionalty over the last years, and best of all, NetworkManager will surprise you less!  With new support for bridging, bonding, VLANs, Infiniband, Team, tun\/tap, macvlan, gre, and more and a powerful new command-line interface, NetworkManager provides a consistent platform for network configuration and monitoring from laptops to the enterprise.  Want it to be more static?  It can be!  Want it to respect changes you make with command-line tools?  It will!  Come learn where NetworkManager is heading, and how it can work for you today.","tags":["Networking"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391766000,"event_start_rfc":"Fri, 07 Feb 2014 10:40:00 +0100","event_end":1391768400,"event_end_rfc":"Fri, 07 Feb 2014 11:20:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"Re-thinking Web App Development with Web Components standard","speakers":["Lukas Fryc"],"description":"Web Components is an emerging umbrella of standards that fundamentally changes the way we compose our web applications. Web Components abstract away the complexity introduced when using low-level building blocks such as HTML, CSS and JavaScript.This complexity is usually handled on the level of web frameworks, where we can perceive few phenomenons: web frameworks usuallyit&rsquo;s own way of how to work with low-level APIs,maintains custom UI widget suites,lock us in a particular solution.What about inventing some common denominator that could frameworks and app developers built upon?Web Components are essentially a set of improvements that are being added to the web platform: HTML Imports, Shadow DOM, &lt;template&gt;, custom elements, object observers, DOM mutation observers, MDV, new CSS primitives. All of these APIs are on their way to becoming standards. But can we leverage them already?Thanks to polyfill libraries like Polymer we can leverage those new APIs right away!Thanks to Web Components, the web will get a new common denominator which kills fragmentation and encourages reuse and portability of user interfaces.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391766000,"event_start_rfc":"Fri, 07 Feb 2014 10:40:00 +0100","event_end":1391768400,"event_end_rfc":"Fri, 07 Feb 2014 11:20:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Docker, software in a box","speakers":["Alexander Larsson"],"description":"Docker is a new system for using containers on Linux. This presentation will describe what containers are, what Docker is, how it works and why it is useful. Then it will give a short demonstation of using docker.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391766000,"event_start_rfc":"Fri, 07 Feb 2014 10:40:00 +0100","event_end":1391771400,"event_end_rfc":"Fri, 07 Feb 2014 12:10:00 +0100","room":"Workshop room L2 - C525","room_short":"L2","room_color":"#ef2929","topic":"Firefox OS hacking","speakers":["Martin Stransky"],"description":"Create your own Firefox OS application, check the FFOS phone...","tags":["Desktop"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391769000,"event_start_rfc":"Fri, 07 Feb 2014 11:30:00 +0100","event_end":1391771400,"event_end_rfc":"Fri, 07 Feb 2014 12:10:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"The consequences of finger swiping (openvswitch)","speakers":["Flavio Leitner"],"description":"The buzzword of the moment is cloud.  However, there is a whole open source infrastructure supporting it. The presentation will highlight some of the new developments in the networking stack and briefly explain some networking solutions used in production environments like NIC bonding, SR-IOV, openvswitch, vlan, IPVS, NIC offloading features and others.","tags":["Networking"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391769000,"event_start_rfc":"Fri, 07 Feb 2014 11:30:00 +0100","event_end":1391771400,"event_end_rfc":"Fri, 07 Feb 2014 12:10:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"OSTree: A middle ground between packages and images","speakers":["Colin Walters"],"description":"OSTree allows clients to atomically upgrade and switch between multiple versioned filesystem trees.  It was designed from the start to complement package systems like RPM and dpkg.  It offers a middle ground between the extreme flexibility of package systems, and the singular OS vision of operating systems such as ChromeOS.Being less flexible allows OSTree to (in some scenarios) be much faster and more reliable than packages, which is an important component of doing continuous integration and deployment.  For example, this talk will discuss releasing Fedora 100 times a day or more, rather than just \"nightly\".","tags":["Desktop, Fedora"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391769000,"event_start_rfc":"Fri, 07 Feb 2014 11:30:00 +0100","event_end":1391771400,"event_end_rfc":"Fri, 07 Feb 2014 12:10:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"DevAssistant","speakers":["Bohuslav Kabrda"],"description":"DevAssistant (https:\/\/github.com\/bkabrda\/devassistant) is a new tool that targets both development beginners and seasoned coders. It can set up development environment, kickstart new projects in various languages and frameworks and install dependencies. This presentation will explain how DevAssistant works, what the future plans are and what it can do for you.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391769000,"event_start_rfc":"Fri, 07 Feb 2014 11:30:00 +0100","event_end":1391771400,"event_end_rfc":"Fri, 07 Feb 2014 12:10:00 +0100","room":"Workshop room L1 - B410","room_short":"L1","room_color":"#729fcf","topic":"oVirt scheduler","speakers":["Jiri Moskovcak"],"description":"This presentation will provide the introduction to the new oVirt scheduler architecture and it will also show how to use the scheduler API to write the custom scheduler rules and use it to add scheduling functionality according to the user specific needs.","tags":["Cloud"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391769000,"event_start_rfc":"Fri, 07 Feb 2014 11:30:00 +0100","event_end":1391775000,"event_end_rfc":"Fri, 07 Feb 2014 13:10:00 +0100","room":"Workshop room L3 - C511","room_short":"L3","room_color":"#ad7fa8","topic":"Thermostat","speakers":["Severin Gehwolf"],"description":"It is important to understand your Java application's behavior at runtime. This becomes business critical if your application behaves poorly when deployed in production. Having data for analyzing your Java application's misbehavior can be crucial. Thermostat helps with that and provides developers and admins with a framework for Java application monitoring and instrumentation.Thermostat comes with recording and visualization capabilities for your Java application. It also allows for decoupling of metric recording and its analysis. What's more, Thermostat supports remote monitoring and instrumentation of the system which is hosting your Java application while keeping the extra overhead minimal. In short, it can provide an inside perspective of what's happening inside your OpenJDK JVM while it's executing your application.In this session we'll show some of Thermostat's out-of-the-box-features and we will conclude with a hands-on workshop developing a simple Thermostat plug-in. This plug-in will perform certain actions based on events happening at runtime in a remote Java application. Attendants will be guided through the process of creating this plug-in and will furthermore see how easy it is to extend Thermostat in order for it to do what YOU need it to perform.Language: EnglishAudience: Java developers\/Sysadmins","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391772600,"event_start_rfc":"Fri, 07 Feb 2014 12:30:00 +0100","event_end":1391775000,"event_end_rfc":"Fri, 07 Feb 2014 13:10:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"tc and cls_bpf: lightweight packet classifying with BPF","speakers":["Daniel Borkmann"],"description":"This talk will give a walk-through of the traffic control layer and in particular packet classification with cls_bpf, a BPF engine based filter for classful qdiscs. It will walk through starting from iproute2 layer down to the kernel's BPF JIT compiler. Talk is in English.","tags":["Networking"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391772600,"event_start_rfc":"Fri, 07 Feb 2014 12:30:00 +0100","event_end":1391775000,"event_end_rfc":"Fri, 07 Feb 2014 13:10:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"JSF 2.2 deep dive with RichFaces 5","speakers":["Lukas Fryc"],"description":"JavaServer Faces (JSF) is the portion of the Java EE specification that deals with the rendering of web UIs.  A server-side rendering framework, JSF is component centric and nicely encapsulates both visual and non-visual UI elements and provides a health component marketplace.The JSF specification as recently undergone a minor release increment with the release of JSF 2.2.  While not the revolution seen with the release of the 2.0 specification, JSF 2.2 does include some new and sought-after features.  We&rsquo;ll cover these new features discussing: View Actions, Faces Flows, HTML 5 support, improved CDI integration, the FileUpload component, Resource library contract, stateless views, and the new window ID.Taking a use-case based approach we&rsquo;ll see how this laundry list of new features will affect your application development.  Finally we&rsquo;ll look at how the RichFaces component library is leveraging these new capabilities in the upcoming RichFaces 5 release.&nbsp;","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391772600,"event_start_rfc":"Fri, 07 Feb 2014 12:30:00 +0100","event_end":1391775000,"event_end_rfc":"Fri, 07 Feb 2014 13:10:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"OpenShift","speakers":["Marek Jelen","Diane Mueller-Klingspor"],"description":"This talk will be about OpenShift. Learn what is new in the land of PaaS or just learn what PaaS and OpenShift is all about.","tags":["Cloud, Virtualization"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391772600,"event_start_rfc":"Fri, 07 Feb 2014 12:30:00 +0100","event_end":1391775000,"event_end_rfc":"Fri, 07 Feb 2014 13:10:00 +0100","room":"Workshop room L1 - B410","room_short":"L1","room_color":"#729fcf","topic":"Why use a SAT solver for package management?","speakers":["Michael Schroeder"],"description":"The DNF project is scheduled to become the new YUM in&nbsp;Fedora 22. The underlying dependency solver, the libsolv&nbsp;library, uses a satisfiability (SAT) solver to do its work.This talk will give you an understanding of how SAT based&nbsp;dependency solving works and what its advantages compared&nbsp;to traditional approaches are. For example, most solvers&nbsp;will just abort with an error message if a dependency problem&nbsp;has no solution, whereas a SAT based solver allows the&nbsp;automatic generation of solution proposals.This gets even more important when build systems like COPR or OBS gain popularity, as the chances of dependency&nbsp;problems increase with the number of uncoordinated&nbsp;repositories.Another advantage of using a SAT solver is its speed. We&nbsp;will show solver results and timings for some real life&nbsp;examples and do a comparison between YUM and DNF.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391772600,"event_start_rfc":"Fri, 07 Feb 2014 12:30:00 +0100","event_end":1391778000,"event_end_rfc":"Fri, 07 Feb 2014 14:00:00 +0100","room":"Workshop room L2 - C525","room_short":"L2","room_color":"#ef2929","topic":"Extending the Anaconda installer","speakers":["Vratislav Podzimek"],"description":"Do you miss any feature in the Anaconda installer? Or do you think something in the installer is buried too deep for users to find and understand? As of Fedora 19 the Anaconda installer supports extensions, so called addons, that can add extra functionality or make some existing functionality better available, better understandable, etc.","tags":["Desktop"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391775600,"event_start_rfc":"Fri, 07 Feb 2014 13:20:00 +0100","event_end":1391778000,"event_end_rfc":"Fri, 07 Feb 2014 14:00:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"REST API all the things","speakers":["Ivan Necas"],"description":"What do you do when everything has already been invented? You integrate. And of course REST will solve all our problems, right?Having spend two years working on Katello, which is exactly this type of integration project, I would like to share the experience so far. What works, what doesn't, what to be aware of and what doesn't matter.Also, I would like to talk about tools we use for solving the problems that others might be interested in as well.","tags":["Cloud, Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391775600,"event_start_rfc":"Fri, 07 Feb 2014 13:20:00 +0100","event_end":1391778000,"event_end_rfc":"Fri, 07 Feb 2014 14:00:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"Infinispan 6","speakers":["Martin Gencur"],"description":"Infinispan 6 brought a few highly demanded features such as remote querying, fast FileCacheStore implementation, JCache implementation update, and a few more enhancements. This presentation will be an overview of latest features and new scenarios of data storage\/analysis that can be achieved with Infinispan 6.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391775600,"event_start_rfc":"Fri, 07 Feb 2014 13:20:00 +0100","event_end":1391778000,"event_end_rfc":"Fri, 07 Feb 2014 14:00:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"How to use data from static analysers efficiently?","speakers":["Ondrej Vasik"],"description":"There is a lot of static analysers for searching programming issues in various languages - this talk will focus on the most common ones for analyzing C\/C++ - especially CLang, Coverity, Gcc warnings and cppcheck. In this presentation I'm going to cover efficient ways how to get the biggest benefits from using these tools and how to reduce the time spent on reviewing these reports.","tags":["Software Quality"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391775600,"event_start_rfc":"Fri, 07 Feb 2014 13:20:00 +0100","event_end":1391778000,"event_end_rfc":"Fri, 07 Feb 2014 14:00:00 +0100","room":"Workshop room L1 - B410","room_short":"L1","room_color":"#729fcf","topic":"VDSM pluggable networking","speakers":["Antoni Segura Puimedon"],"description":"oVirt's hypervisor component, VDSM (Virtual Desktop and Server Manager) is in charge of leveraging the power of the FOSS OS and virtualization stacks and expose it in an easily consumable API for the Manager component. Up until now, the networking part of it only worked in EL6\/Fedora distributions. In this talk, we'll go through the changes that have happened in networking so that now we are compatible with any GNU\/Linux distribution, and how you can make your own vdsm networking plugin in a few steps.","tags":["Networking, Virtualization"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391775600,"event_start_rfc":"Fri, 07 Feb 2014 13:20:00 +0100","event_end":1391781000,"event_end_rfc":"Fri, 07 Feb 2014 14:50:00 +0100","room":"Workshop room L3 - C511","room_short":"L3","room_color":"#ad7fa8","topic":"Ceylon Hackfest","speakers":["Tomas Hradec"],"description":"Write your first program in Ceylon and familiarize with its various features and tools, or even better make your first contribution into Ceylon's growing ecosystem. If you would like to be prepared, you can find more about this cool new language here http:\/\/ceylon-lang.org, but no previous knowledge is required.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391778600,"event_start_rfc":"Fri, 07 Feb 2014 14:10:00 +0100","event_end":1391781000,"event_end_rfc":"Fri, 07 Feb 2014 14:50:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"OpenStack architecture and deployment","speakers":["Jiří Stránský","Martin Mágr"],"description":"First we'll take a brief look at OpenStack in high level - what parts  it's composed of and what is their purpose.  Then we'll show you how OpenStack works on lower level - how is it  architectured, wired together, and how it's possible that such a huge  mountain of interconnected software doesn't fall apart.Martin will quickly       introduce you Packstack and then show you how you can install       working OpenStack instance using only one command.&nbsp;","tags":["Cloud"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391778600,"event_start_rfc":"Fri, 07 Feb 2014 14:10:00 +0100","event_end":1391781000,"event_end_rfc":"Fri, 07 Feb 2014 14:50:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"DeltaSpike  – CDI extensions of the world, unite!","speakers":["Matous Jobanek","Ron Smeral"],"description":"Several popular CDI extension frameworks like Seam 3 and MyFaces CODI have faded out over the years. But not to worry - their functionality is taken over by projects like Picketlink, Agorava, and mainly DeltaSpike, a new Apache project that wants CDI extension authors to unite in an effort to make the life of web application developers easier. Even without a five year plan!","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391778600,"event_start_rfc":"Fri, 07 Feb 2014 14:10:00 +0100","event_end":1391781000,"event_end_rfc":"Fri, 07 Feb 2014 14:50:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Continous Integration with Open Build Service","speakers":["Adrian Schröter"],"description":"The Open Build Service is a used by Linux based distributions, ISVs and individual developers to generate packages, appliances or installation medias.The Build Service team wants to improve the capabilities to use it also continous integration tool, including automated building and testing. This talk will give an overview what is possible already and what is planned.Also the components of OBS itself will be shown. Parts might become pluggable or merged with fedora based tools. The talk will end with the hope on a good discussion how to collaborate between OBS, openSUSE and Fedora in future.","tags":["Developer, Software Quality"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391778600,"event_start_rfc":"Fri, 07 Feb 2014 14:10:00 +0100","event_end":1391784000,"event_end_rfc":"Fri, 07 Feb 2014 15:40:00 +0100","room":"Workshop room L1 - B410","room_short":"L1","room_color":"#729fcf","topic":"Build your own OpenShift cloud","speakers":["Marek Jelen","Marek Mahut"],"description":"In this lab, we will guide the participants through the installation and&nbsp;configuration process of OpenShift Origin. At the end of the day, they will&nbsp;learn how set up their own OpenShift cluster on-premise or hosted on different&nbsp;cloud provider.Please, bring your own laptops!&nbsp;","tags":["Cloud"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391778600,"event_start_rfc":"Fri, 07 Feb 2014 14:10:00 +0100","event_end":1391784000,"event_end_rfc":"Fri, 07 Feb 2014 15:40:00 +0100","room":"Workshop room L2 - C525","room_short":"L2","room_color":"#ef2929","topic":"Firewalld","speakers":["Thomas Woerner"],"description":"Build work groups for firewalld extensions and integration into other projects.","tags":["Networking, Security"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391781600,"event_start_rfc":"Fri, 07 Feb 2014 15:00:00 +0100","event_end":1391784000,"event_end_rfc":"Fri, 07 Feb 2014 15:40:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"TripleO: Provision your datacenter with OpenStack","speakers":["Ladislav Smola","Imre Farkas"],"description":"TripleO is the official deployment program of OpenStack. It consists of&nbsp;multiple tools, each with its own goal. Diskimage-builder helps you build images from a predefined set of image-elements. Tuskar and Tuskar-UI gives a user interface to register your infrastructure and provision your cloud using Heat. Besides discussing the subprojects and how they work, the talk will walk through the whole process of deploying OpenStack using OpenStack to have a better understanding of the project itself and its goals.","tags":["Cloud"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391781600,"event_start_rfc":"Fri, 07 Feb 2014 15:00:00 +0100","event_end":1391784000,"event_end_rfc":"Fri, 07 Feb 2014 15:40:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"SAML and OAuth comparison","speakers":["Petr Skopek"],"description":"SAML and OAuth are one of the most used protocols\/standards for single sign on of applications.This session will perform comparison and describe use cases of both of them. It will show what we have in JBoss world to offer to the developers in terms of both of them.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391781600,"event_start_rfc":"Fri, 07 Feb 2014 15:00:00 +0100","event_end":1391784000,"event_end_rfc":"Fri, 07 Feb 2014 15:40:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Software Usability Challenge","speakers":["Ondřej Hudlický"],"description":"Usability is one of the basic software quality characteristic. The talk will focus on defining, evaluating, testing, improving and maintaining usability of open source software. There will be specific examples of well and not so well designed UX. Lets focus also on specifics of reporting and triaging the usability issues. At the end there will be discussion about possible \"usability\" checklist for software developers, designers and QE.","tags":["Software Quality"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391781600,"event_start_rfc":"Fri, 07 Feb 2014 15:00:00 +0100","event_end":1391787000,"event_end_rfc":"Fri, 07 Feb 2014 16:30:00 +0100","room":"Workshop room L3 - C511","room_short":"L3","room_color":"#ad7fa8","topic":"Byteman Workshop","speakers":["Andrew Dinn"],"description":"Byteman is a powerful tool for developing sophisticated Java unit and integration tests based on trace and fault injection. Byteman makes it very easy to reproduce unusual test configurations, simulate error conditions and verify detailed execution of the software under test.This session will provide examples of how Byteman can be used to support these different test activities. It will also give you the opportunity for you to bring along your own application and try using Byteman to develop unit or integration tests for it.Byteman is integrated into both TestNG and JUnit. It can be run either from maven, ant or the Java command line.Note for attendees: Please bring your own laptops. You will need JDK7 Java, Maven and ant installed.","tags":["Software Quality"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391784600,"event_start_rfc":"Fri, 07 Feb 2014 15:50:00 +0100","event_end":1391787000,"event_end_rfc":"Fri, 07 Feb 2014 16:30:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"CFME – Managing Your Virtualization Environment and Clouds","speakers":["Martin Povolny"],"description":"Red Hat CloudForms Management Engine offers insight, control and automation for both the cloud and virtualization infrastructure..A brief introduction into the numerous features of the CFME will be presented. General architecture and selected features such as automatic tagging, extensive customizability and integration points will be explained.","tags":["Cloud"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391784600,"event_start_rfc":"Fri, 07 Feb 2014 15:50:00 +0100","event_end":1391787000,"event_end_rfc":"Fri, 07 Feb 2014 16:30:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"What's new in Drools 6 rule engine","speakers":["Marek Winkler"],"description":"Drools 6 is a Business Logic Integration Platform which provides a unified and integrated platform for Rules, Workflow and Event Processing. This talk focuses on major changes in the platform rule engine component called Drools Expert. Version 6.0 introduces new pattern matching algorithm called PHREAK. We give a brief introduction to the previous RETE-OO algorithm, focusing on potential issues which have been addressed by PHREAK. The main ideas of PHREAK algorithm are presented, including examples of problems which can be solved more efficiently than by its predecessor.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391784600,"event_start_rfc":"Fri, 07 Feb 2014 15:50:00 +0100","event_end":1391787000,"event_end_rfc":"Fri, 07 Feb 2014 16:30:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"GNOME Software","speakers":["Richard Hughes"],"description":"In this talk I will present GNOME Software, the application installer for GNOME that first appeared as a technical preview in Fedora 20. I will discuss the feature set of the application, the motivations for building something new, and also explain where we are headed for Fedora 21 and more. I'll quickly explain which technologies and standards that we've leveraged and the things we've deliberately ignored. From Fedora 20, this will be the tool that people will use to install applications, codecs and fonts, but I'll also mention other distributions and the challenges they and us face. I'll end with a plea for help, and explain how both users and developers can help make the application even more awesome. They'll be ample time for questions at the end too.","tags":["Desktop"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391784600,"event_start_rfc":"Fri, 07 Feb 2014 15:50:00 +0100","event_end":1391790000,"event_end_rfc":"Fri, 07 Feb 2014 17:20:00 +0100","room":"Workshop room L1 - B410","room_short":"L1","room_color":"#729fcf","topic":"Create your own collection, how to use COPR","speakers":["Marcela Maslanova"],"description":"Collections can provide several parallel-installable versions of software. After short overview about Software Collections will people learn how to build their own collections. At the workshop will be build simple collection consisting of few packages. People can bring their own collections and ask for help.There will be more presenters experienced in various languages and databases.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391784600,"event_start_rfc":"Fri, 07 Feb 2014 15:50:00 +0100","event_end":1391790000,"event_end_rfc":"Fri, 07 Feb 2014 17:20:00 +0100","room":"Workshop room L2 - C525","room_short":"L2","room_color":"#ef2929","topic":"Save your time with autotest","speakers":["Lukas Doktor","Jiri Zupka"],"description":"This course begins with Autotest* introduction (web UI, server, standalone instance). Then we will show you on a set of examples various framework features, which simplifies and speedups your test development.The biggest advantage of Autotest is a very steep learning curve. Simple \"Hello world\" test which spawns VM and executes \"echo Hello world\" looks like this using Autotest Virt-test:echo Hello worldOf course we will tweak the course according to your needs and skills. We are prepared to spawn tenths of machines, attach thousands of disks and blow your mind with machines migrating across multiple physical machines all thanks to the Autotest framework.* Autotest is a framework for kernel\/virtualization testing with thousands of tests available in upstream","tags":["Software Quality"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391787600,"event_start_rfc":"Fri, 07 Feb 2014 16:40:00 +0100","event_end":1391790000,"event_end_rfc":"Fri, 07 Feb 2014 17:20:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"NUMA aware scheduling","speakers":["Petr Holášek"],"description":"This talk will cover topics regarding news in the NUMA-aware scheduling that have been included since the last year. The presentation will provide some basic and brief introduction to the NUMA architecture and will also describe associated hidden pitfalls of process scheduling and the memory management. The current state of the NUMA-aware scheduling in upstream kernel including used methods &amp; tricks will be also shown. Effects of recent kernel changes will be demonstrated by benchmark results and practical examples.","tags":["Kernel"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391787600,"event_start_rfc":"Fri, 07 Feb 2014 16:40:00 +0100","event_end":1391790000,"event_end_rfc":"Fri, 07 Feb 2014 17:20:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"What's new in OptaPlanner 6","speakers":["Radovan Synek"],"description":"OptaPlanner is a tool for optimization of business resources. The project called Drools Planner in previous versions has been renamed and version 6.0 has been released recently. How has it evolved? This talk gives an overview of new algorithms, improved configuration, easier benchmarking, simply features OptaPlanner offers now to make a developer feel more comfortable.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391787600,"event_start_rfc":"Fri, 07 Feb 2014 16:40:00 +0100","event_end":1391790000,"event_end_rfc":"Fri, 07 Feb 2014 17:20:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"KDE Frameworks","speakers":["Siddharth Sharma","Daniel Vratil"],"description":"In this talk Daniel and Siddhart will look into the future of KDE, explain what KDE Frameworks project is, why it is important and how other projects and developers outside KDE can benefit from it. During the talk they will also look in more depth into several technologies behind KDE and show the latest preview of KDE 5.","tags":["Desktop"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391787600,"event_start_rfc":"Fri, 07 Feb 2014 16:40:00 +0100","event_end":1391790000,"event_end_rfc":"Fri, 07 Feb 2014 17:20:00 +0100","room":"Workshop room L3 - C511","room_short":"L3","room_color":"#ad7fa8","topic":"USB protocol & architecture overview ","speakers":["Gopal Krishna Tiwari"],"description":"1) USB protocol overview.2) USB linux Architecture overview 3) Future of USB (If time permits).","tags":["Kernel"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391790600,"event_start_rfc":"Fri, 07 Feb 2014 17:30:00 +0100","event_end":1391793000,"event_end_rfc":"Fri, 07 Feb 2014 18:10:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"Why Linux on Power Systems?  POWER8!","speakers":["Jeffrey J. Scheel"],"description":"Few people understand the value of running Linux on something other than commodity hardware.  This session will provide a few generalities about Linux on IBM's Power architecture, including details about the coming POWER8 processor.","tags":["Kernel"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391790600,"event_start_rfc":"Fri, 07 Feb 2014 17:30:00 +0100","event_end":1391796000,"event_end_rfc":"Fri, 07 Feb 2014 19:00:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"Lightning talks","speakers":[],"description":"N\/A","tags":[],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391790600,"event_start_rfc":"Fri, 07 Feb 2014 17:30:00 +0100","event_end":1391796000,"event_end_rfc":"Fri, 07 Feb 2014 19:00:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Lightning talks","speakers":[],"description":"N\/A","tags":[],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391793300,"event_start_rfc":"Fri, 07 Feb 2014 18:15:00 +0100","event_end":1391796000,"event_end_rfc":"Fri, 07 Feb 2014 19:00:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"Lightning talks","speakers":[],"description":"N\/A","tags":[],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391797800,"event_start_rfc":"Fri, 07 Feb 2014 19:30:00 +0100","event_end":1391801400,"event_end_rfc":"Fri, 07 Feb 2014 20:30:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"Guided city tour","speakers":[],"description":"Guided city tour (in English). More information at devconf.czTour starts at 19:30 on Ceska street or at 19:10 in front of the venue.","tags":[],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391846400,"event_start_rfc":"Sat, 08 Feb 2014 09:00:00 +0100","event_end":1391848800,"event_end_rfc":"Sat, 08 Feb 2014 09:40:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"What´s up in Kernel-Land","speakers":["Thorsten Leemhuis"],"description":"This presentation gives an overview of recent developments in the Linux kernel world; it among other will discuss what major changes the recent kernel versions brought, what the next kernel version will contain and what the kernel developers are working on for the near future. In that scope the presentation sometimes will also discuss changes in software close to the kernel; that  for example includes Mesa&nbsp;3d, as its OpenGL hardware drivers work closely with the graphics drivers in the Linux kernel.","tags":["Kernel"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391846400,"event_start_rfc":"Sat, 08 Feb 2014 09:00:00 +0100","event_end":1391848800,"event_end_rfc":"Sat, 08 Feb 2014 09:40:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"JGroups","speakers":["Radim Vansa"],"description":"JGroups is a messaging framework which allows developers to create reliable messaging (one-to-one or one-to-many) applications where reliability is a deployment issue, and does not have to be implemented by the application developer.The most powerful feature of JGroups is its flexible protocol stack, which allows developers to adapt it to exactly match their application requirements and network characteristics.The benefit of this is that you only pay for what you use. By mixing and matching protocols, various differing application requirements can be satisfied.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391846400,"event_start_rfc":"Sat, 08 Feb 2014 09:00:00 +0100","event_end":1391848800,"event_end_rfc":"Sat, 08 Feb 2014 09:40:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Cockpit: the Server UI","speakers":["Stef Walter"],"description":"It's no secret that Linux runs much of the Internet, as well as all sorts of infrastructure and servers. In large part that's due to our community, and the great projects we've worked on together.Where we've fallen short, is making these technologies accessible. Non-expert administrators often don't know where to start to make use of the powerful stuff we've put together. This ends up preventing further use of Linux.Enter Cockpit. It aims to be a lightweight, installed out of the box, interface for performing basic monitoring, configuration, and installation on Linux servers.Perfect for bringing new sysadmins to Linux, but we also aim to make repetitive tasks work well for experts, and respect and integrate well with other configuration tools out there, including the terminal.In the talk we'll talk about why the Cockpit project was started, how Cockpit works, including its networking and multi-server aspects, and how you can get involved, try it out. We'll have a demo to show you were things are at, and some discussion of where we're headed.","tags":["Server"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391846400,"event_start_rfc":"Sat, 08 Feb 2014 09:00:00 +0100","event_end":1391848800,"event_end_rfc":"Sat, 08 Feb 2014 09:40:00 +0100","room":"Workshop room L1 - B410","room_short":"L1","room_color":"#729fcf","topic":"Spice, today and tomorrow","speakers":["Marc-André Lureau"],"description":"Spice is a remote desktop protocol, which is used by many projectssuch as RHEV, virt-manager, or GNOME Boxes.During this talk, we will take a look at the new features and fixesthat have been developped since last year around Spice. We will alsotalk about what is cooking, such as native support in openstack, orremote CD mounting. A large part of the talk will be dedicated to thefolder sharing feature and why WebDAV is an interesting protocol.","tags":["Desktop, Virtualization"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391846400,"event_start_rfc":"Sat, 08 Feb 2014 09:00:00 +0100","event_end":1391848800,"event_end_rfc":"Sat, 08 Feb 2014 09:40:00 +0100","room":"Workshop room L2 - C525","room_short":"L2","room_color":"#ef2929","topic":"Disaster Recovery Strategies Using oVirt's new Storage Connection Management Features","speakers":["Allon Mureinik"],"description":"oVirt 3.3 introduces new capabilities to manage the system's storage connections. Although these capabilities were originally designed as a management feature for migrating storage domain between physical machines, they can be leveraged for disaster recovery scenarios, allowing deployment of more reliable, resistant oVirt deployments.In this session I'll cover:* Storage concepts in oVirt - Storage Domain vs. Storage Server Connection* oVirt 3.3's new APIs and capabilities (REST and GUI)* Designing a Disaster Recovery (DR) solution for oVirt's storage.","tags":["Cloud, Virtualization"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391849400,"event_start_rfc":"Sat, 08 Feb 2014 09:50:00 +0100","event_end":1391851800,"event_end_rfc":"Sat, 08 Feb 2014 10:30:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"Advanced Features of File System and Storage","speakers":["Lukas Czerner"],"description":"While everybody is still excited about btrfs, eagerly awaiting it's readiness for production, other local file systems are implementing some of the advanced features required by production while also trying to cope with new Storage capabilities.In this talk I would like discuss some of the interesting new features recently implemented or still in development in our most important local file systems in Linux kernel. Give some examples and describe how can we benefit from it even more when taking advantage of storage capabilities. And also how to improve support for advanced types of storage from withinthe file systems.In short I'll try to touch topics regarding data and metadata checksumming, file level and block level snapshotting, thin provisioning, user-guided allocation and possibly some of the newer types of storage such as non-volatile memory or hybrid drives.","tags":["Kernel, Storage"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391849400,"event_start_rfc":"Sat, 08 Feb 2014 09:50:00 +0100","event_end":1391851800,"event_end_rfc":"Sat, 08 Feb 2014 10:30:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"Shenandoah GC","speakers":["Pavel Tisnovsky"],"description":"Automatic memory management frees Java programmers from having to think about malloc and free, but choosing the wrong GC algorithm can significantly hurt the overall JVM performance. In this talk the new GC named Shenandoah will be discussed. Shenandoah, which is being developed at Red Hat, is an ultra-low pause time collection algorithm targeting sub 10ms pause times for 100+GB heaps. The goal of this project is to reduce GC pause times on extremely large heaps and make pause times independent from the heap size.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391849400,"event_start_rfc":"Sat, 08 Feb 2014 09:50:00 +0100","event_end":1391851800,"event_end_rfc":"Sat, 08 Feb 2014 10:30:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"System Security Customer Style","speakers":["Russ Doty"],"description":"Major customers deploying Linux have surprisingly consistent approaches to how they deal with security. This talk gives an overview of customer security approaches, the challenges and constraints they face, how they use various Linux security capabilities, and common requests. We will address core customer needs and expectations and map them back to implications for Red Hat.Traditional security software is only one part of the solution. We will show how to address these customer needs through an integrated approach based on risk analysis and risk mitigation that includes software, business processes, policies, procedures, and people.&nbsp;","tags":["Security"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391849400,"event_start_rfc":"Sat, 08 Feb 2014 09:50:00 +0100","event_end":1391851800,"event_end_rfc":"Sat, 08 Feb 2014 10:30:00 +0100","room":"Workshop room L1 - B410","room_short":"L1","room_color":"#729fcf","topic":"rsyslog","speakers":["Rainer Gerhards"],"description":"Rsyslog has undergone considerable change in the past year. Now with a very strong enterprise focus, it gained additional security properties with strong encryption, signatures and the ability to anonymize log files. Also, the upcoming version 8 provides strong new features and scalability and performance enhancements.This talk will describe the new features, why they were introduced and how they are implemented. Most importantly, the new v8 engine and output module interface will be described. The interface has totally been revamped and plugin authors need to abide to the new interface in order to be compatible with v8. We also describe why this hard requirement was placed on plugins ... and how easy it usually is to convert v7 plugins.","tags":["Admin"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391849400,"event_start_rfc":"Sat, 08 Feb 2014 09:50:00 +0100","event_end":1391851800,"event_end_rfc":"Sat, 08 Feb 2014 10:30:00 +0100","room":"Workshop room L2 - C525","room_short":"L2","room_color":"#ef2929","topic":"IPython","speakers":["Tom Tomecek"],"description":"IPython is a rich platform for interactive computing. It consists of several modules such as interactive shell, data visualisation, browser based notebook and much more. I would like to present the interactive shell: what features it has and how it can be helpful when developing some python code.","tags":["Fedora"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391849400,"event_start_rfc":"Sat, 08 Feb 2014 09:50:00 +0100","event_end":1391851800,"event_end_rfc":"Sat, 08 Feb 2014 10:30:00 +0100","room":"Workshop room L3 - C511","room_short":"L3","room_color":"#ad7fa8","topic":"Design for Cloud by Elasticsearch","speakers":["Jan Kral"],"description":"I would like to demonstrate some of the features of Elasticsearch that were designed with a cloud environment in mind. The talk will cover basic design principles as well as concrete examples and strategies from our users and how they differ from deployments on physical hardware. If we have additional time we will look at how to deal with heterogeneous environments.","tags":["Cloud"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391852400,"event_start_rfc":"Sat, 08 Feb 2014 10:40:00 +0100","event_end":1391854800,"event_end_rfc":"Sat, 08 Feb 2014 11:20:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"LVM thin provisioning news","speakers":["Zdeněk Kabeláč"],"description":"Introduce new features for thin provisioning, show how the recovery of thin pool works.&nbsp;Possibly say few words about some other new targets and how they work together.","tags":["Kernel, Storage"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391852400,"event_start_rfc":"Sat, 08 Feb 2014 10:40:00 +0100","event_end":1391854800,"event_end_rfc":"Sat, 08 Feb 2014 11:20:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"The Kotlin Programming Language","speakers":["Ladislav Thon"],"description":"A lot of people in the Java community has been long longing for some kind of a \"Java.next\" language, a language that will be modern yet keep the design spirit. There is a lot of more or less suitable candidates -- let's take a brief look at some of them and then examine Kotlin in more detail. Kotlin comes from JetBrains, a company with more than 10 years of experience developing industry-leading developer tools and therefore pretty unique perspective on language design. We'll take a look at some of the more interesting features: null-safety and other nice little things in the type system, language-supported delegation, lambdas, extension methods and DSL support. Few words about Java interop too.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391852400,"event_start_rfc":"Sat, 08 Feb 2014 10:40:00 +0100","event_end":1391854800,"event_end_rfc":"Sat, 08 Feb 2014 11:20:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Anatomy of kdbus","speakers":["Lennart Poettering","Kay Sievers"],"description":"In contrast to later OS designs Unix\/Linux since its beginning has not provided a standardized, high-level IPC system as part of its system APIs. It has provided various primitives such as AF_UNIX sockets, FIFOs, and various forms of shared memory and synchronization facilities, but it always lacked an established mechanisms for secure, introspectable, standardized local RPC with multicasting signalling. Various attempts have been made to build such a system on top of the available primitives, the most important and successful project being D-Bus. D-Bus brought standardization and introspectability however being designed for exchanging control messages only, brings serious performance issues when it is used to deliver payload.In this talk we'll discuss \"kdbus\", our attempt to move D-Bus into the kernel layer, to make it truly universal, and how it is integrated into systemd and its APIs. kdbus brings scalabale, secure, high performance IPC on the kernel level, while staying compatible with classic D-Bus in most ways. From the beginning it has been designed to provide single-copy and zero-copy communication, and namespacing and sandboxing has been designed into it from the beginning.When designing \"kdbus\" we took a lot of inspiration from IPC systems in the Operating Systems, including most importantly Android Binder, Mach Ports, Solaris Doors, and QNX IPC, which we will cover in this talk too.","tags":["Kernel, Userspace"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391852400,"event_start_rfc":"Sat, 08 Feb 2014 10:40:00 +0100","event_end":1391857800,"event_end_rfc":"Sat, 08 Feb 2014 12:10:00 +0100","room":"Workshop room L1 - B410","room_short":"L1","room_color":"#729fcf","topic":"DNF API","speakers":["Ales Kozumplik"],"description":"Introduction into the DNF API, the philosophy behind it, its evolution from Yum. Then a lab where people can try to build whatever DNF plugin they fancy (they ideally will have one in mind before coming to the talk).During the lab, more information will be available at&nbsp;akozumpl.fedorapeople.org\/devconf2014. It's best if you bring a computer with Fedora 20 installed. A virtual machine image (KVM) will be provided in case you don't run Fedora.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391852400,"event_start_rfc":"Sat, 08 Feb 2014 10:40:00 +0100","event_end":1391857800,"event_end_rfc":"Sat, 08 Feb 2014 12:10:00 +0100","room":"Workshop room L2 - C525","room_short":"L2","room_color":"#ef2929","topic":"Introduction to MongoDB","speakers":["Honza Horak"],"description":"Practical introduction to the most used NoSQL database, MongoDB, is intended for programmers who don't have experiences with MongoDB yet. After the lab, attendees will understand the concept and differences from relational databases, will be able to design a MongoDB database and write an application in Python, which works with MongoDB.","tags":["Databases"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391852400,"event_start_rfc":"Sat, 08 Feb 2014 10:40:00 +0100","event_end":1391857800,"event_end_rfc":"Sat, 08 Feb 2014 12:10:00 +0100","room":"Workshop room L3 - C511","room_short":"L3","room_color":"#ad7fa8","topic":"JBoss Developer","speakers":["Marek Schmidt"],"description":"Whether you are a Java developer wanting to learn more about JBoss or a web developer wanting to see what the \"Java EE\" is about, JBoss Developer framework is here to show you how to write applications using JBoss technologies. In this hands-on demo we will show you how easy it is to start with Java EE development the JBoss Way. We will cover using JBoss Developer Studio to start with a quickstart, scaffolding in Forge, testing the application with Arquillian, building a mobile-friendly user interface and finally deploying to OpenShift.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391855400,"event_start_rfc":"Sat, 08 Feb 2014 11:30:00 +0100","event_end":1391857800,"event_end_rfc":"Sat, 08 Feb 2014 12:10:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"Persistent Memory: What Changes When DRAM is all We Need?","speakers":["Ric Wheeler"],"description":"Persistent memory is a class of storage that is similar to DRAM in terms of performance, speed and cost. The major change is that it does not lose its state when power is lost. These technologies exist today in the market and will be coming into broad use over the next few years.This presentation will give some details of what work is going on in the kernel to prepare file and storage systems for keeping up with the demands of this new technology. New file systems, performance tuning of the existing stack and proposals around how applications will need to change will all be discussed.","tags":["Kernel, Storage"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391855400,"event_start_rfc":"Sat, 08 Feb 2014 11:30:00 +0100","event_end":1391857800,"event_end_rfc":"Sat, 08 Feb 2014 12:10:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"Selected targets of OpenJDK 9 or from six to tomorrow","speakers":["Jiri Vanek"],"description":"About lifecycle of OpenJDK, path from 6 to 9 and selected features of 8 and 9. Features of eight are already well known and were presented last year, but can be included. On the other side, features of nine  - except jigsaw,  shnenadonah GC, grail, and  hotpost for aarch64 - are more or less misery.Lifecycle itself will include its evolution from 6 to 9, individual repos, role of icedtea, components like icedtea web or thermosat..., delays, oracle  as usptream, CPU path","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391855400,"event_start_rfc":"Sat, 08 Feb 2014 11:30:00 +0100","event_end":1391857800,"event_end_rfc":"Sat, 08 Feb 2014 12:10:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Inside Scoop on Attacks on Public Key Crypto Systems.","speakers":["Robert Relyea"],"description":"This talk will outline several known and potential attacks agains RSA, D-H\/DSA, and ECC crypto systems, including 1) factoring techniques and the thin line that keeps factoring hard. 2) the math reason for what DH\/DSA need longer keys than ECC for the same strenght. 3) how does the ECC DRBG back door work.Talk will include the basic number theory behind the algorithms and the attacks.","tags":["Security"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391859000,"event_start_rfc":"Sat, 08 Feb 2014 12:30:00 +0100","event_end":1391861400,"event_end_rfc":"Sat, 08 Feb 2014 13:10:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"Virtual vs physical machines","speakers":["Karen Noel"],"description":"Application developers, SW engineers and test designers have found virtual machines in the data-center and now in the cloud to be a powerful, cheap and efficient source of compute resources. But, what is the difference between a VM and real HW? And, why should you care? In this talk, we will explore the differences between virtual and physical machines, understand when software needs to know it's virtualized and what developers and testers should do differently to accommodate both virtual and physical environments.","tags":["Virtualization"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391859000,"event_start_rfc":"Sat, 08 Feb 2014 12:30:00 +0100","event_end":1391861400,"event_end_rfc":"Sat, 08 Feb 2014 13:10:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"Functional testing of web and Android applications with Arquillian Graphene and Droidium","speakers":["Juraj Huska","Stefan Miklosovic"],"description":"How do you test your applications, both web and Android ones, in a functional way? Not yet? Big mistake! With the existence of Graphene and Droidium tooling from Arquillian universe, you are able to test them very conveniently. First part of the talk will give you the hottest goodies from Arquillian Graphene which appeared in the latest Final release while in the second part, you will get know Arquillian Droidium. Droidium is new tool from Arquillian platform which enables you to use Graphene for web and native Android applications. We will show you its main features, how to use it and how to write tests in a Graphene way.Language: english (US)","tags":["Software Quality"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391859000,"event_start_rfc":"Sat, 08 Feb 2014 12:30:00 +0100","event_end":1391861400,"event_end_rfc":"Sat, 08 Feb 2014 13:10:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Extending FreeIPA","speakers":["Petr Viktorin"],"description":"This talk will cover what to do and what to keep in mind when writing plugins for FreeIPA, from designing the LDAP schema and security considerations to testing and the development processes to follow.","tags":["Security, Server"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391859000,"event_start_rfc":"Sat, 08 Feb 2014 12:30:00 +0100","event_end":1391864400,"event_end_rfc":"Sat, 08 Feb 2014 14:00:00 +0100","room":"Workshop room L1 - B410","room_short":"L1","room_color":"#729fcf","topic":"Deploying OpenShift","speakers":["Marek Jelen","Diane Mueller-Klingspor"],"description":"Come and get OpenShift. OpenShift is a PaaS by Red Hat. OpenShift can help you to stream-line your deployments, being it development, testing or production. In the lab we shall learn how you can deploy your own instance of OpenShift and after the lab you will be able to benefit from all the project.","tags":["Cloud, Virtualization"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391859000,"event_start_rfc":"Sat, 08 Feb 2014 12:30:00 +0100","event_end":1391861400,"event_end_rfc":"Sat, 08 Feb 2014 13:10:00 +0100","room":"Workshop room L2 - C525","room_short":"L2","room_color":"#ef2929","topic":"Making the X-server run without root rights","speakers":["Hans de Goede"],"description":"Xorg (the X-server) is a big and complex beast. Currently it runs as root as it need root rights for various reasons. But with the latest systemd-logind all necessary infra is in place to allow the server to run as a normal user and use systemd-logind to doinput and  graphics device management.This talk looks at the work being done to leverage this new infrastructure to run Xorg without root rights.","tags":["Desktop"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391859000,"event_start_rfc":"Sat, 08 Feb 2014 12:30:00 +0100","event_end":1391864400,"event_end_rfc":"Sat, 08 Feb 2014 14:00:00 +0100","room":"Workshop room L3 - C511","room_short":"L3","room_color":"#ad7fa8","topic":"Getting Started with SwitchYard","speakers":["Andrej Podhradsky"],"description":"SwitchYard is a service delivery framework for service-oriented applications. In this lab you will learn1. The structure and layout of SwitchYard2. How to implement service logic and configure service bindings3. How to configure transformations4. How to test SwitchYard services","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391862000,"event_start_rfc":"Sat, 08 Feb 2014 13:20:00 +0100","event_end":1391864400,"event_end_rfc":"Sat, 08 Feb 2014 14:00:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"Thin provisioning in the KVM virtualization stack","speakers":["Paolo Bonzini"],"description":"QEMU, the virtual machine monitor typically used with KVM, has long supported thin provisioning through both sparse raw files and the qcow2 image format. However, for thin provisioning to help both virtual machine users and host administrators, it must be supported throughout the whole virtualization stack: the guest (userspace and kernel), the host (QEMU, management interface, kernel), the storage itself. This talk will show how we implemented thin provisioning in all these layers and how the results benefit our users.","tags":["Virtualization"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391862000,"event_start_rfc":"Sat, 08 Feb 2014 13:20:00 +0100","event_end":1391864400,"event_end_rfc":"Sat, 08 Feb 2014 14:00:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"Mutation testing: how good your tests really are?","speakers":["Marcin Zajączkowski"],"description":"Standard code coverage analysis provides insight into execution paths exercised by a testing scheme. Mutation testing takes this notion a step further and offers a deep down investigation (through code modification or removal) of the impact each line of production code makes on the whole test. This approach has been known for over 30 years circling mainly within academic communities and only recently has it been rediscovered and introduced to the benefit of commercial solutions. Mutation testing technique which focuses on partitioning the code on per line basis with regards to influence on the logic put under test provides actual (as opposed to artificial and synthetic) view on tests quality.The presentation will provide solutions and answers to the following: \r\n\r\nWhat is mutation testing?\r\nWhy use it?\r\nLimitations and drawbacks\r\nWhy only now does it start to get traction?\r\nHow to prepare your project for mutation testing?\r\nIs there a case for it in the enterprise?&nbsp;\r\n\r\nThis presentation is meant for software development-involved individuals who want to learn more about mutation testing, what advantages over traditional coverage scheme it offers and how to apply the idea to their existing codebase. Although not required, some knowledge on test automation and coverage would be beneficial to the attendee.The introduction to mutation testing will be language agnostic. Presented tools can be used only with Java code.&nbsp;","tags":["Software Quality"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391862000,"event_start_rfc":"Sat, 08 Feb 2014 13:20:00 +0100","event_end":1391864400,"event_end_rfc":"Sat, 08 Feb 2014 14:00:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Gluing software stacks with Identity Management technologies","speakers":["Dmitri Pal"],"description":"During last year identity management team conducted assessment of several different projects: OpenShift, OpenStack, oVirt, Foreman as well as products built using those technologies. The research revealed common patterns of how identity management can be integrated and what value it can provide. The talk will focus on describing these patterns and showing what projects and stacks can do to accomplish better security and user experience leveraging identity management integration.","tags":["Security, Server"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391862000,"event_start_rfc":"Sat, 08 Feb 2014 13:20:00 +0100","event_end":1391864400,"event_end_rfc":"Sat, 08 Feb 2014 14:00:00 +0100","room":"Workshop room L2 - C525","room_short":"L2","room_color":"#ef2929","topic":"Vulnerability management and security compliance by SCAP","speakers":["Peter Vrabec","Jan Lieskovsky"],"description":"Security compliance is conformance to security requirements that are usually defined either by industry standards (USGCB, DISA STIG, PCI DSS) or custom policies specified by an organization itself. Unfortunately reaching the compliance is not that easy. Some of the issues users may run into are: * lack of a security guidances, checklists, and associated validation mechanisms * lack of high quality (as in certified) scanners - auditing tools * difficulties with security profiles customization * missing remediation capability in current standards (remediation allow users to alter system configuration in order to put system into compliance) * integration with system management solutions that can facilitate monitoring and reportingIn this talk we will introduce various components (scanner, data, installer and systems management solution) that comes into play when we deal with these kind of challenges. We will also describe work-flow these components have established and we will show you where and how you can start contributing in order to make the security compliance more suitable for your needs. Our main focus will be on contribution to the compliance requirements repository which is hosted by the scap-security-guide project.","tags":["Security"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391865000,"event_start_rfc":"Sat, 08 Feb 2014 14:10:00 +0100","event_end":1391867400,"event_end_rfc":"Sat, 08 Feb 2014 14:50:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"KVM and CPU feature enablement","speakers":["Eduardo Habkost"],"description":"You just got a brand new CPU and you want your Virtual Machines to use the shiny new features in that new CPU, what is necessary to make that happen?In this talk, I plan to present the low-level details and all the layers involved to make sure new CPU features are available for KVM guest OSes, starting from the hardware itself, the KVM kernel code, QEMU, libvirt, and management systems that let the user configure virtual machines. I plan to explain how this affects KVM features like live migration, command-line compatibility, and Stable Guest ABI.","tags":["Virtualization"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391865000,"event_start_rfc":"Sat, 08 Feb 2014 14:10:00 +0100","event_end":1391867400,"event_end_rfc":"Sat, 08 Feb 2014 14:50:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"PerfCake: Server application performance under control","speakers":["Pavel Macík","Martin Vecera"],"description":"Introduction of a new generation performance testing tool PerfCake. It is a lightweight performance testing tool and a load generator with the aim to be minimalistic, easy to use, provide stable results, have minimum influence on the measured system, be platform independent, use component design, allow high throughput. In this presentation we will build a simple example that introduces PerfCake's features and we will measure performance of a server application.","tags":["Software Quality"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391865000,"event_start_rfc":"Sat, 08 Feb 2014 14:10:00 +0100","event_end":1391867400,"event_end_rfc":"Sat, 08 Feb 2014 14:50:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Lost in Translation","speakers":["Simo Sorce"],"description":"The talk will try to explain in very high level terms the key aspects of the Kerberos protocol with particular focus on the most common pitfalls engineers fall into when they need to use it. The presentation will focus on the needs of the developer, including what APIs to use and avoid, how to structure their applications to be Kerberos ready, and how to deal with obscure topics like names in the Kerberos and GSSAPI world in a sane manner.","tags":["Security"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391865000,"event_start_rfc":"Sat, 08 Feb 2014 14:10:00 +0100","event_end":1391867400,"event_end_rfc":"Sat, 08 Feb 2014 14:50:00 +0100","room":"Workshop room L1 - B410","room_short":"L1","room_color":"#729fcf","topic":"Syscall Filtering and You","speakers":["Paul Moore"],"description":"With the inclusion of the seccomp filter functionality in Linux 3.5, Linux has a very powerful system call filter engine built into the kernel.  Unfortunately, leveraging this new security tool can be difficult without some introduction.  This presentation will explain the basics behind the Linux syscall filter, including the security advantages it can provide to different types of applications.  The talk will also introduce libseccomp and explain how it solves many of the problems facing application developers who wish to make use of the Linux syscall filter.  Finally, the talk will present a number of areas where interested developers can help contribute: the libseccomp project itself, userspace applications, and the Linux Kernel.","tags":["Kernel, Security"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391865000,"event_start_rfc":"Sat, 08 Feb 2014 14:10:00 +0100","event_end":1391870400,"event_end_rfc":"Sat, 08 Feb 2014 15:40:00 +0100","room":"Workshop room L2 - C525","room_short":"L2","room_color":"#ef2929","topic":"USB reverse engineering workshop","speakers":["Hans de Goede"],"description":"Even though most USB devices will just work with Linux now a days, every now and then there is still a USB device which does not work and needs to have its USB protocol reverse-engineered. Or which needs some reverse engineering of ie custom HID reports to be able to fully use all its functionality (think usb keyboards\/mice\/joysticks with special functions such as an lcd display).This workshop will teach participants the basics of reverse engineer USB protocols, which is the first step to adding Linux support for such devices.Preparation:Participants should have:1) An USB- device they want to reverse engineer the USB-protocol for2) A laptop with a recent Linux on it, as well as a windows vm on top of Linux to run the software for said USB device","tags":["Kernel"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391865000,"event_start_rfc":"Sat, 08 Feb 2014 14:10:00 +0100","event_end":1391870400,"event_end_rfc":"Sat, 08 Feb 2014 15:40:00 +0100","room":"Workshop room L3 - C511","room_short":"L3","room_color":"#ad7fa8","topic":"Free Java EE web app hosting","speakers":["Ondrej Zizka"],"description":"Creating an OpenShift account,creating a JBoss EAP 6 host,creating a simple app,deploying to OpenShift,being awesome.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391868000,"event_start_rfc":"Sat, 08 Feb 2014 15:00:00 +0100","event_end":1391870400,"event_end_rfc":"Sat, 08 Feb 2014 15:40:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"oVirt","speakers":["Antoni Segura Puimedon"],"description":"As the prominent open-source data center virtualization solution, oVirtrelies on a powerful and easy approach to configuring a data center'snetwork. By leveraging the advanced network capabilities offered byNeutron, the OpenStack Networking project, oVirt's maintainers aim tobring this field even further, allowing data center administrators touse advanced capabilities while maintaining the simplicity of oVirt'snetwork management approach. Join us in this session, and discoverhow oVirt currently leverages Neutron and the road-map to future networkvirtualization in the Data Center.","tags":["Networking, Virtualization"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391868000,"event_start_rfc":"Sat, 08 Feb 2014 15:00:00 +0100","event_end":1391870400,"event_end_rfc":"Sat, 08 Feb 2014 15:40:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"Searchisko","speakers":["Vlastimil Elias","Lukas Vlcek"],"description":"We will introduce Searchisko - an open source project that was designed to power new kind of services provided by jboss.org development team. In could be described as a community centric full-text search and content delivery service with REST API. It is built on top of Elasticsearch - which we will talk about as well.URL: https:\/\/github.com\/searchisko\/searchisko","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391868000,"event_start_rfc":"Sat, 08 Feb 2014 15:00:00 +0100","event_end":1391870400,"event_end_rfc":"Sat, 08 Feb 2014 15:40:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Secure Linux Containers","speakers":["Dan Walsh"],"description":"This talk will cover the latest work in Container development. How we are integrating with SELinux, CGroups, Libvirt and Namespaces.","tags":["Security"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391868000,"event_start_rfc":"Sat, 08 Feb 2014 15:00:00 +0100","event_end":1391870400,"event_end_rfc":"Sat, 08 Feb 2014 15:40:00 +0100","room":"Workshop room L1 - B410","room_short":"L1","room_color":"#729fcf","topic":"VIRTIO 1.0: Paravirtualized I\/O devices for KVM and beyond","speakers":["Stefan Hajnoczi"],"description":"Virtio devices provide high-performance, paravirtualized I\/O to virtualmachines under KVM and other hypervisors. Virtio offers an extensible and openalternative to emulating proprietary hardware. Virtio is also finding useoutside its traditional virtualization role as a way to provide device accesson new hardware architectures.This talk covers the VIRTIO 1.0 specification which is currently undergoing thestandardization process. It offers new performance improvements, integratesadditional hardware transports, and eliminates earlier design mistakes.The talk gives an overview of the virtio device model and design decisions inthe upcoming VIRTIO 1.0 specification. Developers and anyone interested invirtualization will gain an appreciation for how data is transported fromvirtual machines to physical disks or network adapters.","tags":["Virtualization"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391871000,"event_start_rfc":"Sat, 08 Feb 2014 15:50:00 +0100","event_end":1391873400,"event_end_rfc":"Sat, 08 Feb 2014 16:30:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"Centralized logging with logstash","speakers":["Jan Kral"],"description":"In this talk I would like to demonstrate centralized logging using Logstash, Elasticsearch and Kibana. I will cover setting up the log shipper and storage as well as customizing the dashboard. All will be shown on real life use cases.It's an overview talk about the advantages of centralized logging, possibility of deploying logstash for that purpose and demonstration.","tags":["Cloud, Security"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391871000,"event_start_rfc":"Sat, 08 Feb 2014 15:50:00 +0100","event_end":1391873400,"event_end_rfc":"Sat, 08 Feb 2014 16:30:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"Aspect-oriented User Interface design","speakers":["Tomas Cerny"],"description":"Contemporary user interface (UI) design tangles multiple different interests together, which results in increased efforts of its development and maintenance. In addition, information captured in backend parts of the system is being restated in the UI part, which negatively impacts maintenance and may cause its inconsistency. In this talk we present aspect-driven approach that suggests separating various UI interests and concerns, and enables their reuse among the system. This runtime approach allows us to reduce development and maintenance efforts, mitigate inconsistency errors, and to build low effort adaptive UIs. Our open-source framework is deployed in production at Java EE 6 application at ACM-ICPC system. We present benefits of this concept, experiences received from its production use and impact on system maintenance.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391871000,"event_start_rfc":"Sat, 08 Feb 2014 15:50:00 +0100","event_end":1391873400,"event_end_rfc":"Sat, 08 Feb 2014 16:30:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Porting the Linux Kernel","speakers":["Kyle McMartin"],"description":"A tour of Linux portability, the how, what, why and where of dealing with a code base that can be built on dozens of platforms at the same time. Issues necessary for porting both userspace and kernel code will be addressed, as well as a brief discussion about various quirks of common architectures Linux is seen on such as ARM, X86, PPC64 and S390.","tags":["Kernel"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391871000,"event_start_rfc":"Sat, 08 Feb 2014 15:50:00 +0100","event_end":1391876400,"event_end_rfc":"Sat, 08 Feb 2014 17:20:00 +0100","room":"Workshop room L1 - B410","room_short":"L1","room_color":"#729fcf","topic":"Building an SELinux Security Manager","speakers":["Dan Walsh"],"description":"This topic will cover building an SELinux Security Manager using libselinux.","tags":["Security"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391871000,"event_start_rfc":"Sat, 08 Feb 2014 15:50:00 +0100","event_end":1391876400,"event_end_rfc":"Sat, 08 Feb 2014 17:20:00 +0100","room":"Workshop room L2 - C525","room_short":"L2","room_color":"#ef2929","topic":"JHackFest","speakers":["Lukas Fryc"],"description":"If you are an open-source hacker and you love technologies based on Java Virtual Machine, don&rsquo;t miss an opportunity to hack on some your ideas or join others in building something interesting in this small hackfest we organize a third year in a row.OrganizationNo organization!&nbsp;Let&rsquo;s come with your ideas in mind and we will all try hard to give them a live together!Entry LevelThere is no prior expertise needed, the hackfest is targeted on everyone who wants to contribute and might not even know yet how to get there.StepsEveryone will be able to find something what he can contribute to, and together we can achieve given goals more easily.IdeasLet&rsquo;s do not collect ideas beforehand - we will write them down to the whiteboard instead. You can still reach me at @lfryc or during the conference if you have some questions. We are all eagerly looking forward to the event, so don&rsquo;t hesitate! Come and join us!History of JHackfest2014Invitation: http:\/\/lukas.fryc.eu\/blog\/2014\/01\/j-hackfest-jvm-languages-frameworks-tools.html2013Event: http:\/\/lukas.fryc.eu\/blog\/2013\/02\/jhackfest.htmlArquillian-specific part: http:\/\/arquillian.org\/blog\/2013\/02\/16\/devconf-hackfest\/2012Wrap-up: http:\/\/lukas.fryc.eu\/blog\/2012\/02\/wrap-up-arquillian-hackfest-developer.htmlInvitation: https:\/\/plus.google.com\/109501071933862146039\/posts\/dyo3hU9smcj","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391871000,"event_start_rfc":"Sat, 08 Feb 2014 15:50:00 +0100","event_end":1391876400,"event_end_rfc":"Sat, 08 Feb 2014 17:20:00 +0100","room":"Workshop room L3 - C511","room_short":"L3","room_color":"#ad7fa8","topic":"OpenLMI for administrators","speakers":["Jan Safranek"],"description":"Practical hands-on session. The audience would get a chance to try out the system  management tools developed under the OpenLMI umbrella: Installation and configuration, basic tasks, LMI Shell, the LMI modules and metacommand. There will also be a brief introduction on how to develop own system management tools using the LMI modules","tags":["Developer, Server"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391874000,"event_start_rfc":"Sat, 08 Feb 2014 16:40:00 +0100","event_end":1391876400,"event_end_rfc":"Sat, 08 Feb 2014 17:20:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"DDoS protection using Netfilter\/iptables","speakers":["Jesper Dangaard Brouer"],"description":"Can Netfilter\/iptables really be used for DDoS attack protection?  I though it was too slow for that.In this talk I will present the recent developement, for mitigating DDoS attacks using Netfilter\/iptables, the Linux kernels firewall facility.  The talk will cover the recent SYNPROXY modul and other less know techniques, and the needed kernel parameter tuning.","tags":["Networking"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391874000,"event_start_rfc":"Sat, 08 Feb 2014 16:40:00 +0100","event_end":1391876400,"event_end_rfc":"Sat, 08 Feb 2014 17:20:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"Integration with jBPM 6","speakers":["Jiří Sviták"],"description":"The presentation will firstly summarize new features in jBPM 6 business  process suite. jBPM integration possibilities will be demonstrated on  examples - jBPM engine embedded in a web application and remote access  to jBPM execution server.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391874000,"event_start_rfc":"Sat, 08 Feb 2014 16:40:00 +0100","event_end":1391876400,"event_end_rfc":"Sat, 08 Feb 2014 17:20:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Arduino Leonardo + Linino = Arduino Yún","speakers":["Stepan Bechynsky"],"description":"Arduino introduced new board Arduino Y&uacute;n. This boeard combines traditional Arduino board with small Linux computer embedded on it. Arduino part typically is responsible for sensors and actuators and Linux part is responsible for communication. You will see how to use this combination in practical examples. And you will see similar board Intel Galileo.","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391877000,"event_start_rfc":"Sat, 08 Feb 2014 17:30:00 +0100","event_end":1391882400,"event_end_rfc":"Sat, 08 Feb 2014 19:00:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"Lightning talks","speakers":[],"description":"N\/A","tags":[],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391877000,"event_start_rfc":"Sat, 08 Feb 2014 17:30:00 +0100","event_end":1391882400,"event_end_rfc":"Sat, 08 Feb 2014 19:00:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"Lightning talks","speakers":[],"description":"N\/A","tags":[],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391877000,"event_start_rfc":"Sat, 08 Feb 2014 17:30:00 +0100","event_end":1391882400,"event_end_rfc":"Sat, 08 Feb 2014 19:00:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Lightning talks","speakers":[],"description":"N\/A","tags":[],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391882400,"event_start_rfc":"Sat, 08 Feb 2014 19:00:00 +0100","event_end":1391886000,"event_end_rfc":"Sat, 08 Feb 2014 20:00:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"Red Hat sponsored party @ Fleda!","speakers":[],"description":"Don't forget to pick your entrance ticket at Red Hat booth! More information at devconf.cz","tags":[],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391932800,"event_start_rfc":"Sun, 09 Feb 2014 09:00:00 +0100","event_end":1391935200,"event_end_rfc":"Sun, 09 Feb 2014 09:40:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"glibc network name resolution issues, solutions and alternatives","speakers":["Pavel Simerda"],"description":"I've been researching various issues in name resolution an the getaddrinfo() function for quite some time. Now we're coming up with an alternative implementation and API. With this new project, we target multiple goals. While the original motivation was to provide a framework to test and eventually resolve glibc getaddrinfo() issues, we're now coming up with a bunch of new use cases including standalone use for asynchronous address resolution and replacing any application's getaddrinfo() call for testing purposes using a wrapper program.","tags":["Networking"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391932800,"event_start_rfc":"Sun, 09 Feb 2014 09:00:00 +0100","event_end":1391935200,"event_end_rfc":"Sun, 09 Feb 2014 09:40:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Fedora.next: Future of Fedora Big Picture, plus Working Group report","speakers":["Matthew Miller"],"description":"Fedora.next is an umbrella phrase for the shape of Fedora in the post-F20 future. This talk will cover what exactly that means and how it's shaping up, including the \"Fedora Rings\" and \"Three Products\" proposals, and reports on the status of the new Fedora working groups.","tags":["Fedora"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391935800,"event_start_rfc":"Sun, 09 Feb 2014 09:50:00 +0100","event_end":1391938200,"event_end_rfc":"Sun, 09 Feb 2014 10:30:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"fedmsg","speakers":["Ralph Bean"],"description":"Description-----------In the Fedora Infrastructure team, we developed a realtime messaging layer&nbsp;on top of 0MQ to send and receive messages to and from our many and varied&nbsp;services.  Debian Infrastructure has adopted it as well laying the basis for a&nbsp;multi-distro realtime message bus.In this presentation, I'll give an overview of fedmsg -- the Federated Message&nbsp;Bus -- what it is, how it works, and why some design decisions were made the&nbsp;way they were. The second half will cover projects that integrate with fedmsg.Abstract--------- What fedmsg is good for - A way to keep your finger on the pulse of open source development - A source of community metrics over time - A platform for building out reactive realtime infrastructure- What is Fedora Infrastructure?  \"How a Linux Distribution gets made\"- Overview of our topology -- what services are tied in- Design decisions necessitated by an Open Infrastructure - Signed, but unencrypted - No central broker - Public zmq.PUB socket- CLI tools and API examples- Applications built against fedmsg - End user notifications for everyone - Desktop\/Android\/IRC - Push to test\/qa infrastructure - Push notifications to mirrors - Sync apprentice and packager credentials - Visualizations - Faking git logs for \"gource\" - Reports - fedora-news, this-week-in-fedora, &amp; owner-change-tool - Fedora Badges for distro contributors- Debian adoption - Imagine a multi-distro realtime development ponyOutline-------- What fedmsg is good for - A way to keep your finger on the pulse of open source development - A source of community metrics over time - A platform for building out reactive realtime infrastructure- What is Fedora Infrastructure?  \"How a Linux Distribution gets made\" - What do packagers do? - What does release engineering do? - How do we communicate, make decisions, govern ourselves? - Design and development. - Testing, QA, bug reporting. - All the good things in life.- Overview of our topology -- what services are tied in - [just talk about this diagram](http:\/\/threebean.org\/presentations\/fedmsg-flock13\/images\/fedmsg-flock13-img\/topology.png)- Design decisions necessitated by an Open Infrastructure - We have an open infrastructure.  You can show up at our weekly IRC meeting and get \"fi-apprentice\" rights to log in to machines. - Signed, but unencrypted.  Anyone can read, anyone can write.  Only some messages are trusted.  Key here is that anyone can debug at any point in our infrastructure. - No central broker.  Datacenters are donated and distributed.  Things can go down.  fedmsg designed to not bring *anything* down with it. - Public zmq.PUB socket.  The world can read at ``tcp:\/\/hub.fedoraproject.org:9940`` -- point a ``zmq.SUB`` socket at it with ``recv_multipart``.- CLI tools and API examples - CLI: ``echo \"hello world\" | fedmsg-logger`` - CLI: ``fedmsg-tail --really-pretty`` - API: ``fedmsg.publish(...)`` - API: ``fedmsg.tail_messages(...)``- Applications built against fedmsg - fedmsg-notifications. -- Problem: all of our applications carry their own email code. With that comes further baggage and maintenance. With fedmsg notifications for interesting infrastructure events, we can put all that code in one place where it can be more easily maintained. Benefit to the end-user: manage notification preferences in one place instead of per-app. Opens up notifications to different contexts:  Email? IRC privmsg? Android? RSS? - Push to test\/qa infrastructure. When new packages are built, we can instantly run depchain analysis tests.  This is was done previously with cronjobs. When new composes are complete, we can fire off jobs in beaker to make sure install and integration tests pass.  This was done previously by hand. - Push notifications to mirrors Over 200 mirrors right now.  They have cronjobs that poll with rsync, we can use ``fedmsg-trigger`` to fire off rsync only when the compose notification is published. - Sync apprentice and packager credentials Ugly cronjobs exist that run that sync shell groups to machines from the Fedora Account System.  With ``fedmsg-trigger``, we fire off an ansible playbook to sync creds when group-membership-change messages are published. Same goes for package ownership and ACL changes.  People had to wait up to an hour for their creds to propagate. - Visualizations - Faking git logs for \"gource\". Run \"fedmsg-tail --gource | gource -i 0 --log-format custom -\" to get the realtime version of [this](http:\/\/threebean.org\/so-i-turned-the-fedmsg-data-into-a-git-log-and.webm). Its the best office dashboard ever. - Reports - fedora-news, this-week-in-fedora, owner-change-tool, &amp; release engineering dashboard. HTML5 dashboards that query the history of fedmsg to make useful reports. http:\/\/ambre.pingoured.fr\/fedora-news\/ http:\/\/ambre.pingoured.fr\/thisweekinfedora\/ https:\/\/lists.fedoraproject.org\/pipermail\/infrastructure\/2013-June\/013070.html https:\/\/apps.stg.fedoraproject.org\/releng-dash\/ - Fedora Badges for distro contributors https:\/\/badges.fedoraproject.org Backends listens to the bus and wakes up in response to new events. Compares messages against a series of 100 or so rules defined in YAML.  If a contributor matches some criteria, then they are awarded a badge (achievement unlocked!) Fun fact -- this is hooked into Mozilla's Open Badges Infrastructure (OBI).  https:\/\/openbadges.org\/- Debian adoption - Imagine a multi-distro realtime development pony - This is amazing.  Their bus is still coming up but they have a ton of message types already passing over it. - They too have a publicly subscribable endpoint.  Your end user machine can subscribe to *both* the Fedora and the Debian buses. - Imagine this scenario:  a security bug gets filed in Debian.  A Fedora daemon listens to their bus and automatically files the same bug on our tracker against the same package (perhaps it is smart and checks for dupes first). - A new package update is marked as a security fix in Fedora, a debian daemon listens and tries to check if the same patch is applied there.  If not, it emails the maintainer to find out whats up. - We just started talking about a Holy Grail - integrating compatible semantic DOAP and FOAF information with all messages so we can easily correlate activity between the distributions. - Can we provide a service to upstreams?  Aim your github service hook at some bucket service.  When you tag a new release, it notifies the upstream-bucket, the upstream-bucket notifies anyone who wants to know (Fedora, Debian, &amp; friends).","tags":["Fedora"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391935800,"event_start_rfc":"Sun, 09 Feb 2014 09:50:00 +0100","event_end":1391938200,"event_end_rfc":"Sun, 09 Feb 2014 10:30:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"DNSSEC (not only) on workstations","speakers":["Tomas Hozza"],"description":"The support of DNSSEC in server software it pretty good, but there are still missing parts of DNSSEC support in client side software. Client side support is important, since some applications can benefit from DNSSEC validated DNS responses (such as SSH fingerprint validation or TLS\/SSL certificates validation). The talk will be about the current situation in Fedora, used projects (unbound dnssec-trigger combination) and how it is all integrated with NetworkManager. We will reveal also future plans for better integration with NetworkManager and even better user experience.","tags":["Networking"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391935800,"event_start_rfc":"Sun, 09 Feb 2014 09:50:00 +0100","event_end":1391938200,"event_end_rfc":"Sun, 09 Feb 2014 10:30:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"We are Fedora (and so can you)!","speakers":["Stephen Gallagher"],"description":"The Fedora Project is embarking on an exciting new vision of the future. Gone are the days of unstructured releases, firehose updates and directionless wandering. In 2014, Fedora will be producing three distinct products for the first time in its history. In January, these directions were set and now is the time to act.Come, join us for a hackfest, brainstorming and launch event for the development of these new products. Help us learn how we can work with your projects to make our Workstation, Server and Cloud products a success.","tags":["Fedora"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391938800,"event_start_rfc":"Sun, 09 Feb 2014 10:40:00 +0100","event_end":1391941200,"event_end_rfc":"Sun, 09 Feb 2014 11:20:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"Automation in the Fedora land","speakers":["Pierre-Yves Chibon"],"description":"Tools and technologies to automate our work as upstreams or packagers.The Fedora community is composed of a large number of diverse profiles. Fromambassadors, to translators, to packagers and upstreams developers, we are alldoing our work and as a result for 10 years we have been releasing a new Fedora(almost) every 6 months.However, there are a number of occasions where this work could be made simpler,more accessible, more automatic.This presentation will focus on developpers, sysadmins and packagers and presentthem with tools and technologies available in Fedora that make their life simpler.From Jenkins to ansible, from Copr to FMN or the *2spec tools from the existingsolutions to some crazy ideas (Debian and Fedora integrated notifications, packagereview application...), there are many ways to make your life simpler.Do you know them all?","tags":["Developer"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391938800,"event_start_rfc":"Sun, 09 Feb 2014 10:40:00 +0100","event_end":1391941200,"event_end_rfc":"Sun, 09 Feb 2014 11:20:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"perf profiling","speakers":["Jiri Olsa"],"description":"How to use perf for application\/kernel profiling by&nbsp;showing practical examples of various perf commands.","tags":["Kernel"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391938800,"event_start_rfc":"Sun, 09 Feb 2014 10:40:00 +0100","event_end":1391941200,"event_end_rfc":"Sun, 09 Feb 2014 11:20:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Copr, Fedora build service","speakers":["Miroslav Suchy"],"description":"COPR - new lightweight buildsystem for personal and third party projects. Learn why should you be using the build system for your project and how can you build your package for multiple distributions at once. Discover how to integrate Software Collections using COPR.","tags":["Fedora"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391941800,"event_start_rfc":"Sun, 09 Feb 2014 11:30:00 +0100","event_end":1391944200,"event_end_rfc":"Sun, 09 Feb 2014 12:10:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"Building an agile Fedora Release Engineering ","speakers":["Dennis Gilmore"],"description":"Fedora is undergoing some major change. This talk is to cover the change from the release engineering perspective. The goal is to show you the areas that will need the most work and effort and how you can contribute to the process.  Never think of Release Engineering as a blackbox ever again.","tags":["Fedora"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391941800,"event_start_rfc":"Sun, 09 Feb 2014 11:30:00 +0100","event_end":1391944200,"event_end_rfc":"Sun, 09 Feb 2014 12:10:00 +0100","room":"Lecture room D2","room_short":"D2","room_color":"#fcaf3e","topic":"Introduction to Linux Kernel Development","speakers":["Levente Kurusa"],"description":"This talk will give you an insight on how the developers develop the kernel. This will also guide you through basic git principals and introduce you to how kernels work and why they are necessary in everyday work. An interesting talk that will also show you how to write and send a basic but important patch and get it accepted.","tags":["Kernel"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391941800,"event_start_rfc":"Sun, 09 Feb 2014 11:30:00 +0100","event_end":1391944200,"event_end_rfc":"Sun, 09 Feb 2014 12:10:00 +0100","room":"Lecture room D3","room_short":"D3","room_color":"#8ae234","topic":"Why 3D printing software workflow sucks","speakers":["Miro Hrončok"],"description":"Fedora 19 brought a new \"feature\" - it was the first distribution that packaged all free 3D printing tools and apps available. That's great, no doubt. But the current 3D printing workflow form the software perspective suck. Users have to run dozens of apps to print a model.In this talk, I'll introduce the current workflow and explain why it sucks. I'll also show how it could be done and bring up some ideas how to implement it. Several project that aim the same thing will be presented. The idea here is to integrate 3D printing to the Linux desktop and make 3D printing as easy as hitting Ctlr+P - let's make 3D printing a real feature.","tags":["Desktop, Fedora"],"location":"MUNI","lang":"EN"},{"type":"Talk","event_start":1391945400,"event_start_rfc":"Sun, 09 Feb 2014 12:30:00 +0100","event_end":1391947800,"event_end_rfc":"Sun, 09 Feb 2014 13:10:00 +0100","room":"Lecture room D1","room_short":"D1","room_color":"#fce94f","topic":"Meet your FESCo team! ","speakers":["Marcela Maslanova"],"description":"N\/A","tags":["Fedora"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391948400,"event_start_rfc":"Sun, 09 Feb 2014 13:20:00 +0100","event_end":1391968800,"event_end_rfc":"Sun, 09 Feb 2014 19:00:00 +0100","room":"Workshop room L1 - B410","room_short":"L1","room_color":"#729fcf","topic":"systemd","speakers":["Lukáš Nykrýn"],"description":"This session is focused on discussing and solving issues with systemd in Fedora.","tags":["Developer, Fedora"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391948400,"event_start_rfc":"Sun, 09 Feb 2014 13:20:00 +0100","event_end":1391955600,"event_end_rfc":"Sun, 09 Feb 2014 15:20:00 +0100","room":"Workshop room L2 - C525","room_short":"L2","room_color":"#ef2929","topic":"fedora-upgrade","speakers":["Miroslav Suchy"],"description":"Upgrading from Fedora n to n+1 using yum, how to enhance it, what should be done differently, ideas.","tags":["Admin, Fedora"],"location":"MUNI","lang":"EN"},{"type":"Workshop","event_start":1391948400,"event_start_rfc":"Sun, 09 Feb 2014 13:20:00 +0100","event_end":1391952000,"event_end_rfc":"Sun, 09 Feb 2014 14:20:00 +0100","room":"Workshop room L3 - C511","room_short":"L3","room_color":"#ad7fa8","topic":"DevAssistant","speakers":["Petr Hráček"],"description":"Using Dev Assistant, creating own assistants, gathering user input and ideas","tags":["Developer"],"location":"MUNI","lang":"EN"}],"users":[{"username":"adam.samalik","name":"Adam Šamalík","joined":"2014-01-31 01:11:33","lastactive":"2014-02-07 10:29:46","avatar":"https:\/\/graph.facebook.com\/100000192514600\/picture?type=normal","company":"","position":""},{"username":"adamskotnicky","name":"Adam Skotnický","joined":"2014-02-06 13:49:35","lastactive":"2014-02-06 10:58:23","avatar":"https:\/\/graph.facebook.com\/1223474010\/picture?type=normal","company":"Technologické centrum Písek","position":"Cloud Leader"},{"username":"adk","name":"adk","joined":"2014-02-06 02:17:34","lastactive":"2014-02-06 06:39:33","avatar":"http:\/\/static.sched.org\/a3\/1004770\/avatar.jpg.75x75px.jpg","company":"","position":"Long Distance Cyclotourist"},{"username":"adrianschroter","name":"Adrian Schröter","joined":"2013-12-19 08:12:59","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949490\/avatar.jpg.75x75px.jpg","company":"SUSE","position":"Technical Project Manager"},{"username":"akrivokapic1","name":"Ana Krivokapić","joined":"2013-01-15 07:10:24","lastactive":"2014-01-22 07:11:01","avatar":"https:\/\/graph.facebook.com\/623277758\/picture?type=normal","company":"Red Hat Czech","position":""},{"username":"aleh","name":"Aleh","joined":"2014-01-17 04:26:53","lastactive":"2014-02-01 02:12:57","avatar":"","company":"","position":""},{"username":"aleh.filipovich","name":"Aleh Filipovich","joined":"2014-01-17 04:25:52","lastactive":"2014-02-09 12:13:10","avatar":"http:\/\/static.sched.org\/a3\/976347\/avatar.jpg.75x75px.jpg","company":"Vaolix s.r.o.","position":"Software Consultant"},{"username":"aleskozumplik","name":"Ales Kozumplik","joined":"2013-12-20 00:02:19","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950246\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Software Engineer"},{"username":"alexanderlarsson","name":"Alexander Larsson","joined":"2013-12-19 06:33:48","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949451\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Principal Software Engineer"},{"username":"alexis.solanas.3","name":"Alexis Solanas","joined":"2014-01-20 00:31:08","lastactive":"2014-01-24 04:47:32","avatar":"https:\/\/graph.facebook.com\/100005875750061\/picture?type=normal","company":"","position":""},{"username":"alian","name":"alian","joined":"2014-02-06 13:51:52","lastactive":"2014-02-06 11:10:49","avatar":"http:\/\/m.c.lnkd.licdn.com\/mpr\/mprx\/0_lxZqPA8WE1zghubPP0WIPPKdevPx2u6P1YuwPP3zBKbm1HA1jMe4j1vRQR1T7wFxKysoyq0s95OQ","company":"Websupport","position":"System Administrator"},{"username":"Ambersky","name":"Lubos","joined":"2014-01-28 01:54:01","lastactive":"2014-01-28 11:03:16","avatar":"","company":"HP","position":"System Administrator"},{"username":"amureini","name":"Allon Mureinik","joined":"2014-01-17 07:58:45","lastactive":"","avatar":"","company":"Red Hat","position":"Senior Software Engineer"},{"username":"andela","name":"Andela","joined":"2014-02-06 23:26:57","lastactive":"2014-02-08 02:31:00","avatar":"http:\/\/static.sched.org\/a3\/1005710\/avatar.jpg.75x75px.jpg","company":"","position":""},{"username":"andrej.golis","name":"Andrej Golis","joined":"2014-02-08 00:35:17","lastactive":"2014-02-08 05:19:20","avatar":"https:\/\/graph.facebook.com\/100002471046212\/picture?type=normal","company":"Red Hat Czech","position":""},{"username":"andrejpodhradsky","name":"Andrej Podhradsky","joined":"2013-12-20 05:37:15","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950427\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Quality Assurance Engineer"},{"username":"andrewdinn","name":"Andrew Dinn","joined":"2013-12-20 02:52:24","lastactive":"","avatar":"","company":"Red Hat","position":"Principal Software Engineer"},{"username":"angelikik","name":"Angeliki Kontarini","joined":"2014-02-06 13:55:12","lastactive":"2014-02-06 11:22:38","avatar":"http:\/\/m.c.lnkd.licdn.com\/mpr\/mprx\/0_5P24ioimdsecKIB4LlIwiWtxIxuRKe94FA4bie3aqsZI723ZdvpqSHvhLA2X17cqkKa62fxQyslP","company":"Private Computing","position":"Owner"},{"username":"annagalkina","name":"","joined":"2014-02-06 23:28:12","lastactive":"2014-02-08 08:18:33","avatar":"","company":"","position":""},{"username":"antonio.cascella","name":"Antonio","joined":"2014-01-13 07:10:53","lastactive":"2014-02-07 03:21:32","avatar":"","company":"","position":""},{"username":"antonisegurapuimedon","name":"Antoni Segura Puimedon","joined":"2013-12-19 11:43:38","lastactive":"2014-02-08 10:40:59","avatar":"http:\/\/static.sched.org\/a3\/949597\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"antoszka","name":"Antoni Grzymała","joined":"2014-01-08 07:34:43","lastactive":"2014-01-10 06:23:00","avatar":"","company":"","position":""},{"username":"antrop.krpa","name":"Antrop Krpa","joined":"2014-01-13 04:38:54","lastactive":"2014-02-07 08:38:43","avatar":"https:\/\/graph.facebook.com\/100002942506279\/picture?type=normal","company":"","position":""},{"username":"av42","name":"Amir Vadai","joined":"2013-08-08 04:09:48","lastactive":"2014-02-09 11:28:37","avatar":"","company":"Mellanox Technologies","position":"Sr SW Eng."},{"username":"balo","name":"Balazs Varga","joined":"2014-01-16 10:54:24","lastactive":"2014-02-09 11:51:10","avatar":"","company":"","position":""},{"username":"baruza","name":"Bára Baruza Ančincová","joined":"2014-01-08 06:51:43","lastactive":"2014-02-08 10:23:46","avatar":"https:\/\/graph.facebook.com\/1166995816\/picture?type=normal","company":"","position":""},{"username":"beiske","name":"Konrad Beiske","joined":"2014-02-06 06:01:11","lastactive":"2014-02-09 08:48:17","avatar":"","company":"","position":""},{"username":"benlevenson","name":"Ben Levenson","joined":"2013-02-21 23:39:47","lastactive":"2014-02-09 08:50:54","avatar":"","company":"","position":""},{"username":"bohuslavkabrda","name":"Bohuslav Kabrda","joined":"2013-12-19 06:38:49","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949453\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"Brblos","name":"Pavel Gajdusek","joined":"2014-02-07 22:11:09","lastactive":"2014-02-08 05:53:06","avatar":"","company":"","position":""},{"username":"brianleathem","name":"Brian Leathem","joined":"2013-12-20 02:17:35","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950353\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Software Engineer"},{"username":"brouer","name":"Jesper Dangaard Brouer","joined":"2013-01-06 08:59:26","lastactive":"2014-01-20 04:06:43","avatar":"http:\/\/static.sched.org\/a2\/510087\/avatar.jpg.75x75px.jpg","company":"Red Hat Inc.","position":"Senior Kernel Engineer"},{"username":"calinux81","name":"Ardelean Calin","joined":"2014-02-06 23:41:50","lastactive":"2014-02-07 08:50:25","avatar":"","company":"","position":""},{"username":"caybro","name":"Lukáš Tinkl","joined":"2013-02-04 10:49:39","lastactive":"2014-02-09 11:26:44","avatar":"https:\/\/graph.facebook.com\/1684748496\/picture?type=normal","company":"Red Hat","position":""},{"username":"clindner3","name":"Carl Lindner","joined":"2014-01-06 13:46:39","lastactive":"2014-01-06 10:49:05","avatar":"","company":"","position":""},{"username":"const_is","name":"Constantin Ivanov","joined":"2014-01-17 00:17:14","lastactive":"2014-01-17 04:40:38","avatar":"","company":"","position":""},{"username":"cz.huhu","name":"Patrik Majer","joined":"2013-04-06 07:13:00","lastactive":"2014-02-06 10:55:58","avatar":"http:\/\/static.sched.org\/a3\/642048\/avatar.jpg.75x75px.jpg","company":"IZEN s.r.o","position":""},{"username":"danielborkmann","name":"Daniel Borkmann","joined":"2013-12-19 06:03:18","lastactive":"","avatar":"","company":"Red Hat","position":"Linux Kernel Engineer"},{"username":"danielvratil","name":"Daniel Vratil","joined":"2013-12-19 09:30:15","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949525\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Associate Software Engineer"},{"username":"danielwilliams2","name":"Daniel Williams","joined":"2013-12-19 05:57:16","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949438\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"danvratil","name":"Daniel Vrátil","joined":"2014-02-03 03:57:01","lastactive":"2014-02-08 10:13:33","avatar":"https:\/\/graph.facebook.com\/1320232830\/picture?type=normal","company":"Red Hat","position":""},{"username":"danwalsh","name":"Dan Walsh","joined":"2013-12-19 23:45:28","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950238\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Principal Software Engineer"},{"username":"dayana.hovsepyan","name":"Արմինե Հովսեփյան (Armine Hovsepyan)","joined":"2014-01-24 05:12:22","lastactive":"2014-01-24 02:21:08","avatar":"http:\/\/static.sched.org\/a3\/985411\/avatar.jpg.75x75px.jpg?a67","company":"Red Hat","position":"Senior QA Engineer"},{"username":"dennisgilmore","name":"Dennis Gilmore","joined":"2013-12-20 00:21:56","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950253\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Release Engineer"},{"username":"Dibarbora","name":"Radoslav Dibarbora","joined":"2014-01-20 06:51:28","lastactive":"2014-01-23 03:57:14","avatar":"","company":"","position":""},{"username":"dmitripal","name":"Dmitri Pal","joined":"2013-12-19 23:39:06","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950236\/avatar.jpg.75x75px.jpg?93d","company":"Red Hat","position":"Software Engineering Manager"},{"username":"dmueller1","name":"Diane Mueller-Klingspor","joined":"2013-06-21 19:12:33","lastactive":"2014-01-27 03:48:57","avatar":"","company":"Red Hat","position":"Cloud Evangelist"},{"username":"Doniyor","name":"Doniyor Burikulov","joined":"2014-01-20 13:19:15","lastactive":"2014-01-29 03:34:39","avatar":"","company":"DHL ITS","position":"Software Engineer"},{"username":"dsmsk","name":"dsmsk","joined":"2014-01-16 12:30:30","lastactive":"2014-02-08 02:51:47","avatar":"","company":"","position":""},{"username":"dtardon","name":"David Tardon","joined":"2014-01-07 06:31:30","lastactive":"2014-02-09 09:12:54","avatar":"","company":"","position":""},{"username":"dzarda","name":"Jaroslav Malec","joined":"2014-01-10 01:43:33","lastactive":"2014-01-10 12:25:14","avatar":"","company":"","position":""},{"username":"dzardacz","name":"Jaroslav Malec","joined":"2014-02-06 08:47:51","lastactive":"2014-02-06 05:54:07","avatar":"https:\/\/graph.facebook.com\/1442302207\/picture?type=normal","company":"SEON Special Electronics","position":""},{"username":"ebirn","name":"Erich B","joined":"2014-01-30 08:21:17","lastactive":"2014-02-09 09:32:54","avatar":"http:\/\/static.sched.org\/a3\/993567\/avatar.jpg.75x75px.jpg","company":"Medical University of Vienna","position":""},{"username":"Eder","name":"Eder","joined":"2014-02-05 03:32:01","lastactive":"2014-02-05 01:29:53","avatar":"","company":"","position":""},{"username":"eduardohabkost","name":"Eduardo Habkost","joined":"2013-12-19 22:52:08","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950226\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"egmar","name":"Egor Margineanu","joined":"2014-01-16 07:15:21","lastactive":"2014-02-07 04:02:21","avatar":"http:\/\/pbs.twimg.com\/profile_images\/422642992449482752\/l9iP6ns3_bigger.png","company":"","position":""},{"username":"ehabkost","name":"Eduardo Habkost","joined":"2012-09-12 15:19:45","lastactive":"2014-02-09 10:33:30","avatar":"https:\/\/is1.4sqi.net\/userpix_thumbs\/5WGDHGMQUDOYURE4.jpg","company":"Red Hat","position":""},{"username":"eischmann","name":"Jiří Eischmann","joined":"2013-06-21 19:12:33","lastactive":"2014-02-06 01:40:17","avatar":"https:\/\/graph.facebook.com\/719763026\/picture?type=normal","company":"Red Hat","position":""},{"username":"ekotsev","name":"Emil Kotsev","joined":"2014-02-02 02:43:48","lastactive":"2014-02-02 11:54:33","avatar":"http:\/\/static.sched.org\/a3\/996912\/avatar.jpg.75x75px.jpg","company":"Acision","position":"Mobile Services Engineer"},{"username":"fajlo","name":"Martin Lofaj","joined":"2014-02-05 03:42:07","lastactive":"2014-02-07 09:23:08","avatar":"https:\/\/graph.facebook.com\/1334473746\/picture?type=normal","company":"","position":""},{"username":"flavioleitner","name":"Flavio Leitner","joined":"2013-12-19 06:01:52","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949440\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Principal Software Engineer"},{"username":"flyaruu","name":"Frank Lyaruu","joined":"2014-01-29 09:21:44","lastactive":"2014-02-09 11:19:44","avatar":"http:\/\/m.c.lnkd.licdn.com\/mpr\/mprx\/0_ljrrctlVOizyhlZAl0i_crANpFlOC-dA1VX7crhbiT5agnOljRhpMKNW-oA33zHjKO-a4B-xljwo","company":"Dexels BV","position":"CTO"},{"username":"fpercoco","name":"Flavio Percoco","joined":"2013-09-24 04:35:20","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/838884\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"frantisek.zatloukal","name":"František Fanys Zatloukal","joined":"2014-01-21 09:01:25","lastactive":"2014-01-27 12:42:24","avatar":"https:\/\/graph.facebook.com\/100000343777288\/picture?type=normal","company":"Linuxexpres","position":""},{"username":"fuzzycz","name":"Tomáš Vondra","joined":"2014-02-07 15:26:58","lastactive":"2014-02-08 01:54:02","avatar":"","company":"","position":""},{"username":"gabrielfstein","name":"Gabriel Stein","joined":"2014-02-06 04:36:08","lastactive":"2014-02-06 01:47:23","avatar":"https:\/\/graph.facebook.com\/729151399\/picture?type=normal","company":"Former03 GmbH","position":""},{"username":"gopalkrishnatiwari","name":"Gopal Krishna Tiwari","joined":"2013-12-20 02:55:11","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950373\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Maintenance Engineer"},{"username":"grasshopper22","name":"grasshopper22","joined":"2014-02-04 03:01:07","lastactive":"2014-02-05 12:02:32","avatar":"","company":"","position":""},{"username":"haerwu","name":"Marcin Juszkiewicz","joined":"2014-01-06 10:04:35","lastactive":"2014-01-06 10:21:25","avatar":"","company":"","position":""},{"username":"hansdegoede2","name":"Hans de Goede","joined":"2013-12-20 00:08:19","lastactive":"","avatar":"","company":"Red Hat","position":"Senior Software Engineer"},{"username":"happz","name":"","joined":"2013-02-22 15:18:14","lastactive":"2014-02-08 04:36:53","avatar":"","company":"","position":""},{"username":"haraldhoyer","name":"Harald Hoyer","joined":"2014-01-17 03:50:27","lastactive":"2014-01-17 01:00:51","avatar":"","company":"","position":""},{"username":"heevy","name":"","joined":"2014-02-06 14:02:14","lastactive":"2014-02-08 11:49:00","avatar":"","company":"","position":""},{"username":"himdel","name":"Martin Hradil","joined":"2014-01-02 07:31:37","lastactive":"2014-01-02 07:50:23","avatar":"https:\/\/graph.facebook.com\/637748335\/picture?type=normal","company":"","position":""},{"username":"hodain","name":"Radek Hodain","joined":"2013-01-09 00:47:21","lastactive":"2014-02-05 03:29:24","avatar":"http:\/\/a0.twimg.com\/sticky\/default_profile_images\/default_profile_4_bigger.png","company":"","position":""},{"username":"Homola","name":"Tomas","joined":"2014-02-06 00:18:39","lastactive":"2014-02-06 10:43:57","avatar":"","company":"","position":""},{"username":"honzagrec","name":"Jan Grec","joined":"2014-01-06 14:39:58","lastactive":"2014-02-06 10:34:57","avatar":"http:\/\/static.sched.org\/a3\/960444\/avatar.jpg.75x75px.jpg","company":"","position":""},{"username":"honzahorak","name":"Honza Horak","joined":"2013-12-20 00:05:28","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950247\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"horada","name":"Daniel","joined":"2014-02-06 07:03:42","lastactive":"2014-02-08 11:26:53","avatar":"","company":"","position":""},{"username":"hroncok","name":"Miro Hrončok","joined":"2013-01-16 13:13:45","lastactive":"2014-02-09 11:11:59","avatar":"http:\/\/pbs.twimg.com\/profile_images\/1867843185\/avatar_bigger.jpg","company":"Red Hat","position":"Intern"},{"username":"humulus","name":"","joined":"2014-02-06 10:56:26","lastactive":"2014-02-08 09:39:49","avatar":"","company":"","position":""},{"username":"Huvi","name":"Michal Huvar","joined":"2014-02-06 04:14:16","lastactive":"2014-02-07 09:29:23","avatar":"http:\/\/static.sched.org\/a3\/1004781\/avatar.jpg.75x75px.jpg","company":"Favorlogic","position":""},{"username":"i.gnatenko.brain","name":"Igor Gnatenko","joined":"2013-12-25 05:49:36","lastactive":"2014-02-09 10:14:18","avatar":"http:\/\/static.sched.org\/a3\/952109\/avatar.jpg.75x75px.jpg","company":"","position":""},{"username":"ifarkas","name":"Imre Farkas","joined":"2014-01-08 04:52:36","lastactive":"2014-01-27 03:07:30","avatar":"http:\/\/m.c.lnkd.licdn.com\/mpr\/mprx\/0_6X3m4famY304vKg8k5_g4Sult84czng8kizA4ugmS52Fo-EhEGACn2d8yaZHnlyuFFiKcI7iRSgn","company":"Red Hat","position":"Software Engineer"},{"username":"ihar.hrachyshka","name":"Ihar Hrachyshka","joined":"2014-02-06 09:43:22","lastactive":"2014-02-08 12:37:53","avatar":"https:\/\/graph.facebook.com\/678037763\/picture?type=normal","company":"RedHat","position":""},{"username":"imogenfm","name":"Imogen Flood-Murphy","joined":"2014-01-26 10:40:36","lastactive":"2014-01-26 08:07:46","avatar":"","company":"","position":""},{"username":"ineilsen","name":"Ian Neilsen","joined":"2014-01-28 17:46:51","lastactive":"2014-01-29 05:48:56","avatar":"","company":"Red Hat","position":"Business Analyst\/Qualit Engineer"},{"username":"ischemy","name":"Roman Beránek","joined":"2014-02-08 01:28:54","lastactive":"2014-02-08 04:18:28","avatar":"https:\/\/graph.facebook.com\/1065087595\/picture?type=normal","company":"Masarykova univerzita","position":"Student"},{"username":"istram","name":"Matěj Šusta","joined":"2013-01-10 06:13:56","lastactive":"2014-02-08 02:11:33","avatar":"http:\/\/m3.licdn.com\/mpr\/mprx\/0_Fl0jZerxU_4JP6oD5cOCZo1AJ8wMP_UD5nICZo__65xWuFuSwBfA9EcScaIQrks36tjiBSjUEuim","company":"Tieto Czech s.r.o.","position":"Sysadmin"},{"username":"ivannecas1","name":"Ivan Necas","joined":"2013-12-19 06:05:27","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949443\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Software Engineer"},{"username":"j.bittner","name":"Jakub Bittner","joined":"2014-01-29 10:40:46","lastactive":"2014-02-09 08:51:11","avatar":"http:\/\/m.c.lnkd.licdn.com\/mpr\/mprx\/0_IUM7SeBHz47dD31EdMspSInoBZH57C1EdySrSovveUpvK6XobgW_iE3UMres25-QoZUlCSbT0XY4","company":"Národní bezpečnostní úřad - National security authority","position":"Linux administrator"},{"username":"jahor","name":"jhrcz","joined":"2014-01-29 01:11:45","lastactive":"2014-02-09 12:10:03","avatar":"http:\/\/static.sched.org\/a3\/991733\/avatar.jpg.75x75px.jpg","company":"Etnetera a.s.","position":"System administrator"},{"username":"jakubadler","name":"Jakub Adler","joined":"2014-02-04 14:48:09","lastactive":"2014-02-07 10:22:16","avatar":"","company":"","position":""},{"username":"jan.grulich","name":"Jan Grulich","joined":"2014-01-20 08:43:45","lastactive":"2014-01-20 06:59:19","avatar":"http:\/\/cdn.schd.ws\/avatar.gif","company":"Red Hat","position":"Associate software engineer"},{"username":"jan.pluskal","name":"Honza Pluskal","joined":"2014-02-04 15:33:33","lastactive":"2014-02-07 06:13:04","avatar":"https:\/\/graph.facebook.com\/1378957591\/picture?type=normal","company":"","position":""},{"username":"janfertek","name":"Jan Feřtek","joined":"2014-01-23 06:50:06","lastactive":"2014-01-23 04:06:20","avatar":"https:\/\/graph.facebook.com\/1128354570\/picture?type=normal","company":"","position":""},{"username":"jankral","name":"Jan Kral","joined":"2013-12-19 11:14:16","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949580\/avatar.jpg.75x75px.jpg","company":"Elasticsearch","position":"Software Engineer"},{"username":"jansafranek","name":"Jan Safranek","joined":"2013-12-19 23:59:04","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950245\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Software Engineer"},{"username":"jaroslav","name":"jaroslav","joined":"2014-01-07 23:44:08","lastactive":"2014-01-09 10:11:16","avatar":"","company":"","position":""},{"username":"jcapik","name":"Jaromir Capik","joined":"2014-02-06 10:32:11","lastactive":"2014-02-08 07:25:08","avatar":"http:\/\/static.sched.org\/a3\/1005176\/avatar.jpg.75x75px.jpg","company":"","position":""},{"username":"jdieter","name":"Jonathan Dieter","joined":"2014-01-13 21:55:57","lastactive":"2014-01-14 07:03:32","avatar":"http:\/\/static.sched.org\/a3\/969944\/avatar.jpg.75x75px.jpg?319","company":"Lebanon Evangelical School","position":"System Administrator"},{"username":"jegermeister","name":"Krystian Majer","joined":"2014-02-06 06:27:39","lastactive":"2014-02-08 09:59:53","avatar":"","company":"","position":""},{"username":"jeremyeder","name":"Jeremy Eder","joined":"2014-01-16 07:27:50","lastactive":"2014-02-08 04:35:46","avatar":"","company":"Red Hat, Inc.","position":"Performance Engineer"},{"username":"jesperdangaardbrouer","name":"Jesper Dangaard Brouer","joined":"2013-12-19 22:59:03","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950228\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Linux Kernel Developer"},{"username":"jhladky","name":"Jirka Hladky","joined":"2014-01-07 06:28:36","lastactive":"2014-01-07 03:55:49","avatar":"","company":"","position":""},{"username":"jiri","name":"Jiri Eischmann","joined":"2013-01-06 04:22:03","lastactive":"2014-01-22 04:20:17","avatar":"http:\/\/graph.facebook.com\/719763026\/picture?type=normal","company":"Red Hat","position":""},{"username":"jiri.pechanec1","name":"Jiri Pechanec","joined":"2014-01-10 03:20:32","lastactive":"2014-02-05 11:26:04","avatar":"","company":"","position":""},{"username":"jirimoskovcak","name":"Jiri Moskovcak","joined":"2013-12-19 11:23:34","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949587\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Software Engineer"},{"username":"jiriolsa","name":"Jiri Olsa","joined":"2013-12-20 00:43:42","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950274\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Software Engineer"},{"username":"jirisedlacek","name":"Jiri Sedlacek","joined":"2013-12-20 05:17:28","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950418\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Quality Engineer"},{"username":"jiritomasek","name":"Jiri Tomasek","joined":"2013-12-19 11:08:06","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949577\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"jirivanek","name":"Jiri Vanek","joined":"2013-12-20 04:59:24","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950413\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Quality Engineer"},{"username":"jirizupka","name":"Jiri Zupka","joined":"2013-12-19 12:23:35","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949630\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Quality Engineer"},{"username":"jkremser","name":"Jiri Kremser","joined":"2014-01-03 05:20:48","lastactive":"2014-02-09 03:57:24","avatar":"http:\/\/static.sched.org\/a3\/956879\/avatar.jpg.75x75px.jpg?5e6","company":"Red Hat","position":"Software Engineer"},{"username":"jlieskov","name":"Jan Lieskovsky","joined":"2014-01-22 07:28:34","lastactive":"","avatar":"","company":"","position":""},{"username":"johanovanoha","name":"Jan Holcapek","joined":"2014-01-30 05:45:37","lastactive":"2014-02-07 12:04:23","avatar":"","company":"","position":""},{"username":"js402882","name":"js402882","joined":"2014-02-05 10:13:01","lastactive":"2014-02-09 09:01:50","avatar":"","company":"","position":""},{"username":"jstanek","name":"Jan Staněk","joined":"2014-02-06 13:06:19","lastactive":"2014-02-07 09:38:47","avatar":"","company":"","position":""},{"username":"jstransky","name":"Jiří Stránský","joined":"2013-01-07 11:54:32","lastactive":"2014-01-07 03:59:59","avatar":"http:\/\/static.sched.org\/a2\/510529\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"jsvitak","name":"Jiří Sviták","joined":"2013-01-06 09:24:46","lastactive":"2013-02-23 05:20:08","avatar":"http:\/\/static.sched.org\/a2\/510110\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Associate Quality Engineer"},{"username":"jurajhuska1","name":"Juraj Huska","joined":"2013-12-20 05:04:21","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950414\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Quality Engineer"},{"username":"kadel","name":"Tomas","joined":"2014-02-02 02:51:41","lastactive":"2014-02-08 04:34:47","avatar":"http:\/\/pbs.twimg.com\/profile_images\/112813048\/avatar_bigger.jpg","company":"Seznam.cz","position":"Senior System Administrator"},{"username":"kammtar","name":"Tomáš Polišenský","joined":"2014-01-30 12:50:01","lastactive":"2014-02-06 09:22:09","avatar":"https:\/\/graph.facebook.com\/100000152277468\/picture?type=normal","company":"","position":""},{"username":"karennoel1","name":"Karen Noel","joined":"2013-12-19 22:44:56","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950224\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Manager, Software Engineering"},{"username":"kaysievers","name":"Kay Sievers","joined":"2013-12-19 23:24:38","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950232\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"kenoh","name":"Matus Honek","joined":"2014-02-05 02:11:34","lastactive":"2014-02-07 12:52:38","avatar":"","company":"","position":""},{"username":"kkaempf","name":"Klaus Kämpf","joined":"2014-02-06 00:36:03","lastactive":"2014-02-06 11:56:55","avatar":"http:\/\/static.sched.org\/a3\/1004578\/avatar.jpg.75x75px.jpg","company":"SUSE Linux","position":"Trouble Maker"},{"username":"kkolakow","name":"Kamil Kolakowski","joined":"2014-02-06 01:35:42","lastactive":"2014-02-06 11:18:17","avatar":"","company":"","position":""},{"username":"kmbrophy","name":"Kevin Brophy-Lehmann","joined":"2014-02-06 02:10:22","lastactive":"2014-02-06 10:26:33","avatar":"http:\/\/static.sched.org\/a3\/1004769\/avatar.jpg.75x75px.jpg","company":"brophy-lehmann","position":"founder"},{"username":"kylemcmartin","name":"Kyle McMartin","joined":"2013-12-19 23:48:53","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950240\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"ladislavsmola","name":"Ladislav Smola","joined":"2013-12-19 11:06:12","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949576\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"ladislavthon","name":"Ladislav Thon","joined":"2013-12-20 04:56:07","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950412\/avatar.jpg.75x75px.jpg?c71","company":"Red Hat","position":"Quality Engineer"},{"username":"langdon","name":"Langdon White","joined":"2012-08-28 11:43:48","lastactive":"2014-02-09 09:55:53","avatar":"http:\/\/m.c.lnkd.licdn.com\/mpr\/mprx\/0_oFea4EsC9k2E48g2e8ol4dphN8Wb4Qp2H_yl4dVyw6gBFGIuQ3ZGnWmtsSdZUTjhIXErcmkJ0bMX","company":"Red Hat","position":"Developer & Platform Evangelist"},{"username":"langdonwhite","name":"Langdon White","joined":"2013-12-19 06:30:34","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949450\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Developer & Platform Evangelist"},{"username":"lczerner","name":"Lukáš Czerner","joined":"2013-01-06 06:27:20","lastactive":"2014-02-09 11:22:13","avatar":"http:\/\/static.sched.org\/a2\/510059\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Kernel Engineer"},{"username":"lee.yarwood","name":"Lee Yarwood","joined":"2013-02-18 04:50:58","lastactive":"2014-01-30 12:58:10","avatar":"http:\/\/m.c.lnkd.licdn.com\/mpr\/mprx\/0_T8jL9VYA6CXzvufxiCas9MEKXb_4cumxiTds9Mu3RCBHHHM0DQDdZJ4fodiFNw7P8_0RJOOYYfs3","company":"Red Hat","position":"Senior Software Maintenance Engineer"},{"username":"lennartpoettering1","name":"Lennart Poettering","joined":"2013-12-19 23:21:08","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950231\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":""},{"username":"leo.demiurg","name":"Leonid Zhaldybin","joined":"2014-02-04 03:58:46","lastactive":"2014-02-04 06:13:21","avatar":"","company":"","position":""},{"username":"leos.pol","name":"Leoš Pol","joined":"2014-02-06 13:01:14","lastactive":"2014-02-07 03:01:34","avatar":"https:\/\/graph.facebook.com\/1218954663\/picture?type=normal","company":"Seznam.cz, a.s.","position":""},{"username":"levex","name":"Levente Kurusa","joined":"2013-12-21 07:23:54","lastactive":"2014-02-02 05:28:00","avatar":"http:\/\/m.c.lnkd.licdn.com\/mpr\/mprx\/0_YFRwQloh5mi7s7yqOQ44Q-MDLaKCZ2yqy5fqQ-MAVIkPbewN-3IbHtD0I8ryRIg4xXJvWvFgpha0","company":"Various Open Source Projects","position":"Random hacker"},{"username":"lfabriko","name":"Lucie Krejcirova","joined":"2014-02-07 00:48:33","lastactive":"2014-02-07 09:52:39","avatar":"","company":"","position":""},{"username":"lfryc","name":"Lukáš Fryč","joined":"2013-01-06 09:17:16","lastactive":"2014-02-06 01:43:27","avatar":"http:\/\/m3.licdn.com\/mpr\/mprx\/0_7bH7EYoCce3IMkYkDCRyEjIDBScbMF0kSQprEjV0eIiBQ_HXiT4_XgmAM8BZVhOemkol5skzLGrk","company":"Red Hat","position":"JBoss Software Engineer"},{"username":"liry","name":"Libor R","joined":"2014-01-20 00:56:40","lastactive":"2014-02-07 02:27:07","avatar":"","company":"","position":""},{"username":"llunved","name":"Daniel Riek","joined":"2014-02-07 01:24:10","lastactive":"2014-02-07 11:15:49","avatar":"https:\/\/graph.facebook.com\/100002284118816\/picture?type=normal","company":"Red Hat","position":""},{"username":"lmvaz","name":"Leonardo Vaz","joined":"2014-01-01 08:40:20","lastactive":"2014-01-01 09:20:07","avatar":"https:\/\/graph.facebook.com\/786125907\/picture?type=normal","company":"Red Hat","position":"Software Maintenance Engineer"},{"username":"lnykryn","name":"Lukáš Nykrýn","joined":"2014-01-08 07:53:31","lastactive":"2014-01-13 09:48:50","avatar":"http:\/\/static.sched.org\/a3\/961867\/avatar.jpg.75x75px.jpg","company":"","position":""},{"username":"lubos.cvrk","name":"Lubos Cvrk","joined":"2014-01-15 00:14:32","lastactive":"2014-01-15 01:14:28","avatar":"https:\/\/graph.facebook.com\/1071272841\/picture?type=normal","company":"","position":""},{"username":"lukas.zachy","name":"Lukas Zachar","joined":"2014-01-16 14:36:44","lastactive":"2014-01-28 07:20:12","avatar":"https:\/\/graph.facebook.com\/1277855968\/picture?type=normal","company":"Red Hat","position":""},{"username":"lukas.zapletal","name":"Lukáš Zapletal","joined":"2013-01-08 06:49:44","lastactive":"2014-01-08 09:47:10","avatar":"http:\/\/static.sched.org\/a3\/510863\/avatar.jpg.75x75px.jpg?598","company":"Red Hat","position":"Engineering"},{"username":"lukasczerner","name":"Lukas Czerner","joined":"2013-12-19 22:34:25","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950220\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"lukasdoktor","name":"Lukas Doktor","joined":"2013-12-19 12:21:38","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949628\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Quality Engineer"},{"username":"lukasfryc","name":"Lukas Fryc","joined":"2013-12-20 02:14:10","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950352\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"lukasvlcek","name":"Lukas Vlcek","joined":"2013-12-20 05:22:44","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950422\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Software Engineer"},{"username":"maciejswiderski","name":"Maciej Swiderski","joined":"2013-12-20 05:26:05","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950423\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Software Engineer"},{"username":"makovec","name":"Michal Makovec","joined":"2014-02-06 13:54:47","lastactive":"2014-02-07 12:01:37","avatar":"http:\/\/static.sched.org\/a3\/1005406\/avatar.jpg.75x75px.jpg","company":"","position":""},{"username":"marbu","name":"Martin Bukatovic","joined":"2014-02-04 06:05:10","lastactive":"2014-02-07 07:21:55","avatar":"","company":"Red Hat","position":""},{"username":"marcandre.lureau","name":"Marc-André Lureau","joined":"2014-02-05 04:18:13","lastactive":"","avatar":"","company":"Red Hat","position":"Software Engineer"},{"username":"marcelamaslanova","name":"Marcela Maslanova","joined":"2013-12-19 11:52:32","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949602\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Supervisor - Software Engineer"},{"username":"marcinzajaczkowski","name":"Marcin Zajączkowski","joined":"2013-12-20 05:11:08","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950416\/avatar.jpg.75x75px.jpg","company":"","position":"Software Craftsman & Solution Architect"},{"username":"marekjelen1","name":"Marek Jelen","joined":"2012-10-03 05:00:18","lastactive":"2013-01-16 01:42:37","avatar":"http:\/\/static.sched.org\/a\/453125\/avatar.jpg.75x75px.jpg","company":"OpenShift @ Red Hat","position":"PaaS evangelist"},{"username":"marekk","name":"Marek","joined":"2014-01-06 03:45:03","lastactive":"2014-01-07 03:27:57","avatar":"","company":"","position":""},{"username":"marekmahut","name":"Marek Mahut","joined":"2013-12-19 11:48:01","lastactive":"2014-01-06 10:53:23","avatar":"http:\/\/static.sched.org\/a3\/949599\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Software Engineer"},{"username":"marekschmidt","name":"Marek Schmidt","joined":"2013-12-20 05:39:47","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950431\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Quality Engineer"},{"username":"marekwinkler","name":"Marek Winkler","joined":"2013-12-20 02:34:36","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950363\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Quality Engineer"},{"username":"marex","name":"Marek Vasut","joined":"2014-02-05 22:54:23","lastactive":"2014-02-09 08:55:04","avatar":"","company":"","position":""},{"username":"Markov","name":"Vlad Markov","joined":"2014-02-06 22:49:55","lastactive":"2014-02-09 08:55:03","avatar":"","company":"Wargaming.net","position":"PM of Level Art Department"},{"username":"martin.mecera.9","name":"Martin Mecera","joined":"2014-02-06 00:18:16","lastactive":"2014-02-06 09:13:04","avatar":"https:\/\/graph.facebook.com\/1816281049\/picture?type=normal","company":"Favorlogic","position":""},{"username":"martinbasti","name":"Martin Basti","joined":"2014-02-05 01:04:22","lastactive":"2014-02-07 10:28:24","avatar":"https:\/\/graph.facebook.com\/100004765148557\/picture?type=normal","company":"","position":""},{"username":"martingencur","name":"Martin Gencur","joined":"2013-12-20 02:21:09","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950355\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Quality Engineer"},{"username":"martinpovolny","name":"Martin Povolny","joined":"2013-12-19 11:10:11","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949578\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Software Engineer"},{"username":"martinstransky","name":"Martin Stransky","joined":"2013-12-19 11:57:20","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949606\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":""},{"username":"martinvecera","name":"Martin Vecera","joined":"2013-12-20 05:14:53","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950417\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"JBoss Quality Assurance Manager"},{"username":"matousjobanek","name":"Matous Jobanek","joined":"2013-12-20 02:24:57","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950357\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Quality Engineer"},{"username":"matthewmiller2","name":"Matthew Miller","joined":"2013-12-20 00:26:17","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950256\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Software Engineer"},{"username":"mbriskar","name":"matej","joined":"2014-02-02 08:13:36","lastactive":"2014-02-04 06:11:23","avatar":"","company":"","position":""},{"username":"mcepl","name":"Matěj Cepl","joined":"2014-01-08 05:57:01","lastactive":"2014-01-10 03:53:02","avatar":"","company":"","position":""},{"username":"mcermak","name":"mcermak","joined":"2014-02-05 05:33:58","lastactive":"2014-02-09 08:16:34","avatar":"","company":"","position":""},{"username":"metlos","name":"Lukas Krejci","joined":"2014-01-07 07:11:55","lastactive":"2014-01-18 03:12:33","avatar":"","company":"","position":""},{"username":"mfabian","name":"Mike FABIAN","joined":"2013-02-08 01:48:39","lastactive":"2014-02-02 11:26:15","avatar":"http:\/\/static.sched.org\/a2\/536023\/avatar.jpg.75x75px.jpg?4b4","company":"Red Hat","position":"Senior Software Engineer"},{"username":"michal.bernhard","name":"Michal Bernhard","joined":"2014-02-03 05:29:11","lastactive":"2014-02-04 01:47:39","avatar":"https:\/\/graph.facebook.com\/1186501812\/picture?type=normal","company":"","position":""},{"username":"michal6103","name":"Michal Sedlak","joined":"2013-02-21 12:15:11","lastactive":"2014-01-20 04:58:41","avatar":"http:\/\/a0.twimg.com\/profile_images\/1625104345\/f38132d9bb6c72824e95c21a5ab20fa2_bigger.jpg","company":"","position":""},{"username":"michalxo","name":"michalxo","joined":"2014-02-06 01:59:30","lastactive":"2014-02-06 06:11:14","avatar":"","company":"","position":""},{"username":"michal_grna","name":"Michal Grna","joined":"2014-01-07 22:58:08","lastactive":"2014-01-08 08:21:56","avatar":"","company":"","position":""},{"username":"mikeymay","name":"Mikey Ariel","joined":"2014-02-05 05:37:08","lastactive":"2014-02-05 03:53:35","avatar":"","company":"","position":""},{"username":"miminar","name":"Michal Minar","joined":"2013-01-07 12:50:08","lastactive":"2014-02-09 10:06:51","avatar":"","company":"Red Hat","position":""},{"username":"mirdhyn","name":"Merlin Gaillard","joined":"2014-01-29 07:47:14","lastactive":"2014-01-30 10:04:51","avatar":"","company":"","position":""},{"username":"miroslavsuchy","name":"Miroslav Suchy","joined":"2013-12-20 00:33:40","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950267\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"misnyo","name":"misnyo","joined":"2014-02-02 12:13:28","lastactive":"2014-02-08 02:46:29","avatar":"","company":"","position":""},{"username":"mknazsky","name":"Michal Knazsky","joined":"2014-02-06 04:08:05","lastactive":"2014-02-08 08:40:38","avatar":"https:\/\/graph.facebook.com\/1103859208\/picture?type=normal","company":"","position":""},{"username":"mkouba","name":"Martin Kouba","joined":"2014-01-07 01:09:11","lastactive":"2014-02-07 10:02:32","avatar":"","company":"","position":""},{"username":"mls4","name":"Michael Schroeder","joined":"2013-01-06 06:38:58","lastactive":"","avatar":"http:\/\/static.sched.org\/a2\/510063\/avatar.jpg.75x75px.jpg","company":"SUSE","position":"Software Developer"},{"username":"mmagr","name":"Martin Mágr","joined":"2014-01-07 08:39:05","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/960850\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"mureinik","name":"Allon Mureinik","joined":"2014-02-02 08:37:32","lastactive":"2014-02-09 08:51:28","avatar":"http:\/\/m.c.lnkd.licdn.com\/mpr\/mprx\/0_8LXTPsaaKKXcUBhxGCnOPJy2Kv_nUBhxGXrOPJYy7KBQk1c02iqSjMotYRiW4K3PT66xyY2v6vqq","company":"Red Hat","position":"Team Leader"},{"username":"mykrme","name":"Zuzka Krejčová","joined":"2014-01-27 01:21:30","lastactive":"2014-02-07 09:49:37","avatar":"http:\/\/cdn.schd.ws\/avatar.gif","company":"","position":""},{"username":"mzukal","name":"Marek Zukal","joined":"2014-01-08 00:42:19","lastactive":"2014-02-07 01:08:04","avatar":"https:\/\/graph.facebook.com\/100000176348449\/picture?type=normal","company":"PATRIOT spol. s r. o.","position":"Software developer"},{"username":"nikolay.aleksandrov.77","name":"Nikolay Aleksandrov","joined":"2014-02-02 02:34:58","lastactive":"2014-02-02 07:53:01","avatar":"https:\/\/graph.facebook.com\/1301501615\/picture?type=normal","company":"Red Hat","position":"Software Engineer"},{"username":"ohamada","name":"Ondrej Hamada","joined":"2014-02-04 14:48:20","lastactive":"2014-02-08 11:19:52","avatar":"","company":"","position":""},{"username":"oleg.fajans","name":"Oleg Fajans","joined":"2014-02-04 02:22:34","lastactive":"2014-02-08 02:03:12","avatar":"https:\/\/graph.facebook.com\/100001498208056\/picture?type=normal","company":"Saint Petersburg State University","position":""},{"username":"ondrej.hudlicky.1","name":"Ondřej Hudlický","joined":"2013-02-22 04:41:49","lastactive":"2014-01-08 08:42:11","avatar":"http:\/\/m.c.lnkd.licdn.com\/mpr\/mprx\/0_yHCbiqWq3yPTLxTZpWlNinsciMT85VhZOEn4in4dpyvKsYc4ratwS9uFDc3x6j3NgI8M2AodEeDE","company":"Red Hat","position":"Manager, Quality Assurance"},{"username":"ondrej.ilcik.7","name":"Ondrej Ilcik","joined":"2014-01-16 07:09:40","lastactive":"2014-01-16 04:21:18","avatar":"https:\/\/graph.facebook.com\/1461557970\/picture?type=normal","company":"IBM Global Services Delivery Center Czech Republic, s.r.o.","position":"IT Specialist"},{"username":"ondrejvasik","name":"Ondrej Vasik","joined":"2013-12-19 06:51:23","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949458\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineering Manager"},{"username":"ondrejzizka","name":"Ondrej Zizka","joined":"2013-12-20 05:35:05","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950426\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"ony","name":"Ondrej Skutka","joined":"2014-01-10 03:58:17","lastactive":"2014-01-10 04:36:43","avatar":"","company":"","position":""},{"username":"oskopek","name":"","joined":"2014-01-27 07:42:49","lastactive":"2014-02-07 04:22:06","avatar":"","company":"","position":""},{"username":"ota.jirak","name":"Ota Jirák","joined":"2014-02-05 11:27:38","lastactive":"2014-02-09 11:17:45","avatar":"https:\/\/graph.facebook.com\/100000040470078\/picture?type=normal","company":"Acision","position":""},{"username":"paolobonzini2","name":"Paolo Bonzini","joined":"2013-12-19 22:49:29","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950225\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Principal Software Engineer"},{"username":"paul98","name":"Paul Moore","joined":"2013-08-20 16:56:44","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/786500\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"paulcormier1","name":"Paul Cormier","joined":"2014-01-29 03:10:09","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/991795\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Executive vice president and president, Products and Technologies"},{"username":"pavel.lisy","name":"Pavel Lisý","joined":"2013-02-15 11:21:20","lastactive":"2014-02-09 10:46:03","avatar":"http:\/\/static.sched.org\/a2\/544829\/avatar.jpg.75x75px.jpg","company":"T-MAPY spol. s r.o.","position":"system administrator"},{"username":"pavel.zhukov.39","name":"Pavel Zhukov","joined":"2014-02-06 01:57:48","lastactive":"2014-02-06 11:13:14","avatar":"https:\/\/graph.facebook.com\/100001518444559\/picture?type=normal","company":"","position":""},{"username":"pavelsimerda","name":"Pavel Simerda","joined":"2013-12-20 00:38:51","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950271\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"paveltisnovsky","name":"Pavel Tisnovsky","joined":"2013-12-20 04:52:53","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950411\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Quality Engineer"},{"username":"pavlick","name":"Pablo Caruana","joined":"2014-02-07 10:13:19","lastactive":"2014-02-07 07:19:01","avatar":"http:\/\/m.c.lnkd.licdn.com\/mpr\/mprx\/0_vrCZ-hlguPWxKyBrB-Pb-CF1mK0grsBrctnF-C8flvISfO8KJ9tNyGq38OxCPgnpN18QjLtIlqpt","company":"Red Hat","position":"Technical Support Engineer"},{"username":"petervrabec","name":"Peter Vrabec","joined":"2013-12-20 00:11:02","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950250\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Supervisor Software Engineer"},{"username":"Petkov","name":"Aleksandar","joined":"2014-02-02 14:45:21","lastactive":"2014-02-07 04:00:18","avatar":"","company":"Acision","position":""},{"username":"petr.mensik.374","name":"Petr Menšík","joined":"2014-02-06 04:02:42","lastactive":"2014-02-07 02:43:38","avatar":"https:\/\/graph.facebook.com\/100007454252093\/picture?type=normal","company":"Red Hat","position":""},{"username":"petr.muller","name":"Petr Muller","joined":"2013-01-10 05:47:21","lastactive":"2014-02-09 03:11:10","avatar":"https:\/\/graph.facebook.com\/1078193988\/picture?type=normal","company":"Red Hat Czech","position":""},{"username":"petrblaho","name":"Petr Blaho","joined":"2013-01-07 11:54:12","lastactive":"2014-02-09 12:15:43","avatar":"http:\/\/static.sched.org\/a2\/510528\/avatar.jpg.75x75px.jpg?d33","company":"Red Hat","position":"Software Engineer"},{"username":"petrblaho1","name":"Petr Blaho","joined":"2013-12-19 09:42:24","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949537\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"petrskopek","name":"Petr Skopek","joined":"2013-12-20 02:31:01","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950361\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Principal Software Engineer"},{"username":"petrviktorin","name":"Petr Viktorin","joined":"2013-12-19 23:34:16","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950235\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":""},{"username":"pfrields","name":"Paul W. Frields","joined":"2013-02-23 08:04:13","lastactive":"2014-02-09 12:37:04","avatar":"http:\/\/m.c.lnkd.licdn.com\/mpr\/mprx\/0_bvDvUW8xXL0srdduFnO6Uo8YHkHNKEduLtJoUoAmcTpk7aO2IPjMzE586oew1SH8QnfwNSfTHnyZ","company":"Red Hat","position":"Engineering manager"},{"username":"pholasek","name":"Petr Holášek","joined":"2014-01-29 10:20:28","lastactive":"2014-02-08 10:44:31","avatar":"http:\/\/static.sched.org\/a3\/950227\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"phracek","name":"Petr Hráček","joined":"2014-01-09 04:46:54","lastactive":"","avatar":"","company":"","position":""},{"username":"pierreyveschibon","name":"Pierre-Yves Chibon","joined":"2013-12-20 00:49:28","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950275\/avatar.jpg.75x75px.jpg","company":"","position":""},{"username":"pitonak","name":"Pavol Pitoňák","joined":"2014-01-07 07:08:07","lastactive":"2014-01-09 12:41:22","avatar":"http:\/\/m.c.lnkd.licdn.com\/mpr\/mprx\/0_8D2tXJpVRevoXkVs8EfDXUpwRdGVkkwsGo4DXs7wX79oUhyV2IpYEVR5zXCLF_EnTaauIjl2BYpp","company":"Red Hat","position":"Quality Engineer"},{"username":"pmacik","name":"Pavel Macík","joined":"2013-01-07 12:36:51","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/510553\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Quality Engineer"},{"username":"pzbill1","name":"Bill Eldridge","joined":"2014-02-06 11:33:44","lastactive":"2014-02-07 01:45:27","avatar":"","company":"Pro-Zeta","position":"Business Development Director"},{"username":"qark","name":"Ludek Smid","joined":"2013-01-06 04:22:40","lastactive":"2014-01-23 04:34:31","avatar":"http:\/\/graph.facebook.com\/1311157889\/picture?type=normal","company":"","position":""},{"username":"queria","name":"Queria Sa-Tas","joined":"2014-02-06 14:23:55","lastactive":"2014-02-08 01:13:25","avatar":"http:\/\/static.sched.org\/a3\/1005444\/avatar.jpg.75x75px.jpg?a47","company":"RedHat","position":""},{"username":"radekvokal","name":"Radek Vokál","joined":"2013-01-06 03:43:59","lastactive":"2014-02-06 10:31:34","avatar":"http:\/\/static.sched.org\/a2\/510022\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Engineering Manager"},{"username":"radim.kanok","name":"Radim Kanok","joined":"2014-01-27 23:25:33","lastactive":"2014-01-28 08:45:19","avatar":"","company":"Tieto Czech","position":"SAP\/ERP infra specialist"},{"username":"radimvansa","name":"Radim Vansa","joined":"2013-12-20 04:50:33","lastactive":"","avatar":"","company":"Red Hat","position":"Quality Engineer"},{"username":"radoslav.husar","name":"Radoslav Husar","joined":"2013-02-24 04:50:31","lastactive":"2014-02-07 03:04:19","avatar":"https:\/\/graph.facebook.com\/1647186697\/picture?type=normal","company":"Red Hat","position":""},{"username":"radovansynek","name":"Radovan Synek","joined":"2013-12-20 02:38:53","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950366\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Quality Engineer"},{"username":"ralphbean","name":"Ralph Bean","joined":"2013-12-20 00:18:21","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950252\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Software Engineer"},{"username":"refcardz","name":"Ref","joined":"2014-02-03 01:48:11","lastactive":"2014-02-09 10:57:45","avatar":"","company":"","position":""},{"username":"reichlpa","name":"Pavel Reichl","joined":"2014-02-05 09:48:26","lastactive":"2014-02-06 06:00:03","avatar":"","company":"","position":""},{"username":"rgerhards","name":"Rainer Gerhards","joined":"2013-01-07 11:57:21","lastactive":"2014-02-08 04:23:48","avatar":"http:\/\/static.sched.org\/a2\/510530\/avatar.jpg.75x75px.jpg","company":"Adiscon","position":"Chief Software Engineer"},{"username":"rgerhards1","name":"Rainer Gerhards","joined":"2014-01-08 00:11:03","lastactive":"2014-02-08 11:50:37","avatar":"http:\/\/static.sched.org\/a3\/961630\/avatar.jpg.75x75px.jpg","company":"","position":""},{"username":"rgeri1977","name":"Rákosi Gergely","joined":"2014-02-01 08:30:11","lastactive":"2014-02-04 12:50:08","avatar":"http:\/\/static.sched.org\/a3\/996361\/avatar.jpg.75x75px.jpg","company":"","position":""},{"username":"rhadan","name":"Dan Walsh","joined":"2014-02-05 21:42:36","lastactive":"2014-02-06 06:59:46","avatar":"http:\/\/static.sched.org\/a3\/1004488\/avatar.jpg.75x75px.jpg","company":"","position":""},{"username":"richardhughes","name":"Richard Hughes","joined":"2013-12-19 09:23:34","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949520\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Developer"},{"username":"ricwheeler2","name":"Ric Wheeler","joined":"2013-12-19 22:41:33","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950223\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Kernel File and Storage Team Director & Architect"},{"username":"rkratky","name":"Robert Krátký","joined":"2013-02-07 03:50:19","lastactive":"2014-01-30 04:28:35","avatar":"http:\/\/a0.twimg.com\/profile_images\/1155103483\/im000085orez_bigger.jpg","company":"Liberix, o.p.s.","position":""},{"username":"robertrelyea","name":"Robert Relyea","joined":"2013-12-19 23:28:59","lastactive":"2014-02-06 04:43:08","avatar":"http:\/\/static.sched.org\/a3\/950234\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Principal Software Engineer"},{"username":"ronnicek","name":"Jindřiška","joined":"2014-02-04 02:28:42","lastactive":"2014-02-07 12:25:15","avatar":"http:\/\/pbs.twimg.com\/profile_images\/378800000236802829\/8b6fadd7d198afbc3bedf16608426fad_bigger.jpeg","company":"Tieto","position":"Senior Technical Specialist"},{"username":"ronsmeral","name":"Ron Smeral","joined":"2013-12-20 02:26:35","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950359\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Quality Engineer"},{"username":"rrelyea","name":"Robert Relyea","joined":"2014-01-17 09:19:34","lastactive":"2014-01-30 12:25:18","avatar":"http:\/\/static.sched.org\/a3\/976705\/avatar.jpg.75x75px.jpg","company":"","position":""},{"username":"ruda","name":"Miroslav Ruda","joined":"2014-02-05 13:50:09","lastactive":"2014-02-07 02:42:52","avatar":"","company":"","position":""},{"username":"russdoty","name":"Russ Doty","joined":"2013-12-19 23:11:12","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950230\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Technical Project Manager"},{"username":"Rutkovsky","name":"Vadim","joined":"2014-01-06 02:51:32","lastactive":"2014-02-08 01:17:14","avatar":"","company":"","position":""},{"username":"rvansa","name":"Radim Vansa","joined":"2014-01-27 08:11:05","lastactive":"2014-02-08 03:40:39","avatar":"http:\/\/static.sched.org\/a3\/988823\/avatar.jpg.75x75px.jpg","company":"","position":""},{"username":"sachin.prabhu","name":"Sachin Prabhu","joined":"2014-01-17 02:25:19","lastactive":"2014-01-17 12:18:24","avatar":"https:\/\/graph.facebook.com\/594446363\/picture?type=normal","company":"","position":""},{"username":"saki","name":"saki","joined":"2014-01-08 01:56:42","lastactive":"2014-02-08 12:18:30","avatar":"","company":"","position":""},{"username":"salim.badakhchani","name":"Salim Badakhchani","joined":"2014-01-28 05:02:49","lastactive":"2014-02-03 01:25:32","avatar":"https:\/\/graph.facebook.com\/690603409\/picture?type=normal","company":"Red Hat","position":""},{"username":"saruman","name":"Michael Petlan","joined":"2014-02-05 05:23:34","lastactive":"2014-02-08 08:11:45","avatar":"http:\/\/static.sched.org\/a3\/1002945\/avatar.jpg.75x75px.jpg","company":"","position":""},{"username":"scheel1","name":"Jeffrey J. Scheel","joined":"2014-01-21 06:42:16","lastactive":"2014-01-28 11:48:36","avatar":"http:\/\/static.sched.org\/a3\/981271\/avatar.jpg.75x75px.jpg","company":"IBM","position":"PowerLinux Chief Architect"},{"username":"Selth","name":"Felix Dewaleyne","joined":"2014-02-08 01:25:30","lastactive":"2014-02-09 12:16:50","avatar":"http:\/\/static.sched.org\/a3\/1007100\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"STSE"},{"username":"severingehwolf","name":"Severin Gehwolf","joined":"2013-12-20 02:43:30","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950367\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"shiri","name":"Vladimir Bruzek","joined":"2014-02-08 00:02:15","lastactive":"2014-02-08 09:07:20","avatar":"","company":"","position":""},{"username":"shortboy","name":"Petr","joined":"2014-01-16 04:16:31","lastactive":"2014-01-16 01:27:29","avatar":"","company":"","position":""},{"username":"siddharth2","name":"Siddharth Sharma","joined":"2013-01-08 01:45:51","lastactive":"2014-02-09 12:09:24","avatar":"http:\/\/static.sched.org\/a3\/510826\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Maintenance Engineer"},{"username":"Siliarus","name":"Matej Novotny","joined":"2014-02-06 15:04:36","lastactive":"2014-02-07 10:51:33","avatar":"","company":"","position":""},{"username":"SilvioMoioli","name":"","joined":"2014-02-06 22:06:38","lastactive":"2014-02-07 01:23:52","avatar":"","company":"","position":""},{"username":"simosorce","name":"Simo Sorce","joined":"2013-12-19 23:41:23","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950237\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Principal Software Engineer"},{"username":"srott","name":"Branislav Sott","joined":"2014-01-23 03:22:22","lastactive":"2014-01-23 12:37:40","avatar":"","company":"","position":""},{"username":"StanJur","name":"Stanislav Jurena","joined":"2014-01-16 23:12:28","lastactive":"2014-01-17 09:27:31","avatar":"","company":"","position":""},{"username":"stefanha1","name":"Stefan Hajnoczi","joined":"2014-01-08 00:18:20","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/961633\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Software Engineer"},{"username":"stefanmiklosovic","name":"Stefan Miklosovic","joined":"2013-12-20 05:06:07","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950415\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Associate Quality Engineer"},{"username":"stefwalter1","name":"Stef Walter","joined":"2013-12-19 23:07:20","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950229\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Tech Lead"},{"username":"stepanbechynsky","name":"Stepan Bechynsky","joined":"2013-12-19 23:53:13","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950241\/avatar.jpg.75x75px.jpg","company":"","position":""},{"username":"stephen.gallagher.31","name":"Stephen Gallagher","joined":"2013-01-08 10:49:25","lastactive":"2014-02-09 11:32:49","avatar":"http:\/\/a0.twimg.com\/profile_images\/339379095\/me_bigger.jpg","company":"Red Hat","position":"Server Experience Architect"},{"username":"stephengallagher1","name":"Stephen Gallagher","joined":"2013-12-20 00:30:28","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950258\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":""},{"username":"stribny","name":"Petr","joined":"2014-01-07 12:56:23","lastactive":"2014-02-08 11:19:16","avatar":"","company":"","position":"Java developer"},{"username":"studensky","name":"Ivo Studensky","joined":"2014-02-04 03:39:35","lastactive":"2014-02-08 05:57:54","avatar":"","company":"Red Hat","position":""},{"username":"Suchanek","name":"Jaroslav","joined":"2014-02-06 04:18:44","lastactive":"2014-02-07 01:57:05","avatar":"","company":"","position":""},{"username":"sudeshjethoe","name":"Sudesh Jethoe","joined":"2014-01-11 06:51:19","lastactive":"2014-01-15 09:42:25","avatar":"http:\/\/static.sched.org\/a3\/964933\/avatar.jpg.75x75px.jpg","company":"IBM","position":"Middleware Specialist"},{"username":"Svacina","name":"Josef","joined":"2014-01-28 04:31:28","lastactive":"2014-01-29 03:40:29","avatar":"","company":"","position":""},{"username":"tadeaskriz","name":"Tadeas Kriz","joined":"2013-12-19 11:21:37","lastactive":"2014-01-09 03:12:02","avatar":"http:\/\/static.sched.org\/a3\/949585\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Associate Quality Engineer"},{"username":"thaller","name":"Thomas Haller","joined":"2014-02-07 07:35:42","lastactive":"2014-02-08 01:51:59","avatar":"","company":"","position":""},{"username":"thleemhuis","name":"Thorsten Leemhuis","joined":"2012-11-01 10:47:01","lastactive":"2014-02-09 12:30:55","avatar":"http:\/\/static.sched.org\/a2\/475869\/avatar.jpg.75x75px.jpg","company":"Heise publishing group: c't \/ heise open","position":"Editor"},{"username":"thomasgraf","name":"Thomas Graf","joined":"2013-12-19 04:03:03","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949426\/avatar.jpg.75x75px.jpg?1f1","company":"Red Hat","position":"Principal Software Engineer"},{"username":"thomaswoerner","name":"Thomas Woerner","joined":"2013-12-19 12:33:58","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949635\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"thorstenleemhuis","name":"Thorsten Leemhuis","joined":"2013-12-19 22:30:09","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950219\/avatar.jpg.75x75px.jpg","company":"Heise Zeitschriften Verlag","position":"Editor"},{"username":"timburke","name":"Tim Burke","joined":"2014-02-05 08:00:49","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/1003113\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"VP Cloud Computing and Virtualization Development"},{"username":"tjanez","name":"Tadej Janež","joined":"2014-02-06 16:07:10","lastactive":"2014-02-09 01:13:50","avatar":"http:\/\/static.sched.org\/a3\/1005507\/avatar.jpg.75x75px.jpg","company":"","position":""},{"username":"tom.cerny","name":"Tomas Cerny","joined":"2014-01-29 03:32:20","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/991799\/avatar.jpg.75x75px.jpg","company":"Czech Technical University","position":"Researcher"},{"username":"tomas.kyjovsky","name":"Tomáš Kyjovský","joined":"2014-02-06 11:22:00","lastactive":"2014-02-08 02:54:40","avatar":"http:\/\/m.c.lnkd.licdn.com\/mpr\/mprx\/0_Dv0vDVFxE4TktfNw7KOoDMLYHR6LrfLwfAIoDMN_cg-zfw-ITPfM_JhS69QVPHXb2njwGOoMRciV","company":"Red Hat","position":"QA Engineer"},{"username":"tomas.marny","name":"Tomas","joined":"2014-02-06 14:12:24","lastactive":"2014-02-06 11:12:27","avatar":"","company":"","position":""},{"username":"tomashozza","name":"Tomas Hozza","joined":"2013-12-20 00:41:57","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950273\/avatar.jpg.75x75px.jpg?272","company":"Red Hat","position":"Software Engineer"},{"username":"tomashradec","name":"Tomas Hradec","joined":"2013-12-20 02:48:17","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950369\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Quality Engineer"},{"username":"TroChakerian","name":"Tro Chakerian","joined":"2014-01-16 04:54:54","lastactive":"2014-02-05 09:34:51","avatar":"http:\/\/static.sched.org\/a3\/974631\/avatar.jpg.75x75px.jpg?2c0","company":"Lebanon Evangelical School","position":"Computer Assistant"},{"username":"ttomecek","name":"Tom Tomecek","joined":"2014-01-08 00:06:16","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/961629\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"tuzticzka","name":"Martin Pavlásek","joined":"2014-02-06 17:09:13","lastactive":"2014-02-07 02:15:56","avatar":"","company":"RedHat","position":""},{"username":"umi","name":"Valentina Mukhamedzhanova","joined":"2014-02-06 07:44:07","lastactive":"2014-02-09 12:09:37","avatar":"","company":"","position":""},{"username":"Vasek","name":"Jiri","joined":"2014-02-01 10:43:15","lastactive":"2014-02-08 06:31:21","avatar":"http:\/\/pbs.twimg.com\/profile_images\/2629609398\/36147e7da9b122b7abd7c987e53558f5_bigger.jpeg","company":"","position":""},{"username":"vbocek","name":"Vojtech Bocek","joined":"2014-02-01 13:59:03","lastactive":"2014-02-08 01:44:34","avatar":"","company":"","position":""},{"username":"veros.kaplan","name":"Věroš Kaplan","joined":"2014-02-06 00:26:56","lastactive":"2014-02-07 09:40:23","avatar":"https:\/\/graph.facebook.com\/1026818714\/picture?type=normal","company":"","position":"Digital Wizard"},{"username":"vlastimil.holer","name":"Vlastimil Holer","joined":"2013-02-14 09:33:05","lastactive":"2014-02-09 01:55:07","avatar":"http:\/\/graph.facebook.com\/1373062140\/picture?type=normal","company":"Masaryk University","position":""},{"username":"vlastimilelias","name":"Vlastimil Elias","joined":"2013-12-20 05:20:12","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/950420\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Software Engineer"},{"username":"VojtechVitek","name":"Vojtech Vitek","joined":"2013-01-08 06:46:20","lastactive":"2014-02-06 10:35:53","avatar":"http:\/\/m.c.lnkd.licdn.com\/mpr\/mprx\/0_UiHHfFs8Fs2CRIlHJ6dBf5e8Fxo7UIrHJGpBf5Iy4sOYk7FecL4XTLxtdAEl42AXsho9hGvz_yll","company":"Red Hat","position":"Software Engineer"},{"username":"vratislavpodzimek","name":"Vratislav Podzimek","joined":"2013-12-19 12:16:47","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/949622\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Software Engineer"},{"username":"vtrefny","name":"Vojtech Trefny","joined":"2013-12-19 01:05:50","lastactive":"2014-02-09 10:48:52","avatar":"","company":"Red Hat","position":""},{"username":"wally1980","name":"Vali Lazarov","joined":"2014-02-05 05:21:55","lastactive":"2014-02-05 02:31:05","avatar":"","company":"IBM","position":"IT Infrastructure Architect"},{"username":"walters5","name":"Colin Walters","joined":"2014-01-23 07:05:10","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/984304\/avatar.jpg.75x75px.jpg","company":"","position":""},{"username":"xhodai00","name":"Radek Hodain","joined":"2014-01-07 02:42:40","lastactive":"2014-01-07 11:50:27","avatar":"","company":"","position":""},{"username":"xorwen","name":"Ondřej Veselý","joined":"2014-02-05 05:54:01","lastactive":"2014-02-05 02:56:17","avatar":"","company":"","position":""},{"username":"xsuchy","name":"Miroslav Suchý","joined":"2014-01-07 04:45:32","lastactive":"2014-01-08 03:40:15","avatar":"http:\/\/static.sched.org\/a3\/960745\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":""},{"username":"yaplik","name":"yaplik","joined":"2014-02-06 14:07:47","lastactive":"2014-02-08 04:07:50","avatar":"http:\/\/pbs.twimg.com\/profile_images\/3169407837\/a0ec9873a0703c6307b771a82f92d7f5_bigger.jpeg","company":"","position":""},{"username":"yr1974","name":"Yiannis Rossopoulos","joined":"2014-02-06 13:45:10","lastactive":"2014-02-09 09:51:40","avatar":"http:\/\/m.c.lnkd.licdn.com\/mpr\/mprx\/0_IP83M2c1AXm6yvg_dzGtMmQ015MdKvS_dcNYM7ka2iSJ7AsibvKDcfrhjeJ91tu7oKC0nHV1bFuI","company":"AT&T","position":"Enterprise Storage Admin"},{"username":"yuedaval","name":"Jose Castillo","joined":"2014-01-09 02:56:37","lastactive":"2014-01-10 12:07:46","avatar":"","company":"","position":""},{"username":"zajca","name":"Martin Na Smetaně Zajíc","joined":"2014-02-02 23:17:36","lastactive":"2014-02-03 08:42:11","avatar":"https:\/\/graph.facebook.com\/1119616092\/picture?type=normal","company":"PRIA","position":""},{"username":"Zajic","name":"Pavel","joined":"2014-02-06 11:59:13","lastactive":"2014-02-08 02:46:25","avatar":"","company":"","position":""},{"username":"zdenekkabelac","name":"Zdeněk Kabeláč","joined":"2013-01-06 09:13:26","lastactive":"","avatar":"http:\/\/static.sched.org\/a3\/510095\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":""},{"username":"zeenix","name":"Zeeshan Ali","joined":"2013-02-19 18:49:06","lastactive":"2014-02-07 12:39:18","avatar":"http:\/\/static.sched.org\/a2\/547023\/avatar.jpg.75x75px.jpg","company":"Red Hat","position":"Senior Engineer"},{"username":"zigi","name":"Karel Ziegler","joined":"2014-01-26 11:55:52","lastactive":"2014-02-08 12:39:33","avatar":"http:\/\/static.sched.org\/a3\/987570\/avatar.jpg.75x75px.jpg","company":"Etnetera a.s.","position":"Linux & Network Sysadmin"},{"username":"Zila","name":"Kristian","joined":"2014-02-07 01:42:28","lastactive":"2014-02-08 02:35:14","avatar":"","company":"Tempest","position":"Linux Administrator"},{"username":"Zingor","name":"MacZingor","joined":"2014-02-08 00:21:42","lastactive":"2014-02-08 06:17:10","avatar":"","company":"","position":""},{"username":"zlo","name":"Zdenek Letko","joined":"2014-02-06 08:16:09","lastactive":"2014-02-06 05:24:45","avatar":"http:\/\/static.sched.org\/a3\/1005063\/avatar.jpg.75x75px.jpg","company":"FIT BUT","position":""},{"username":"zopper.cz","name":"Jan Ťulák","joined":"2014-02-06 01:41:46","lastactive":"2014-02-09 11:33:16","avatar":"https:\/\/graph.facebook.com\/1385931694\/picture?type=normal","company":"","position":""},{"username":"_scollier_","name":"Scott Collier","joined":"2014-01-30 06:53:21","lastactive":"2014-01-30 09:19:07","avatar":"","company":"","position":""}],"days":[1391727600,1391814000,1391900400],"rss":[{"title":"Check out the conference schedule!","link":"http:\/\/www.devconf.cz\/content\/check-out-conference-schedule","description":"Take a look at www.devconf.cz\/schedule for the full conference schedule. We have 96 main speakers and several additional ones lined up for Lightning talks. Alltogether we plan to have 95 session and 6 sessions full of Lightning talks. It's going to be a PACKED EVENT!Language \n English\n","time":1389043252},{"title":"OpenShift Winter of Code","link":"http:\/\/www.devconf.cz\/content\/openshift-winter-code","description":"The OpenShift Winter of Code  is a competition for the best application built on OpenShift. From most practical to the most crazy, submit your applications and win fabulous prizes. The competition ends right before the conference. The best applications will be awarded and shown at the conference. Good luck!Language \n English\nTags:&nbsp;OpenShiftCompetition","time":1385385839},{"title":"Public call for papers for DevConf 2014 has started!","link":"http:\/\/www.devconf.cz\/content\/public-call-papers-devconf-2014-has-started","description":"We're looking for 45-minute presentations, 90-minute (and longer) workshops\/labs, and 15-minute short talks. The talks should be targeted at developers who already have some understanding of the technology. We're looking for architecture talks as well as talks about development plans, possible participation in projects, testing new features or even using these cool new features to improve productivity of develoeper's tough life.We usually have the following tracks: Kernel, CoreOS, Desktop, JBoss, Cloud, Virtualization, Security, Fedora.Language \n English\n","time":1382102635}],"about":[{"title":"About","text":"Developer Conference is a yearly conference for all Linux and JBoss Developers, Admins and Linux users organized by Red Hat Czech Republic, the Fedora and JBoss Community. 2013 DevConf had over 60 talks in 3 different tracks and additional to that 3 more rooms with workshops and hackfests. With around 600 participants DevConf.cz is one of the biggest events about free software in the Czech Republic."},{"title":"Venue","text":"\nBrno is by population the second largest also the largest city of Moravia and historic former capital of Moravia. Additionally, it is also the center of the judiciary,  located there are the seats of the Constitutional Court, Supreme Court, Supreme Administrative Court and Supreme Public Prosecutor's Office. Besides, it is very important administrative center, because the state authorities with national enforcement powers and other important institutions reside there. Brno is also one of the most important university cities of the Czech Republic. It is home of 13 universities and colleges, which are attended by more than 90 000 students. The biggest one is Masaryk University, with more then 30.000 students. It is Faculty of Informatics of this University that hosts DevConf.cz.<br\/>\nPlease note that the Faculty is currently under reconstruction. The new entrance is on the back part of the building, closer to the conference rooms.<br\/><br\/>\nAddress of the faculty is: <br\/>Masarykova univerzita Brno - Fakulta informatiky <br\/>Botanická 554\/68a <br\/>602 00 Brno <br\/>Czech Republic <br\/>+420 549 491 810 <br\/> <br\/> The faculty on the <a href=\"geo:49.21,16.599201\">map<\/a>."},{"title":"Accommodation","text":"For conference participants, we ensured  hotel accommodation in Avanti hotel ****, which is located a 5-10 minute walk from the venue. You are going to stay in comfortable double-bed rooms with breakfast and free parking in front of the hotel. A special rate for conference attendees is 1400 CZK (€55\/$72) for a double-bed room per night. There is free wi-fi, restaurant services, cafe, bowling, and wellness services. <br\/><br\/>\nAvanti hotel<br\/><br\/>\nThe booking for DevConf 2014 will start soon.<br\/><br\/>\nOther recommended hotels in Brno are:<br\/><br\/>\n    Continental ****<br\/>\n    Vista Hotel ***<br\/>\n    A-Sport Hotel *** (very close to the Red Hat office)\n"}],"checksum":"89a9e517b036e257915f5c25e85e3278c4edbcbf","timestamp":1391945652}